{
  "articleId": "isaw_paper7_12",
  "text": "ARTICLE_ID: isaw_paper7_12\nISAW Papers 7.12 (2014)The Europeana Network of Ancient Greek and Latin Epigraphy (EAGLE)Pietro Maria LiuzzoEAGLE is a Best Practice Network (BPN) that brings together several European institutions1 and archives in the field of Classical Latin and Greek epigraphy.2 This is a different Eagle from that of the Electronic Archive of Greek and Latin Epigraphy, although all members of this Eagle are also in the project.#p1The E in EAGLE project stands for Europeana,3 the european catalyst for change in the world of cultural heritage brought to us by The Europeana Foundation. Europeana is a Network, and so is Eagle, sharing a vision which is:#p2making cultural heritage openly accessible in a digital way, to promote the exchange of ideas and information4This Eagle is therefore The Europeana Network of Ancient Greek and Latin Epigraphy and its main aim is to provide Europeana with a broad collection of inscriptions, which are a specific type of content currently only sparsely present. By the end of the project Eagle will supply inscriptions coming from 25 EU countries, providing more than 1.5 M sets of metadata regarding images of inscriptions, inscriptions, contextual material (monuments and materials) and translations (of a selected group of inscriptions).#p3Through a careful mapping of existing data models in use by the Content Providers, 5 EAGLE will implement an inscription-specific metadata model. This will be based on Epidoc Guidelines6 for the editions of texts and on existing standards in use at Arachne7 for metadata of photographs, while following recommendations developed through sister Europeana projects.All edited texts and all images will be available in XML and be interoperable with other epigraphic projects, and will then be represented in EDM (Europeana Data Model)8 to enter in the Linked Open Data World.9#p4EAGLE is thus an aggregator10 and will have for the same reason also a platform to search and browse inscriptions. On the side of what Eagle would like to link with, there is certainly the possible collaboration in the future,11 to develop an editing tool for inscriptions which will allow further contributors and participant to join the BPN.12#p5Eagle will also develop two Applications:#p6a mobile application to enable users to get metadata about inscriptions they find on location by sending in a picture to the EAGLE portal.a storytelling application to allow users to assemble epigraphy-based narratives (mostly for the benefit of non professional users).13Finally, Eagle is proud to work in partnership with Wikimedia Italia14 with which will set up a Wikibase15 MediaWiki for the enrichment and curation of epigraphic images and texts, with special emphasis on translations. This will allow wikipedia users to link images and metadata of inscriptions from authoritative sources, and will make references in wikipedia much richer, providing a basis for a future collaborative effort towards translations of all inscriptions in many languages.#p7EAGLE will make connections within its BPN, being part of Europeana and being part of Wikidata and Wikisource, with different kinds of users and with all those people, institutions and projects who will decide to join. But EAGLE main concern is to link within its data to the Linked Ancient World Data, to enrich the possibility to discover scholarly significant connections among scientific databases.EAGLE will take inscriptions out of isolations opening them up for relations and connections.#p8One first way to do this will be to provide one stable Trismegistos URI16 to each inscription, the value of which is not only that of providing a stable link and identifier, but also to give a clear and univocal reference which can be used in printed publications, linking in this way also outside the web.#p9A second way will be to have all Geographical informations converge to Trismegistos Places, to find inconsistencies and get a stable ID17 which will be then linked following the Pelagios Cookbook18 to Pleiades,19 which will in turn make the richness of possible links to geographical information exponential.#p10The third main way among others will be the definition of common structured thesauri.20 EAGLE is already taking up a major task of alignment and definition of each term in use by the BPN in five different fields of information: Type of Inscription; Object Type; Material;21 Writing technique; Decoration.22 Each term will be associated with the values in use by each other content provider and will be given definitions with examples. This is because there is a shared need for an alignment and full definitions, as vocabularies in use in different projects often differ not only in their names and number, but in definitions, attribution to a specific field, not to mention translations of values which are often not univocal at all, and might create ambiguities and problems. EAGLE will develop these thesauri23 and will keep them exposed and accessible all the way long with stable URIs.24#p11EAGLE has a main focus on images for two reasons. The first is that to achieve the functions of the application described above, CNR-ISTI will also develop within EAGLE a full image recognition system which will enable people to get more information from all these networks of data via a smartphone while enriching the database of photographs of inscriptions.#p12Secondly, according to the DEA all metadata (including all the EPIDOC-XML editions of texts) will by licensed under Creative Commons CC0 licence (1.0 Universal Public Domain Dedication),25 but for images it is not always the case that owners are willing to give them up. Most of the images in EAGLE are already licensed under CC BY-SA and EAGLE will put effort in renegotiating current permissions to foster the CC-BY-SA or CC0 licensing for the images of its BPN and in any case provide clear labelling for all materials according to Europeana guidelines and requirements.26 EAGLE BPN believes that open licensing is a very powerful tool, together with LOD to guarantee the continuous increase of openly accessible and reusable material."
}