{
  "articleId": "isaw_paper22_4",
  "text": "ARTICLE_ID: isaw_paper22_4\nHounds and Jackals is the modern name given to a game found at Thebes in Egypt, in the tomb of Reniseneb, dated to the reign of Amenemhat IV (c. 1814-1805) (Figure 1).1 This ivory game set has become iconic not only due to its elegance, but also because it is the only example that retains all of its pegs, five per side.The game found in the tomb of Reniseneb has a drawer.The report says that the pegs no doubt, were kept in the drawer (Carnarvon and Carter 1912 56) but one ivory pin was found in the lower fill of the shaft and the rest under the coffin twisted with other objects. Early examples of this game were found in funerary and domestic contexts dating from the First Intermediate Period (c. 2150-2030) and the Middle Kingdom (c. 2030-1640).2 The clay board found at Lahun in 1889 was introduced by Sir Flinders Petrie as a totally different game, unknown in Egypt.3 He deduced from the holes that it was played with pegs moving up and down the tracks.Petrie, insisting on the importance of modern games principles to understand ancient games, is the first to use the appellation game of 58 holes as there usually are two symmetrical tracks of 29 holes punched in a fixed pattern. This name should preferably be used since pegs with heads of hounds and jackals have not been retrieved outside of Egypt.Figure 2.Distribution of the game of 58 holes during the 2nd and 1st millennium BCE.The military, diplomatic and commercial relations that connected Egypt and its neighbors facilitated the spread of board games (Figure 2).The game of 58 holes is attested in Nubia and central Anatolia as early as the beginning of the second millennium BCE. After the Middle Kingdom, Egyptian examples are scanty.The increasing importance of Senet in funerary rituals during the New Kingdom may explain this phenomenon.The game of 58 holes was popular throughout the Middle East, including the Iranian plateau, until the mid-first millennium BCE.There are about eighty known examples of boards to date.4 Also, outdoor rock carvings with dotted patterns dated to the Bronze Age and bearing similarity with the game have been found in the region around Baku, Azerbaijan, pushing northward the limits of the distribution of the game.5Egypt is credited for the origin of this game, but its simultaneous appearance in Anatolia at the beginning of the second millennium BCE and the fact that variants lasted in the Middle East until the middle of the first millennium BCE raise the question of its true place of creation.6 The morphology of the boards varies over time. We can distinguish chronological and regional groups, with nuances within a group.Irving Finkel defined three styles based on the shape of the board and the way special fields are marked.7 For Style A, we note links between holes and signs juxtaposed to other holes (Figure 3).8 Special fields in Style B are emphasized by their size, inlays, andor rosettes (Figure 4).9 Boards attributed to Style C have links that we believe allow one player to cross to the other track (Figure 5).10Figure 3 (left). Style A Game Board from Thebes, Egypt.The Metropolitan Museum of Art, Rogers Fund, 1926, 26.3.154.Image u00a9 The Metropolitan Museum of Art.Figure 4 (right).Style B Game Board from Megiddo, Israel.Rockefeller Museum, Jerusalem, no. 38826, drawing by Jennifer Steffey after Loud 1939, pl. 47.Like other board games, the shape and decoration of Hounds and Jackals embody symbolic meanings in the ancient world, but this wont be discussed here. Instead, this paper presents the historiography of the game, and the interpretations of its evidence, with reconstructed equipment and rules, as well as examples of its use in a museum context.Figure 5.Style C Game Board from Tepe Sialk, Iran.Louvre, AO 19438 u00a9 2010 Musu00e9e du Louvre Raphau00ebl ChipaultHistoriography and interpretations of the gameDuring the first part of the nineteenth century, knowledge about ancient games was nascent. Despite the fact that the game of 58 holes in the shape of a hippopotamus from the Salt collection was almost complete, when it entered the Louvre in 1827, it was cataloged as a frog-shaped writing case, the larger holes being interpreted as ink-wells.11 It was not identified as a game board until Petrie and Brunton published it a century later with a game table from Sedment and other examples from Egypt (Lahun, Thebes, two unprovenanced examples in the Cairo museum) and the Middle East (Susa, Gezer) revealing the remarkably wide spread of the game from the Nile Valley to Iran.12In the absence of physical evidence, the rare visual representations of the game were not identified in the early nineteenth century. In the 1820s, German scholar Gustavus Seyffarth (1796u20131885) visited European collections to gather ancient Egyptian inscriptions.In the Museo Egizio in Turin, Seyffarth thought he had discovered the first astronomical papyrus and interpreted the illustrations on Papyrus 1775 as Zodiacs.13 This unique document dated to the Twentieth Dynasty (c. 1186-1070) is in fact illustrated with four drawings of games two detailed Senet; one combination of two games of 20 squares, named Thirty-one after the number of squares; and the fourth drawing is a rather fragmentary game of 58 holes, corresponding to the top part of a fiddle-shaped board. The papyrus is also known as the Great Game Text after its hieratic text about Senet.From the drawing of the game of 58 holes, Seyffarth elaborated two circular reconstructions and gave a celestial interpretation to the dots.Astronomical associations with board games are often noted, but Seyffarths is considered less serious, since (he) was already ready to engage in astrological readings.14By the end of the nineteenth century, Egyptologists had more gaming material at their disposal, so the historical research of board games became better informed but due to the nature of the evidence, studies were mainly related to Senet and the game of 20 squares. A pivotal turn happened in 1910 with the discovery of the unique ivory gaming set mentioned earlier. It was found in the tomb of Reniseneb dated to the Twelfth Dynasty after a toilet box with the name of Amenemhat IV (c. 1814-1805).The excavator, Howard Carter, called it Hounds contra Jackals after the pin-like playing pieces.Carter made the first attempt to understand the game and described it as a game of chance, suggesting that astragals or dice were used.The wealth of Egyptian material brought to light, and the better preservation of perishable media, made research about ancient games from Egypt a precursor to studies of Middle Eastern games.In the Middle East the identification of the boards was not fully established until the 1930s. The earliest discovery in the region was a board from Ur in Southern Iraq, acquired in 1859 by the British Museum and registered then as a quadrangular object.15 The next boards were found in the southern Levant, northern Iraq and Iran but they were not recorded as games at first.The main reasons for their misidentification are their unfinished or fragmentary state and the absence of gaming pieces.The board from Gezer in Israel was initially identified as an Ashtoreth plaque because it looked like a distorted anthropoid shape and some holes were not fully pierced.16 It remained described as such until Petrie, familiar with the Egyptian material, included it in the list of comparanda discussed earlier with the Sedment table along with an example from Susa in Iran. Several stone tablets, unfortunately all incomplete, were found at Susa in 1904 by Jacques de Morgan under the temple of Inshushinak.17 The excavator and the Louvre curators suggested that it could be some kind of a Solitaire game, a device to calculate (because every fifth hole is marked), or a magical tablet.Following the discovery of the Royal Game of Ur in Southern Iraq in the 1920s, board games made their way into the Reallexikon der Assyriologie, in the short entry Brettspiel, but nothing was said about the game of 58 holes yet.Finally, the first extensive catalogue of games of 58 holes from Egypt and the Middle East was carried out by Etienne Drioton in 1940 in his survey of the so-called Coptic game.18 He recognized the function of the wooden box from Antinou00eb that was originally described as a rosary (to mark prayers) by Albert Gayet. Drioton naturally devoted a great part of his study to the game of 58 holes because of its resemblance to the Coptic version with its two tracks of 29 holes, and usage of pegs and counting devices.His detailed presentation of the Egyptian games is valuable, notably because he had access to an unpublished catalog of the games in the Cairo museum.Drioton rejected the idea of this type of game being a Solitaire and discussed in contrast the implication of having two players. Moreover, he confirmed Carters route of play.In the 1950s, the reception of the game reached popularity in Hollywood.The epic movie The Ten Commandments directed by Cecil DeMille, featured a scene where Seti (Cedric Hardwicke) and Nefertari (Anne Baxter) are playing the game of Hounds and Jackals with super-sized equipment and a separate color of pegs for each side.19 By the mid-twentieth century, more than thirty examples of the games of 58 holes had been identified among the archaeological material and museum collections. The study of board games has accelerated in the second part of the twentieth century with publications and exhibitions devoting a small or large part to the game of 58 holes.20Naming the gameWe still dont know what the original name of the game was.Many modern descriptive names have proliferated.They are inspired by the shape and decoration of the ancient boards and pieces, such as Hounds contra Jackals, Palm tree game, Pegs and holes and Shield game. Other designations derive from the track that characterizes the game, like game of 58 holes.The field is completed at the end by a thirtieth hole, larger or at least specially marked.This led to the appellation game of thirty points. A less common name is Shen, the Egyptian hieroglyph for eternity and protection, sometimes represented around the goal.Monkey Race is the name based on the monkey shaped pin heads found in the same deposit as the fragmentary boards at Susa in Iran.21What about the possible identification of the name in ancient texts? The only evidence is an inscription accompanying a playing scene from the main chamber of the tomb of Baqet III at Beni Hasan in Egypt.22 The painting is situated in the lower part of the wall, so it suffered more erosion.Two players are engaged around a bowl and a zoomorphic shaped table with four sticks.The sticks evoke the gaming pegsu2014the flat horizontal heads possibly imitate the jackals long muzzleu2014whereas the bowl could be used by the players to throw an equivalent of dice. The hieroglyphs above the scene are unfortunately illegible so we cant figure out what it means.It reads imby with a possible playing piece determinative.It has been suggested that its a word transcribed from another language possibly indicating a foreign origin for the game.Other captions associated with playing scenes and readable are usually commenting on a players move.Future campaigns in situ at Beni Hasan might help better understand what was originally represented and notably inscribed.Reconstructing the equipment and the rulesThe rules of the game are easily reconstructed. Pierrat 1998The gaming aspects of the boards have been controversial since they were first discovered.Non-recreational functions have been suggested even until recently, but the interpretation of these objects as game boards is the most generally accepted.Since the time of the earliest physical evidence of the game, it has been part of the playing sphere as attested by Egyptian tomb paintings.It not only shares the same motifs as other board games, it sometimes belongs to the same object, namely as part of bifacial boards.23In Egypt, pegs with dog and jackal heads are found in wood or ivory. The velocity of these animals is appropriate for a racing game.Ivory pegs with a notch at the top were found with board games at Megiddo in Israel.24 They may imitate the jackal head with pointed ears.It is noteworthy that no other pieces are identified in the Middle East where this game was played until the middle of the first millennium BCE.Certain pegs, much like boards and dice, were obviously made of wood which is a perishable material. Others, notably those fashioned out of ivory or metal and which are preserved until now, have probably been ignored or erroneously catalogued as pins.25In the absence of casting implements directly associated with any board in Egypt, we can only wonder what kind of dice was rolled to move the pegs.26 False associations have been made for the randomization devices.It surely helps people imagine what the game might have been played with but one must always look at the sources, the excavation reports if available. For example, the rock crystal board from Babylon, now in Berlin, is often photographed with two cubic dice from the same site but not from the same archaeological context.Cubic dice are attested in Mesopotamia since the mid-third millennium BCE but their use with a specific board game cant be confirmed based on excavated material.Another fabricated, but more plausible, set shows the Hounds and Jackals game table from The Met with astragals. The latter dont belong to the same Theban tomb but were used in Egypt and are attested with board games from the Seventeenth Dynasty and later.We are not sure if Egyptians used them in the early periods to move pegs along the board, but we know astragals were found in the same context as games of 58 holes in Iran at Tepe Sialk and Susa.The use of throwing sticks is also possible as it is well documented for other types of board games, such as Senet and the game of 20 squares. Moreover, there are two-sided dice like other small artifacts found with boards in the Middle East.One game of 58 holes was closely associated with disks interpreted as possible counting devices at Nippur, Iraq.27 Disks with one side marked were also found in the Ivory Hoard at Megiddo in Israel, where the famous fiddle-shaped boards were discovered.28 According to the Beni Hasans paintings mentioned above, the players probably threw the equivalent of the dice in a bowl or basket placed on the ground. In Nippur, the board and disks were found in a bowl that could have been used to toss the disks.The game of 58 holes is visually compared to modern games with pegs and holes such as the card game cribbage, traveling chess and Solitaire.But these comparisons are purely visual.In contrast to the game of 20 squares, the ancient rules were not retrieved.The study of the preserved examples and comparisons with other race games allow possible reconstructions, but these do not relate to modern Egyptian or Middle Eastern games. Rather, these reconstructions assume an aim and method of play comparable to games like Pachisi (Finkel 2004a) and Snakes and Ladders (Finkel 2004b), both games created in India which became popular world-wide with simplified variations.Figure 6.Route of play, after Carnarvon and Carter 1912 57, fig. 14The above statement from Egyptologist Geneviu00e8ve Pierrat who claims that she does not know anything about games, demonstrates how self-evident the game can appear at first. Several attempts have been made to reconstruct the rules.29 Archaeologists and experts on the history of games unanimously interpreted it as a race game due to the arrangement of the board.Most reconstructions are based on the Theban assemblage.Each player has five pieces and either the left or right track.Carters reconstruction30 is the most likely route of play because the middle rows of holes are separated from the central position at the top that clearly stands out as the goal (Figure 6). Carter considered the lines connecting the holes 6 to 20 and 8 to 10 as forced retreats, in opposition to the sign nefer, good, juxtaposed to holes 15 and 25, which probably granted a second roll.The game was probably over when all of a player's pieces reached the larger hole at the top, which was surrounded by a shen-ring, meaning eternal protection.Games specialists describe the game as boring since each player races on a separate track, with no apparent direct interaction.31 Petrie and Brunton thought the pegs were different because players would use all the tracks and intermix them.32 Style C from Iran with links between the opponents tracks make interactions visible and a more enjoyable33 version. Some authors suggest variations to introduce a little interaction between players, making tactics like blocking a part of the game, or having the pieces continuing round the board to the opponent's point 1, bearing off from that point rather than stopping at point 30.34Display in museums, reproductions and reimaginationsAncient games are mostly exhibited within the chronological or geographical itinerary of permanent galleries, or presented in thematic display with material illustrating daily life and entertainment, often close to musical instruments. Examples of the game of 58 holes can be seen in museums in the Middle East, Europe and the United States of America.35 Some of these museums offer modern reconstructions as well as activities, in person or virtual, around this game.Two different types of reproduction of the game of 58 holes happened in a museum context in the 1990s. A flat version of the Theban board, played with small chips rather than pegs, was recreated in a boxed set by British Museum expert Irving Finkel36 whereas a resin copy of the Louvre hippopotamus u2014 with pegs and stick dice made after objects in the Louvre collection but not acquired with the board u2014 was edited and sold by the Ru00e9union des Musu00e9es Nationaux37.Figure 7. Workshop Forgotten Games of Antiquity animated by Christiane Luy at the Swiss Museum of Games (La Tour-de-Peilz).At the Swiss Museum of Games (La Tour-de-Peilz), the workshop Forgotten Games of Antiquity begins with a tour of the museum, centered on ancient civilizations, comprising an example of the Coptic variant of the game of 58 holes.The participants can later play ancient games from Egypt and the Middle East, especially the game of 58 holes on the flat version published by Irving Finkel. The animator gives additional directions based on the publication by the Belgium archaeologist Catherine Breyer (Figure 7).The latter is in charge of the website Jocari, in service since 2008, that presents toys and games from ancient times to 1789 and offers reconstructions to allow one to play.38 Most of the boards and pegs known to date for the game of 58 holes are recorded.Figure 8.Modern version of the game of Hounds and Jackals, Le Comptoir des Jeux.Access to museum databases online is increasing. In March 2021, the Louvre launched its new website Collections which is a great resource for board games researchers.39 Until recently, the museum also offered a digital itinerary that visitors could print to discover dozens of stations showcasing ancient board games in the galleries of Near Eastern and Egyptian antiquities.40 Moreover, during a family event called the Nocturnes Louvre, visitors were invited to play ancient games, including the game of 58 holes, provided by Le Comptoir des Jeux, a store established in 2003 by game expert Jean-Manuel Mascort (Figure 8).41Modern reconstructions for the game of 58 holes are mostly based on the ivory example from Thebes. Fanciful reimaginations of the game continue to convey the Egyptian identity of the game with the use of Egyptian imagery (sphinx, oudjat eye) and hieroglyphs.However, recent variations inspired by examples from the Middle East u2014 fiddle-shaped boards from Megiddo and Mesopotamian tracks with rosettes u2014 can be found on the Italian website Historygames.it.42The recording of the game of 58 holes has progressed considerably in recent years u2014 thru examination of archaeological reports and surveys in museum collections u2014 as evidenced by the doubling of the number of known originals, over eighty to date against more than forty43 in 2008. The special arrangement often found from one board to another to indicate starting holes, goal and other important positions, makes it possible to recognize fragments of the game quite easily.Nonetheless, more game accessories are certainly awaiting to be identified in archaeological deposits and museums.Despite the profusion of evidence, the game remains mysterious.Hopefully, new material as well as careful interpretation of game related texts and playing scenes might contribute to elucidating its ancient name(s) and confirm reconstructed rules. Modern variations of the game have also multiplied in recent years, as reimagined reproductions or digital versions, allowing players to share some fun time while discovering other cultures."
}