{
  "articleId": "isaw_paper24",
  "text": "ARTICLE_ID: isaw_paper24\nThe Anthologies of Vettius Valens is the most extensive practical astrological text which survives from Greek antiquity.2 The Anthologies consists of nine books, which include a huge quantity of information on astrological methods as well as catalogues of predictions.In total, the Anthologies contains around 130 partial or complete horoscopes ranging from 37-188 CE, some of which are used multiple times.3 These horoscopes suggest that the majority of the work was written between 152 and 162 CE, and the Anthologies has been in almost constant use since.4 As a resource for 2018literary horoscopes (i.e. those not from an original text, such as papyri) it is unparalleled Neugebauer and Van Hoesen noted there would only be five other extant literary horoscopes dating from before 380 CE if the Anthologies had not survived. 5 Although we have little external biographical information about Vettius Valens, one of these horoscopes was suggested by Pingree to be that of Valens himself.6 From this horoscope and the associated details Valens provides, we can infer that he was born on 8 February 120 CE in Antioch, travelled widely, including to Egypt, and spent the majority of his working life as an astrologer in Alexandria.72b08#p1Valens is often contrasted with his near-contemporary Ptolemy (c.1002013c.170 CE), also associated with Alexandria. Although both wrote on astrology, their styles are markedly different.In particular, Valens work is often characterised as practical, in opposition to the more theoretical work of Ptolemys Tetrabiblos.According to Neugebauer, the Anthologies and the Tetrabiblos were written almost simultaneously but exhibit a strong difference in style and purpose Valens work seeks to 2018confirm and refine growing [astrological] doctrine, whereas Ptolemys seeks to form a 2018consistent theory of2026 a universal science of life. (Neugebauer 1954, p. 67). Riley makes a similar case, characterising Ptolemys work as 2018axiomatic in its method Ptolemy 2018lays down principles that are universally true, then he applies them in individual cases; whereas Valens is 2018quasi-exhaustive, constructing 2018listings of configurations that go on 2018at great length (Riley 1987, p. 249).2b08#p2Given this contrast, if Ptolemy is a systematic philosophical thinker it may be tempting to treat Valens as his opposite a miscellanist, churning out regurgitated screeds of astrological lore. This picture may also be influenced by our knowledge of Ptolemys wide variety of other interests, primarily in astronomy but also in geography, harmonics, and optics (the latter two in lost works).8 Indeed, even within the Tetrabiblos Ptolemy considers wide areas of astrological inquiry which are absent from the Anthologies, devoting large sections to 2018general astrology, which pertains to predictions that affect 2018whole races, countries, and cities9 and including geographical material and predictions of the weather. By contrast, the Anthologies is presented by Valens himself as a handbook for practical astrology.2b08#p3Scholars have not been impressed by Valens as a thinker Cumont (1937) called him 2018narrow-minded and devoid of originality (p. 18)10 and Riley (1987) notes that when Valens attempts 2018empirical proofs of his craft, these are little more than the retrofitting of observed events to his own previously cast horoscopes (p. 248).11 It is certainly true that Valens does not attempt2014or seem to show any interest in2014either a detailed philosophical account of the physics of the heavens or a wider investigation of the implications of astrology. This broad contrast between practical and theoretical often carries a (sometimes explicit) value judgement in Ptolemys favour (Riley 1987, p. 236).Nevertheless, it does not follow from this contrast in method and aims that Valens work was free of conceptual underpinnings.Nor does it follow that it was unsystematic or unscientific 2013 a suggestion implicit in Riley and others.12 In this article we make the case that Valens lists of planetary combinations show a greater degree of cohesion than has been previously noted. We analyse the descriptions quantitatively to show that they are not merely miscellaneous assortments of associations, but exhibit a strong internal logic.Despite the divergent methods and aims on display on the textual surface of Ptolemy and Valens, Valens general understanding of the underlying structure of astrology may be closer to Ptolemy than usually assumed.2b08 1 Quantitative methods in the history of astrologyThe modern mathematical study of Greek astrology owes much to the twentieth century historian Otto Neugebauer, who trained as a mathematician.13 While Neugebauer acknowledged the value of astrology for social history2013its insight into 2018the daily life, religion and superstition... and cosmogonic ideas of the past (Neugebauer 1951)2013he emphasised that the primary justification for studying it was because of its value for the history of astronomy and the exact sciences. He argued that astrological texts offer a window onto the mathematical knowledge of their period 2018[t]he only hope of obtaining a few glimpses of the astronomical methods of the time of Hipparchus rests in the painstaking investigation of wretched writers like Vettius Valens (Neugebauer 1951).14 As late as 1942, Neugebauer could observe in passing that 2018one of the most important sources on Hellenistic-Oriental astronomy, Vettius Valens2026is practically unexamined, as far as information about exact astronomy is concerned. This problem very much deserves serious consideration (Neugebauer 1942, p. 239).2b08#p5Until the mid-twentieth century it was unknown whether the horoscopes in the Anthologies referred to real and contemporary planetary configurations.In a pioneering work, Neugebauer and Van Hoesen (1959) showed how to ascertain the exact date of even partial literary horoscopes.Their method was manual and required aligning the motions of planets on long sheets of graph paper.15 In most cases this permitted them to identify a precise date to an accuracy of around a day. Overall, this successfully led to the identification of dates for almost all horoscopes in the Anthologies, and put the empirical basis of Valens work beyond question.Although it would have been easy to invent horoscopes for pedagogical purposes, Valens did not do so.2b08#p6The modern availability of accurate ephemerides such as the Swiss Ephemeris (Koch and Treindl 2021) together with computational libraries for manipulating horoscopes means that reproducing Neugebauer and Van Hoesens work is relatively straightforward. However, our focus here is not the dating of individual horoscopes, but the use of quantitative techniques for aiding textual analysis.Lynn Thorndike applied a similar approach to Firmicus Maternus, manually counting occurrences of terms to introduce a 2018quantitative element 2018one naturally assumes that those matters to which Firmicus devotes most space and emphasis are the most prominent features of his age (Thorndike 1913, p. 417). We see this as a precursor to the analysis we present here.162b08#p7We are not suggesting that this quantitative analysis reveals details which cannot be discovered by other methods, nor that it is more sophisticated it is a blunter instrument than close reading.But quantitative textual analysis is a historical method well-suited to uncovering the broad features of a body of text, and the inter-relationships between its sections, which may not be apparent from a linear reading.17 This is particularly true for a writer like Valens it is difficult to know whether an unfocused style may be obscuring a greater underlying cohesion in content than is apparent. We would like to suggest that these methods have wider applicability to the investigation of astrological texts; however, as an initial case study we apply them narrowly to a situation where one would expect to uncover relationships Valens descriptions of the qualities of the planets and of their combinations.2b08 2 The planets and their qualitiesThe hierarchy of planets in astrology seems to have been established very early in its history and persisted2b08#p9Saturn, Jupiter, Mars, Venus, Mercury.2b08#p10This order is found across astrological texts from Babylon, Egypt and Greece18 and continued to be accepted.19 The reason for this consistency may have pragmatic origins it matches their distances from the Sun (in a heliocentric model), from furthest to nearest, and so corresponds to their speed of movement over the year through the zodiac.20 This order of the planets is largely consistent.212b08#p11In classical astrology, 2018planets also included the two luminaries, the Sun and Moon, making seven classical planets. The order including the luminaries is more variable.While Valens uses the standard ordering of the five non-luminary planets, he tends to place the luminaries at the start when describing a horoscope,22 proceeding through the planets in this order but mentioning other planets when they occupy the same sign of the zodiac.In this article, when discussing configurations of planets we use the more normal astrological ordering as accepted by Ptolemy232b08#p12Saturn, Jupiter, Mars, the Sun, Venus, Mercury, the Moon2b08#p13The order of the five non-luminary planets is consistent. But what of their qualities?Because of the continuous popularity of astrology from ancient times to our own, many of the characteristics of the planets in Greek astrology remain familiar to us.The idea of Mars as war-like, or Saturn as cold and elderly, were, in Greek thought, deeply mythically rooted.Indeed, Riley notes that similarities in the mythic characteristics ascribed to planets and signs in Valens are also accepted by Ptolemy, suggesting their ubiquity (Riley 1988, p. 68). Such widespread acceptance coupled with a modern familiarity has probably occluded further study of planetary characteristics.24 Yet it has been established that alongside the basic characterisations, Babylonian, Egyptian, and Greek sources give a varying series of associations and characteristics for the planets.Some of these are repeated and popular; some appear only rarely.Commenting on this tendency in the case of Saturn, Bouch00e9-Leclercq wrote that, from such a vast store of examples, 2018astrologers chose according to their liking how to compose the type of this powerful and dreaded star.252b08#p14Partly due to these sorts of mythic characterisations, the view of the qualitative aspects of astrology as whimsical or pedantic often still prevails. There has been little systematic effort to investigate the internal conceptual consistency of Greek astrological interpretation 2013 even of particular astrologers, with the exception of Ptolemy.Any focus on consistency in the scholarly literature is usually on the mathematical or theoretical aspects.This is not surprising, and is likely to be the result of two main trends.First, the interpretative claims of astrology still carry weight, and, whether implicitly or explicitly, most scholars seek to distance themselves from the central claim that the stars can cause or signify human events.26 Second, even with Greco-Roman divinatory methods that are more straightforwardly of the past, study of the precise claims of predictive methods is grounded by a scepticism which discourages taking particular interpretative claims too seriously 2013 if the claims are false, then why suppose that they must be conceptually cohesive? The Ptolemaic approach placing planets within the scheme of Aristotelian physics is the exception, because of the clear link to wider Greek science.To modern readers it often appears a refreshing contrast to arbitrary lists of associations due to its physical basis.2b08#p15However, this distinction must not be overstated.Overall, there is a complex relationship between the general mythic characteristics of the planets, more narrowly-defined astrological traditions about them, and the physical claims made by astrologers about the planets natures and characteristics.27 Riley recognises the first and third of these categories, noting that sometimes in Ptolemys Tetrabiblos there is a slightly uneasy relationship between the two, and maintaining that Ptolemy distinguished between them, even if not in the terminology of 2018mythical vs 2018physical (Riley 1988, p. 68). For Ptolemy, the physical characteristics of the planets fit into an Aristotelian system of balanced opposites characteristics included physical qualities like hot and cold, wet and dry, as well as biological characteristics like male and female, and temporal characteristics like diurnal and nocturnal.28 The physical characteristics of the planets have an effect on the Earth 2018Venus adds heat to the prevailing conditions, Saturn cold, Jupiter moisture, Mars dryness, Mercury motion and wind.292b08#p16Ptolemy also designates some secondary characteristics which are easy to categorise, including each planets status as broadly beneficent or maleficent. It is never explicitly stated whether this primarily means beneficent towards human beings; Ptolemy does seem to have in mind also the relationship of the planets to one another.In Ptolemys system the benefics are Jupiter, Venus, and the moon; the malefics are Saturn and Mars; the neutrals are the Sun and Mercury.While Ptolemy attributes these categorisations to 2018the ancients (03bf1f31 03c003b103bb03b103b903bf03af) he also gives an Aristotelian physical explanation those planets which have predominantly cold or dry natures are malefic.302b08#p17Ptolemys post hoc rationalisation of existing astrological lore shows that certain overarching conceptual associations for planets were so widely accepted as to be indisputable. These broad meanings of each planet were likely known even to non-astrologers in Valens time.31 Yet despite this they were of limited use for astrology, since in practice any horoscope contains a specific configuration of planets.Due to the length of the periods of planets, many configurations never occur in the lifetime of any given astrologer.Deciphering the configurations precise meaning is a complex art. This is part of the paradox of astrology whereas the meaning of each component part may be intuitive, and (assuming a horoscope can be accurately cast) the data all on display, the overall meaning can remain hopelessly obscure.Notably, while Ptolemy discusses the characteristics of the planets, he avoids any discussion of real horoscopes or even of planetary combinations.Indeed, he excuses himself from any responsibility to discuss planets in combination at all, writing that 2018[i]t is of course a hopeless and impossible task to mention the proper outcome of every combination.322b08#p18In contrast, Valens is far more concerned with the real situations an astrologer will encounter. As stated above, he provides real horoscopes throughout the Anthologies.And at the beginning of Book 1 he gives a list of the characteristics of each planet (1.1ff).After this, almost as a footnote, he explains that although there are 2018benefic and 2018malefic stars, their effects can be enhanced or mitigated depending on how they are disposed.Valens does not specify which are benefic and malefic, probably because he assumes these designations are known to his reader. He then proceeds, in contrast to Ptolemy, to enumerate the characteristics of combinations of two and three planets.It is worth considering the reason for this.Conceptually, it is common to separate the practice of astrology into the computing of horoscopes with astronomical methods and then their interpretation.33 But the interpretation of a new astrological chart is an integrated practice, drawing on a combination of knowledge of course the practical computation of horoscopes and calculation of angles between planetary positions, but also on established interpretations of commonly observed patterns. That is, the qualitative lore of astrology is not only conceptual but inherently practical.The raw materials of astrology are not only the computed positions of planets and their individual 2018meanings but also a knowledge of the effects of these planets in combination, as well as their shifting valency in specific zodiac signs or 2018places of the chart.However, the combinatorial possibilities are huge, making iterating them in a pre-computer age a hopeless task. So the novice astrologer cannot be instructed in the pre-defined meaning of every chart.Viewed this way, it is understandable that astrologers naturally built up methods for progressive 2018chunking of horoscopes into important and repeated features that themselves had a body of 2018pre-computed associations.Valens does not just aim to provide his readers with the foundational principles of astrology. By providing a compendium of the characteristics of combinations of two and three planets, he provides a practical basis for interpretation once any given horoscope is broken down into intermediate component parts.Modern computers make combinatorial problems tractable.As historians, we can therefore bring new techniques to bear on this combinatorial 2018data to better understand the logic and dynamics of astrological interpretation.2b08 Planetary CombinationThe seven planets and their 2018combinations (03c303c503b303ba03c103ac03c303b503c903bd) are among the first things discussed at length in Book 1 of the Anthologies.It seems reasonable to take them as of primary importance for Valens.In this section, we first consider the significance of this term, before conducting a practical calculation of the actual possible occurrences of combinations to ground the analysis that follows.2b08 1 The concept of synkrasisIt is important at this point to demarcate exactly what Valens means by synkrasis (03c303cd03b303ba03c103b103c303b903c2). Philological evidence shows that the term was used beyond astrology, with the LSJ giving 2018a mixing together, commixture, blending, tempering as the first sense (p.1666).The majority of uses of 03c303cd03b303ba03c103b103c303b903c2 are theological or ontological.34 Among astrological writers 03c303cd03b303ba03c103b103c303b903c2 -03b503c903c2 appears in Valens,35 Ptolemy,36 Hephaestio of Thebes,37 ps-Manetho,38 Paulus Alexandrinus,39 in a commentary by Olympiodorus on Paulus Alexandrinus,40 and occasionally in critiques of astrology, e.g. Origen of Alexandria.41 All of these uses refer to the mixing of the effects of planets, with some uses making more abstract reference to the planets in general (ps-Manetho, Hephaestio), and some uses referring more specifically to the mixing of particular planets. A typical use is Paulus of Alexandria referring specifically to the mixing of the effects of Mars and Mercury in the place of Good Fortune, i.e. the fifth house.422b08#p21Scholars have argued that the concept of synkrasis was an important one in astrology. For example, in his notes on the Corpus Hermeticum, Festugi00e8re notes that the astrological doctrine of synkrasis is well known (bien connue) and the term is used to designate both the combination of elements (or elementary qualities) in the body and the combination of influence of the stars.43 Ptolemy uses the word in both senses in the Tetrabiblos (the body 1.2.18 H11; the stars e.g. 2.9.18 H142) suggesting a strong analogy between his understanding of how planetary influences combine in an Aristotelian framework. Valens use of the word in the Anthologies applies only to planets.As we show below, quantitative analysis of the characteristics he assigns to planetary combinations suggests Valens is also using a (less explicit but nevertheless present) underlying conceptual framework.2b08#p22The use of synkrasis suggests that Valens is not talking specifically about conjunction (the occurrence of two or more planets in the same sign of the zodiac) but more generally about how the astrologer should take the influences of two or more planets into account together in a horoscope. These influences must be modulated by the particular aspect of the planets.How exactly the influences of planets combined was a practical question.In astrology, one of the most important possible combinations was conjunction the occurrence of two planets in the same sign of the zodiac.Planetary combinations were discussed using the term 2018aspect the geometrical relationship between the positions of planets in the zodiac which translated into a conceptual schema of combined influence. While conjunction was often thought of as its own category, it is sometimes counted alongside the other aspects too.44 Other important aspects include the benefic aspects of trine and sextile, and the malefic aspects of opposition and square.45 When Valens discusses synkrasis, we believe he has all of these aspects in mind, and is providing a framework for the astrologer to modulate the predicted outcomes appropriately according to whether the aspect in question is benefic or malefic and the relative strength of each planets influence.2b08 2 Practical limits on planetary combinationWhether or not astrology is viewed as a science, it rests upon a foundation of empirical data about the sky. It is therefore useful to consider the constraints on planetary combination that arise in real astrological data.First, the calculation of combinations of the seven planets and luminaries; in his work, Valens considers both combinations of two planets (2018doubles) and combinations of three planets (2018triples).The number of combinations of n non-repeated elements from seven elements is given by (2018seven choose n). There are thus =21 possible doubles and =35 possible triples.In the Anthologies, the descriptions of planetary synkrasis omits two doubles (Mars Sun; Mars Moon), and three triples (Saturn, Mercury, Sun; Saturn, Mercury, Moon; Saturn, Sun, Moon).Although omission in the original cannot be ruled out, it would be surprising for a handbook aiming to be a comprehensive and practical guide, and we therefore suggest it may have arisen from a simple transcription error.462b08#p24Importantly, not all combinations of planets are realised, particularly once one brings in the signs of the zodiac as well. A scheme outlined by Boxer (2020) can be used as a simplifying way to discuss the historical occurrences of conjunctions. In brief, the twelve signs of the zodiac can be represented in hexadecimal notation.47 The current zodiacal sign of each the seven planets (in the order Saturn, Jupiter, Mars, Sun, Venus, Mercury, Moon)48 can then be converted into a digit in hexadecimal notation, so a configuration of planets can be represented as a seven-digit code.We follow Boxer in referring to this as a Z-code (from 2018Zodiac-code).49 For example, the Z-code2b08#p25AA1A9A0means that Saturn is in Aquarius (A), Jupiter in Aquarius (A), Mars in Taurus (1), the Sun in Aquarius (A), Venus in Capricorn (9), Mercury in Aquarius (A), and the Moon in Aries (0). Z-codes offer a convenient way to simplify historical astronomical data to investigate the planetary combinations realised within the resulting horoscopes.50 This is appropriate for Valens, since he usually quotes only the zodiacal signs for each planet.512b08#p26We used Flatlib, a Python 3 library for traditional astrology52 in conjunction with the Swiss Ephemeris to calculate the Z-code for each day in Valens century and the century before, from 1st January 1 CE to 31st December 200 CE, taking midday on each day. We used the latitude and longitude of Alexandria 31.2200b0 N, 29 9600b0 53 One should expect slightly different results with this approach from what would have been calculated by contemporary astrologers such as Valens at the time due to a different frame of reference.54 From these Z-codes, we found the days which included conjunctions.As noted above, this approach treats all cases where planets share the same sign as conjunctions (see n. 50).2b08#p27One immediate observation is that planetary conjunctions are extremely common 97.5% of days in this period contain at least one conjunction.55 74.3% contain a double conjunction, 34.4% contain a triple conjunction, and 17.2% contain both a double and a triple conjunction (each in a different sign). Even quadruple conjunctions occur on 7.5% of days, although higher order conjunctions are much rarer (n=5, 0.85%; n=6, 0.07%; n=7, 0.0%).2b08#p28These results demonstrate that planetary conjunctions occur in the vast majority of possible horoscopes.Even if a concept of synkrasis was only important for conjunction, it would be invoked at least once in the interpretation of almost every horoscope.In fact, when other aspects are taken into account, any horoscope contains at least nine aspectual relationships between planets (see Appendix).56 Valens notions of planetary combination are therefore of immense value for understanding how practising astrologers conceptualised the combinatorial mainstays of horoscopic prediction.2b08 3 The length of Valens descriptionsThe length of the descriptions alone already gives some indication of Valens priorities (Figure 1). Notably, Mercury has the longest description of any planet; as the fastest-moving, it frequently interacts with other planets, so its modifying character is important for Valens.However, particular combinations involving Mercury are not particularly notable since they recur frequently; for example, the Sun and Mercury will be in conjunction in over 50% of horoscopes.While the cumulative number of words devoted to triples is the largest (planets 1,046; doubles 1,010; triples 2,145), Valens devotes more space on average to single planets than to combinations (mean number of words in descriptions planets 149; doubles 53; triples 67) However, some combinations have longer descriptions than some planets. For example, the triple 2018Saturn Mars Mercury has the longest description of any combination, consistent with its conceptual importance for Valens, the combination of two malefic planets with the modifier of Mercury requires a great deal of exposition.2b08#p30There is no overall relationship between the frequency of occurrence of a conjunction of planets with the length of the description of the corresponding combination (Figure 1). Although triple conjunctions occur less frequently than double conjunctions, Valens devotes more space on average to describing triple combinations.This may suggest that he attaches more importance to elucidating the characteristics of triples, which involve the mingling of three influences and so are correspondingly more complex combinations than doubles.2b08 Sentiment AnalysisAs noted above, the planets in Greek astrology had associated characteristics. Perhaps the most fundamental was their categorisation as benefic (positive) or malefic (negative).We decided to therefore attempt to quantify the descriptive terms used by Valens as positive, negative, or neutral, to provide a rough quantitative index as to the overall 2018sentiment of a particular planet or planetary combination.2b08#p32Sentiment analysis is a method for analysing snippets of text for positive or negative valences.57 Some types of sentiment analysis use natural language processing software, while others rely on manually-mined data. Some approaches use both, especially with complex texts such as literary works or historical sources.58 Here, we used a manual approach to break sentences within descriptions into lexical terms and assess their individual sentiments, and then compute mean overall sentiments for each description.2b08#p33First, we manually sorted Valens descriptions of the planets and the effects of their combinations from the following sections of the Anthologies2b08#p34Anthologies 1.1 - a list of the characteristics and effects of each planet.Anthologies 1.19 - a list of the effects of each double combination.Anthologies 1.20 - a list of the effects of each triple combination.3.1 Computing a sentiment indexSentences in Valens passages of planetary descriptions tend to appear in one of four different forms. The initial descriptions of each single planet appear primarily in the following form2b08#p35Planet X is A, B, C (where A, B, C) are adjectives).For the descriptions of the effects of planets, either singly or in combination, terms appear primarily in the three following forms2b08#p36X causes or signifies D (where D is an abstract noun e.g. 2018death or 2018illness).59or2b08#p37X causes or signifies [those linked to it to be] Es (where E is a nounthat encodes a practice or profession e.g. 2018murderers or 2018goldsmiths).or2b08#p38X causes or signifies Fs to be G (where F is a noun e.g. 2018men and G is an adjective e.g. 2018famous or 2018wealthy).We constructed a database of terms, including the original Greek and an English translation of all nouns and adjectives used in any of these formulations, and which planet or combination of planets they applied to. One of us (Hall) then assigned to each individual term (henceforth referred to as 2018lexical term) a rating of 2018positive, 2018neutral, or 2018negative.In many cases the assignations were very clear, due to the extremely frequent use of words with obvious sentiments like 2018injury or 2018happiness.In some cases, it was necessary to use cultural knowledge of Hellenistic and post-Hellenistic Greek attitudes to money, sex, certain professions, certain family arrangements and so on in order to reach a judgement on whether a term would be viewed as positive or negative.602b08#p39This manual approach has several limitations. First, it can be difficult to extract lexical terms from descriptions should 2018associated with fame and fortune be two lexical terms, or just one?Second, even classifying as positive, negative or neutral requires a subjective judgment.Third, these categories are crude and do not capture any nuance of interpretation.Fourth, we only used one assessment rather than multiple expert assessments.However, despite these limitations the resulting sentiment indices are useful for comparing descriptions and looking at relationships between them. We do not put too much weight in the significance and categorisation of individual lexical terms; classifying them in this way is a means to an end, to compute a single index for each description.2b08#p40An alternative approach would be to use automated sentiment analysis with an existing tool.We explored this approach and ran descriptions (in English) through an existing sentiment analysis tool in the Stanza Python 3 library.61 This tool is trained on modern English text sources and assigns a sentence as negative, neutral, or positive. We used the mean sentiment of the sentences in a description.We found an approximate correlation (Pearsons r00bf0.6) between our manual assessments and these automatically computed sentiments.On inspection, the automated sentiment analysis appeared inferior to our assessment.As an indicative example, take the following sentence2b08#p41Men also derive benefits from women, and coming into possession of estates and land, they become lords. (Saturn, Jupiter, the Moon)2b08#p42In the context of astrological prediction, this sentence is uncomplicatedly positive. We assessed it as having two positive lexical terms 2018derive benefits from women and 2018coming into possession of estates and land(, they become lords).However, this sentence is given a neutral overall sentiment by Stanzas classifier.62 Reliable assessments depend strongly on the cultural context, whether this is by training on a carefully selected training dataset or through expert knowledge.In the absence of an appropriate automated tool for Valens context, we therefore chose to use our manual assessment to compute overall sentiment of descriptions.632b08 2 Sentiment index resultsFor the single planets, the descriptive passages range in length from 99 to 256 words, with a median of 57 lexical terms in a description. Around half of terms in the descriptions were assigned as neutral (188400, 47%).There is a very slight excess of positive terms compared to negative terms (29% vs. 24%).The malefics (Saturn and Mars) both have strong negative overall sentiment according to this method.It is of interest that the extremity of sentiment (whether positive or negative) corresponds approximately to the ordering of the five non-luminary planets Saturn and Jupiter are equal and opposite, Mars and Venus are similarly comparable but with reduced magnitude, and Mercury has the smallest sentiment.642b08#p44From these assignations, we then computed an overall sentiment S for each of the descriptions from their component lexical terms as2b08#p45S = p 2212 n p + n + m (1)where p is the number of positive lexical terms, n the number of negative terms, and m the number of neutral terms. This sentiment S can range from -1 (all lexical terms are negative) to +1 (all lexical terms are positive).Table 1 gives these values for all single planets.2b08#p46For example, Saturn has 4 positive lexical terms, 21 neutral, and 50 negative.So we have2b08#p47S Sa = 4 - 50 4 + 2 1 + 5 0 = 2212 46 75 = 22120.61 (2)In the same way, we assigned lexical terms within the descriptions of double and triple combinations and then computed an overall sentiment for each description (see Supplementary Tables Table 2 for doubles and and Table 3 for triples). Interestingly, the number of neutral terms was much lower for double and triple combinations, with none in descriptions of doubles and only 29 of 635 terms for triples (< 5%).This suggests a different conceptual categorisation for the qualities of combinations of planets as opposed to the qualities of planets on their own.2b08#p48Planet No. of words (Greek) p m n Total terms Sentiment Saturn 182 4 21 50 75 -4675 (-0.61) Jupiter 91 24 16 0 40 2440 (0.60) Mars 154 8 25 39 72 -3172 (-0.43) Sun 83 18 12 0 30 1830 (0.60) Venus 181 27 30 0 57 2757 (0.47) Mercury 256 23 61 6 90 1790 (0.19) Moon 99 11 23 2 36 936 (0.25) Total 1,046 115 188 97 400 18400 (0.05)There is no relationship between the sentiment of combinations of planets and their frequency of occurrence in conjunction (Figure 2). Most conjunctions occur in at most 10% of horoscopes, with triple conjunctions obviously rarer than double conjunctions.The three most frequent double conjunctions are those involving the Sun, Venus, and Mercury, all of which are present in more than 20% of horoscopes.These doubles are all strongly positive in sentiment.This may suggest a certain degree of pragmatism for the working astrologer who would encounter these conjunctions in more than a fifth of their client-work. Other pragmatic considerations about the ways in which synkrasis would be encountered might also be relevant.For example, Mercury and the Sun cannot ever be in any other aspect other than conjunction.65 In a practical sense this might mean that the synkrasis of Mercury and the Sun does not have to be as polyvalent as for most other combinations of planets.The concept of frequency of encounter of an aspect is also worth considering. Although a planets speed is irrelevant to the number of horoscopes in which it is in aspect with another, it affects the diversity and duration of those aspects.For example, because Mercury moves quickly, in a time period of a year it will have been in every physically possible aspect with every other planet at some point during the year.In comparison, aspects between two slow-moving planets change less frequently but last for longer when they occur. So one might speculate that any given instance of synkrasis involving Mercury would be more likely to be 2018routine for an astrologer, resting on familiar knowledge, whereas a previously unencountered aspect of Saturn might prompt a consultation of existing lore to aid interpretation.2b08 3 Building combinatorial models to predict sentimentBy reducing the descriptions of the planets and combinations down to a dataset of sentiment indices, we can perform statistical analysis to predict the sentiment of a combination. There are several options for doing this.2b08#p50Independent bodies.In the first instance, we used a linear model to predict S with a dummy variable xi for the presence of each body i, which takes the value 1 when body i is present in a conjunction and is 0 otherwise.That is, 2b08#p51S = 2211 i 03b2 i x i (3)To take a specific example,.We set the intercept term to zero, allowing us to calculate an effect for each dummy variable. Intuitively, this is a model where each planet i contributes a consistent and fixed effect to all combinations it occurs in.The model allows for no interaction or modulation of this effect by the presence of other planets in the combination.We fitted a model of this type for the double sentiments and the triple sentiments separately, and also compared the effect for each planet to its individual sentiment (Figure 3).2b08#p52The results show a good concordancy between the double (red) and triple (black) models. The effect of Saturn and Mars in a combination is overall a negative one, whereas Jupiter is the most positive predictor in both models.There are some interesting discrepancies between the sentiment of the planets and their effects in the models.Venus has a positive sentiment (it is benefic) but in fact has no average effect in combinations.The Sun appears positive in doubles, but has no effect in triples.2b08#p53Mixing models. Rather than assuming that each planet has an overall independent effect when it is present in a combination and calculating this effect, we can work from its single sentiment.In this approach, we assume that the sentiment of a conjunction is related to the mean of the sentiments of its component parts.66 For a double, the only possible component parts are single planets.Thus, the predicted sentiment of planets p and q in combination is2b08#p54S ~ p q = 1 2 ( S p + S q ) (4)This predicted sentiment is strongly correlated with the actual sentiment (Figure 4), although there are some discrepancies. For example, the mean sentiment of Saturn and Mercury is negative, but in fact in combination they are broadly positive in effect together.Thus the relationship is not simply additive.2b08#p55For the case of triples, there are multiple possible component parts.At the base level, a triple is composed of three planets, so2b08#p56S ~ p q r = 1 3 ( S p + S q + S r ) (5)However, one can also consider a triple as a combination of three doubles. In this model, one has2b08#p57S ~ p q r = 1 3 ( S p q + S q r + S p r ) (6)A third possibility is in fact given by taking into account the three possible combinations of doubles and singlesFigure 5 compares these three possible models for predicting the sentiment of the triple combinations.Pearsons correlation coefficient, which measures the degree of linear correlation between the predicted and actual sentiment, shows that a model based on single planets only is the least accurate (Figure 5a). A model using the mean sentiment of the doubles (Figure 5b) is substantially better. Using the combination of doubles and singles produces a very similar result (Figure 5c).We can conclude from this that the sentiment of triples is best explained by a model based on their component doubles.68 The internal logic of planetary combination is not simply additive but is instead combinatorial.This may seem counterintuitive at first glance.If one was thinking of the conjunction of three planets, one might more readily imagine the combination of the three individual sets of characteristics rather than some combination of all three possible doubles. However, in other scenarios that involve the combination of three planets u2013 for example, scenarios in which different aspects are in play u2013 the combination of individual planets becomes much more difficult to intuit.Take for example, the following partial horoscope Mars in Cancer, Sun and Venus in Aries.69 In such an example, it is not clear how one would work in the relationships of conjunction (between Sun and Venus) and square (between Mars and Sun; between Mars and Venus) into a single calculation which combines the three individual planets. Instead, one might take either of the following routesto consider Sun and Venus as a double; to then consider Mars as an individual in square to the double Sun-Venus.to consider Sun and Venus as a conjunction-double; to consider Mars and Sun as a square-double; to consider Mars and Venus as a square-double.Then to combine the constituent doubles into a triple.Figure 6 An example horoscope with Z-code A6300B5. The outer ring shows the zodiacal signs; the inner ring shows the positions of the planets.Aspectual relationships are shown by coloured lines opposition (red), square (orange), trine (blue), sextile (green).While the first of these may seem more straightforward, the evidence from our analysis of Valens descriptions of the combinations points more strongly towards the second.Again, the reasons for this are much clearer when considering the broader horoscopic context such a partial horoscope would never crop up in practice since there would always be other additional planetary relationships to take into account. A typical horoscope might include aspectual combinations of four, five, or even six or seven planets; even if there appear to be some different u2018nodes in the aspect network, it is extremely common for all of the planets to fit into a single linked network through a set of aspectual relationships. In the case of our example horoscope, the rest is as follows A6300B5, i.e.Saturn in Aquarius, Jupiter in Libra, Mars in Cancer, Sun in Aries, Venus in Aries, Mercury in Pisces, Moon in Virgo.There are twelve aspects in totalSaturn in trine with Jupiter; Saturn in sextile with Sun; Saturn in sextile with Venus; Jupiter square to Mars; Jupiter in opposition to Sun; Jupiter in opposition to Venus; Mars square to Venus; Mars square to Sun; Mars trine to Mercury; Mars in sextile with Moon; Sun in conjunction with Venus; Mercury in opposition to Moon.These double relationships give various options for triple combinations of influence for planets linked by aspectual relationships one might like to think of Sun-Venus-Mars as a triple, or one might also consider Saturn-Sun-Venus or Jupiter-Sun-Venus. Quadruples made up either of doubles or triples are clearly also possible, and so on up to a septuple made up of a combination of smaller units.It is rare for astrologers to couch their predictions in the language of septuples, and one can see why it is not a natural or helpful unit to work with.This example serves to clarify two points.First, the combinatorial possibilities of horoscopy give the astrologer a great deal of interpretative scope although the positions and the aspects of the stars are fixed by the input data, astrologers can choose the levels and the grouping with which to carry out analysis. Second, doubles are the natural building block in this sort of qualitative calculation based on aspects.This example helps to explain why the sentiment of Valens triples are predicated on their constituent doubles.It also suggests a possible reason why Valens discussions of triples take up more space than his discussions of the singles or doublesu2014they may act as an exercise in showcasing the richness of this combinatorial method.4. ConclusionThere is an irony in using quantitative methods in the conceptual history of astrology the datasets are small, one is primed to look for patterns, and almost any evidence can be fitted into an existing interpretative framework.Within these constraints, we have attempted to present the evidence as we found it.Our central conclusion from investigating Valens descriptions of synkrasis in detail is that this planetary combination has a largely consistent internal logic, even if this is not articulated in the Anthologies.We started with a discussion of the contrast between Ptolemy and Valens. Ptolemys astrology has an underlying and well-understood logic of Aristotelian qualities and the balancing of opposites.In comparison, it is notable that Valens does not specify which planets are benefic or malefic.Yet there is clearly some variety of conceptual co-mingling in his combinations.One never encounters a planets pure influence alone in a horoscope; this influence is always modulated by the presence of other planets. So while elucidating the effects of the planets themselves is important, it is of little practical use.Indeed, this fits the observation that the double combinations receive shorter descriptions compared to the triples.For a practical astrologer, the richness of interpretation grows with the number of planets in combination.There is no definitive answer to what the combination of three planets represents, but a list of associations can provide an overall implicit sense. We have attempted to quantify that sense here by classifying terms in descriptions as positive or negative, and using these to compute the overall u2018sentiment of a description.However, by providing lists of combinations in the Anthologies Valens is implicitly accepting that the astrologer need not start from first principles every time they interpret a horoscope.Instead, they can start by noting the key combinations of influences, u2018chunking the horoscope into its salient features. The third sense (c.II) of synkrasis noted by the LSJ is a u2018mixture, compound...but compounded so to say of both.We have found that the combinations of three planets are better explained by averaging over their component pairs, than by averaging over the individual planets involved.This observation suggests that Valens does not think of these thrice-wise combinations of influence merely as combinations of the fundamental planets, but as combinations of combinations. This is an iterative process that one could speculatively extend for combinations of four planets, one does not have to turn back to the descriptions of the individual planets characteristics.Instead, one can look at the combinations of three planets it contains, then construct a new compound of influences from these descriptions.We believe our analysis reveals a conceptual and systematic subtlety not previously recognised in Valens work. We suspect it may be a fruitful avenue along which to investigate texts from other astrological writers who are also considered to be unsystematic or miscellaneous, including Hephaestio of Thebes, Dorotheus of Sidon, and Firmicus Maternus.The main challenge we see is the time and expertise needed to manually assess the texts to enable a similar quantification.While automated analysis could circumvent this problem, this would probably require the training of specific models for this astrological context.There is a great deal more to Hellenistic astrology than simply calculating the combination of planetsu2014for example, the complexities of the house system play an important role in Valens work and we have hardly mentioned them here. We nevertheless suggest that this case study shows it is possible, through using statistical methods, to adumbrate conceptual systems at play in the practice of Hellenistic astrology.These conceptual systems fall neither into the modern classifications of history of astronomy (examining how ancient people calculated the positions and relations of stars and planets) nor history of philosophy (examining ancient physical theories about the stars or theories of astral causation). Instead, our method aims to capture something important yet elusive a glimpse of the general understanding that Hellenistic astrological practitioners had of the structural coherence of their craft."
}