{
  "articleId": "isaw_paper18_6",
  "text": "ARTICLE_ID: isaw_paper18_6\nISAW Papers 18.6 (2020) In a supposedly first-century letter, the Greek doctor Thessalos of Tralles writes about his quest for a “direct divination,” a “one-on-one” oracle with Asclepius, the god of healing, to learn about the medical uses of plants: Arriving, then, in Diospolis (Thebes) – I mean the most ancient city of Egypt which also has many temples – I was residing there, for there were scholarly high-priests (ἀρχιιερεῖς) and elders ascribing to various teachings there. Now as time advanced and my friendship with them increased, I was inquiring whether any magical operation (μαγικῆς ἐνεργείας) was preserved. I observed the majority protesting strongly against my rashness concerning such an expectation. Nonetheless, one man, who could be trusted because of his patient manner and the measure of his age, did not throw away the friendship. This man professed to have the ability to perform direct divination by means of a bowl (Thessalos 1.12–15).2 Our interest here is not in Thessalos as a doctor or a Greek but rather in the performance of ritual divination and its reception by individuals.3 Whether performed publicly as a part of state cult or privately for elite clients like Thessalos, divination often suggested divinization – the possibility of personal divinity – for those involved. To bring this possibility of personal divinity as understood by the Egyptians into greater relief, this paper will interpret two divination practices – the New Kingdom Egyptian pḥ-nṯr oracle in its public and private guises4 and the late antique Graeco-Egyptian “Mithras Liturgy.” With general readers in mind, I will attend to the Egyptian concept of ḥk3 and those who deployed it in the context of Greek and Egyptian cultural interactions. I will make the case that personal divinity as expressed in late antique Graeco-Egyptian oracular literature – even when written in Greek – was not an interpretatio graeca or “Hellenization” but rather part of a more general cultural milieu of traditional Egyptian temple thought and cult practice. More central to the argument, I will suggest that divination is a form of self-divinization, i.e., that divination bestows a “sacred status” upon the petitioner, giving him or her access to powers and states of being normally attributed to the Egyptian gods – in both explicit and implicit ways. Divination rituals and oracles function as transformative “texts” for the querent that suggest the attainment of personal divinity explicitly, through ritual “self-identification with the god,” and implicitly, through the intimacy of personal piety. While “democratization” of personal divinity occurred liturgically and through the privatization of oracles over time, the inner dynamics of personal piety for individuals suggest a more radical “democratization,” which is the concern of this paper and the perspective I wish to insert into our conversation: reading, hearing, viewing, or performing divination always implied divinization for the pious as an individual, internalized, cognitive experience. When it comes to divination in Graeco-Roman Egypt, it is difficult to separate the priest from the magician, religion from magic, or philosophy from all of the above. The ritual expert in Egypt was priest, magician, and philosopher like the “elders” encountered by Thessalos.5 To understand this figure we need to discard the binary “religion vs. magic.” And, except from the point of view of Roman legislation in Egypt that condemned magia, “magician” or “magic” may not be the most helpful terms to use in our discussion. Beginning in the reign of Diocletian (c. 244–311), divination and other related practices were reclassified as illicit magia.6 By 359, an Egyptian oracle prompted the emperor Constantius II (317–361) to abolish oracles throughout the empire.7 Egyptian cult practices were negatively recast in the Roman Christian mind.8 The lines between categories like “religion,” “philosophy,” “theurgy,” and “magic,” blur and change over time – especially so in the great confluence of cultural identities that was late antique Egypt. Indeed, “magician” and “magic” carry a long history of polemical baggage, often being used by historical agents and scholars alike to sanction certain practices while condemning others, and then with reference to that equally slippery term, “religion,” a category that the Egyptians really did not have either, at least in the way moderns have tended to apply it to them – etically.9 Neither category – “magic” or “religion” – was indigenous to Egyptian culture. To understand divination and its resultant divinization from the Egyptian point of view, let us perhaps use the Egyptian term normally translated into “magic,” ḥeka, instead. Unlike magia, ḥeka had no unorthodox, illegal, or deviant connotations. Rather, as both a cosmic force and a deity of that force, ḥeka was “a primary and necessary element of creation, used naturally by the gods, and granted as a … benefit to [hu]mankind.”10 The hieroglyph means “power.” As a god, Ḥeka had official cult status in the temple at Esna in Upper Egypt even in Roman times and was invoked equally as a “destructive force of compulsion … [a] generative harvest deity, and [a] patron of oracles.”11 Robert Ritner comments: “Serving both generative and destructive ends, Ḥeka/ḥeka represents an amoral force inherent in the created order, a power which could be tapped by appropriate words and gestures. There is no ‘black’ vs. ‘white’ magic; both gods and demons may use its force.”12 On the identity of the practitioner of ḥeka, Ritner rightly argues against the hotly debated image of the “itinerant” or “freelance” magician in Egypt. He writes: Preconceived notions of the magician … on the outskirts of tradition are totally inappropriate for Egypt where the magician was invariably a literate priest, the very source of tradition. The common Egyptian term for magician signified “lector priest,” the ritualist who recited the written spells. Such spells were temple property, composed, edited, and stored in the temple scriptorium.13 So, we might also use ḥry-tp, the native term for this “lector priest” – who was ritual expert and practitioner of ḥeka like the one who guided Thessalos – as an alternative to the awkward hybrid, “priest-magician-philosopher.” Using such native terms as ḥeka and ḥry-tp avoids many misunderstandings of Egyptian thought and practice that stem from Greek and Roman – as well as modern scholarly – biases. In order to appreciate the role Egyptian thought played in the self-divinizing feature of divinization, we also need to address the problem of accessing Egypt through Greek (linguistic) hands. Recently scholars have begun to consider a more nuanced encounter between Greeks and Egyptians than simple “Hellenization.” The term “Hellenization” carries with it two assumptions: 1) Greek culture is superior to Egyptian culture; 2) Egyptians assimilated to Greek culture, rather than appropriated it. Instead, native Egyptian constituencies appropriated elements of hellenic culture to form a “subtle interpenetration,” in order to maintain a cultural identity distinct from Hellenism.14 Ian Moyer suggests we can find “[t]races of the Egyptian voices in the long history of dialogue between Greece and Egypt [that] are there to be found even in texts designed to erase or supplant them ….”15 A close reading of the pḥ-nṯr oracle and the “Mithras Liturgy” confirms this. The pḥ-nṯr Oracle An Egyptian oracle or divination ritual was an opportunity to ask questions of the gods – called nṯr.w by the Egyptians and conceived of as active powers or energies in nature and social life. By means of an oracle, statues embodying the powers of the nṯr.w could be approached by common people to answer important questions on matters of health, marriage, and work and to make judgments in legal matters.16 In the New Kingdom period onward (roughly 1550–1070 bce), “the primary way to consult the gods was to appeal to them during their public appearances outside the temple, either personally or through the mediation of a priest.”17 These public oracles were known as pḥ-nṯr, “the standard expression for an oracular consultation of a divine statue”18 – meaning “god’s arrival” or “reaching god.”19 Gaëlle Tallet describes the pḥ-nṯr: The procession of divine statues gave inquirers the opportunity to seek an oracle, and once the god had “approved” the request, the procession stopped and the consultation could start. This kind of consultation could work through spoken address or through the medium of writing, whereby written questions and names were placed before the god …. In oracles, the god is often said to nod his head … some movement on the part of the priests carrying the shrine would have been required to … indicate yes or no by moving forwards or backwards.20 However, the pḥ-nṯr was not restricted to public processions. The story of Thessalos’s consultation with an Egyptian ḥry-tp is an example of such a private pḥ-nṯr. Ritner relates: [T]he most common goal of the procedures … was the direct petition of a god for revelation, using lamps, bowls, mediums, or dreams. ‘Bowl [ḥeka]’ is attested in Egypt from the New Kingdom onward, specifically in spells for beholding the solar bark and the gods of the underworld. The bottoms of shallow bowls are painted with scenes of the sun god or other deities whom the ritualist intends to visualize.”21 Whether the oracle was public or private, the Egyptian petitioner likely experienced the ritual in the context of a well-established vocabulary of personal piety that demonstrates how certain oracular practices implied personal divinity. Personal Piety Since the New Kingdom, oracles had been connected with personal piety because they were a “privileged mode of direct contact with gods.”22 Public temple festivals “permitted individuals to enter into direct personal relations with [the] god ….”23 Festivals “offered a key opportunity for worshippers to take part in the ritual system.”24 Votive offerings were “placed in the path of the god as he set out on his procession; thus, individuals could address the god ‘in person’ … without the mediation of cult and state.”25 Personal piety entailed “giving god into one’s heart” as in a prayer ostracon from Amenhotep II: “I have given you into my heart because you are strong, … [you] protector, behold: I no longer know fear.”26 Such ritual expressions of intimacy, in Garth Fowden’s words, “shad[ed] into ‘self-identification’ with the god.”27 Once divination was prohibited at the end of the second century,28 pḥ-nṯr practices were “driven underground, becoming instead a private practice.”29 Like the public oracle, private oracles too expressed personal piety. While “[i]ntrinsically ‘private’ – eliciting answers, revelations, and aid for purely personal concerns – the [private] oracular procedure was no less sacerdotal …”; nor were they less an expression of personal piety and intimacy with the gods.30 Let us now shift our attention to the later Roman period descendent of the pḥ-nṯr oracle. The “Mithras Liturgy” The so-called “Mithras Liturgy” (PGM IV.475–820) is both oracle and ritual of immortalization (ἀπαθανατισμός), part of the “Theban cache” known by scholars since Karl Preisendanz in the early 20th century as the Magical Greek Papyri (or PGM). As a “direct divination,” it is a descendent of the New Kingdom pḥ-nṯr at home with other Theban cache divination rituals in the PGM. The name “Mithras Liturgy,” so-called, derives from Albrecht Dietrich, who believed that the text was used in the ancient cult of Mithras, a thesis now generally dismissed. The more recent translation by Hans Dieter Betz (2003) suggests substantial Greek Middle Stoic influence, in contrast with Garth Fowden and Robert Ritner, who have amply identified its Egyptian underpinnings.31 Addressed to a “daughter,” a female ritual expert whose appearance has been given surprisingly little attention by scholars, the ritual structure of the “Mithras Liturgy” consists of a complex series of “ascension” visualizations taking the operator from the elemental world to become a “rising star” (ML l.574), passing through the gate of the sun disk (ML l.576) into the realm of various gods, including seven snake-headed maidens (tychai, ML ll. 663–673) and seven bull-headed youths (or “pole lords,” ML II. 674–693) – all stellar figures related to Egyptian cosmology – to consult the god Helios-Mithras.32 Importantly, the vision of the sun disk here is not unlike private pḥ-nṯr bowl oracles that utilized painted scenes of the solar Re on the bottom of bowls to aid visualization. The “visualizations” were multi-sensory. The supplicant was exhorted to see (ὄψῃ, “you will see,” passim) various images and to feel sensations such as the quaking of thunder (“you will hear thundering and shaking in the surrounding realm … you will experience yourself being shaken,” ML l. 622–623).33 In addition to visualization, ritual techniques of the “Mithras Liturgy” included performative utterances (“I am going to envision with immortal eyes,” ML l. 516);34 ritual gestures (“at once put your right finger on your mouth,” ML l. 557);35 words and names of power (the often untranslatable voces magicae, passim); and breathing (“Draw in breath from the rays three times, drawing in as much as you can,” ML l. 538).36 Performative utterances included identification with the source of creation (“Origin of my origin … first beginning of my beginning …,” ML ll. 488–489),37 identification with the five elements, and, importantly, identification as a god (“I am PHEROURA MIOURI,” ML l.724).38 Identification with the God Through a series of visualizations, ritual actions, and performative utterances – notably, an explicit statement of self-identification with a god as seen above – the practitioner of ḥeka identified himself as divine and therefore assumed the ability to understand the privileged knowledge about to be received: “[T]o obtain an oracle directly from the god … can only be done if the human mind is raised to the level of the divine.”39 This was achieved through self-identification with the oracle’s nṯr.w. Such self-identification with the god can be seen across Egyptian ritual texts from all periods.40 It is “an authentically Egyptian trait.”41 Ritner explains: “Identification of ritualist … and deity is fundamental to all Egyptian spells. The pattern is continued without break in the [PGM], where the expression ‘I am (NN)’ is still usually written in Egyptian as ANOK.”42 Following this self-divinization, the divination proper begins – but, becoming god-like was a condition for receiving knowledge of the oracle. “Democratizing” Divinity A trend towards “democratizing divinity”43 can be seen in ancient Egypt’s long history, especially so in the adaptation in Roman times of the public state cult festival oracle to private pḥ-nṯr oracles like the “Mithras liturgy.” Progressively, “mysteries associated with divine kingship became available to deceased mortals as royal esoteric texts and myths were incorporated in the mortuary literature of commoners” as noted by Edward Wente.44 In the Middle Kingdom, this trend continued through the Book of the Dead with “spells designed to transform an individual into a divine entity and those containing statements baldly identifying the speaker with a high deity such as Re or Atum.”45 In the New Kingdom, priests had access to the Book of Amduat that “included references to its efficaciousness on earth for the living person who [knew] its contents, and it is stated that such an individ ual is the likeness of [a] god.”46 An early Ptolemaic demotic narrative, the First Setna Novel, describes the prince Setna in search of the “Book of Thoth” that bestowed godlike powers upon the owner.47 The themes of self-transcendence, divine visions, and even union with the divine that appear in early royal liturgy became the concerns of non-elite populations even before the Ptolemaic period. Especially in the changing ideological climate of the second and third centuries of Roman rule, “the intimate contact with the [the gods] that could be attained by members of a cultural elite … was not going to be confined to the tiny minority that had the necessary wealth and education to qualify for membership.”48 Indeed, the prospect of personal divinity was built in to Egyptian anthropology described by Dominic Montserrat: Humans were perceived as composites of physical and nonphysical aspects or modes of existence. The most important of these were the physical body and the heart and the incorporeal entities called the ka and ba …. The ba, originally the manifestation of an entity’s distinctive powers, came to signify the capacity of the deceased to move freely between the earthly realm and that of the gods ….49 Implicit Personal Divinity This self-identification is explicit in the “Mithras Liturgy” and throughout other PGM oracle rituals. The intimacy of the personal relationship that “shades into self-identification”50 through word, visualization, or offering – whereby the deity is understood to reside “within the heart” as in the Amenhotep II ostracon above51 – is a participation, a form of sharing the powers of the deity by internalizing those powers. While the self-identification with the god in the “Mithras Liturgy” is explicit, self-identification with the nṯr.w in the earlier public festival pḥ-nṯr oracles is implicit, by virtue of the nature of personal piety. The power of what appears to be passive visualization should not be underestimated. Even watching the god arrive, one – in an implied sense – became the god because humans internalize what they perceive.52 Public ritual had a personal, inner aspect. Performing divinity in oracles, publically or privately, was always “democratized” or accessible to the people who participated in the ritual and, therefore, internalized it. Reading, reciting, hearing, or performing “personal divinity” was always a kind of implicit “spiritual exercise” or, following Patricia Cox Miller, a “mental theater”53 that impacted the participant constituting what I refer to in other works as an “imaginative technology of self-transformation.”54 Conclusion Let us return to Thessalos, our Greek doctor who sought Egyptian wisdom. He won his direct divination with Asclepius, but he does not tell us exactly how the direct divination was performed, except that he was “led through the god’s secret names” – presumably a series of voces magicae (Thessalos l. 23).55 But we might know a little more. After the main part of the “Mithras Liturgy” oracle ends, optional variations on the rite are provided that involve additional participants: “[I]f you wish to show [another], after you judge whether his worth as a man is secure, handling the occasion as though in the immortalization ritual you yourself were being judged in his place, recite for him the first prayer, of which the beginning is ‘First origin of my origin’ … [a]nd say the successive things … over his head, in a soft voice, so that he many not hear …” (ML ll. 739–747).56 It is quite likely that Thessalos’s Egyptian ḥry-tp took this option – being uncomfortable with the alien Thessalos’s bold wish for a direct divination – instead himself performing the prerequisite self-divinization – using a rite similar to the “Mithras Liturgy” on behalf of his client. But, Thessalos seems to have secured a bit of divinity for himself as well by imagining and internalizing the oracle in process. Left alone in the room, the god Asclepius says to him: “Oh blessed Thessalos, attaining honor in the presence of the god. As time passes, when your successes become known, men will worship you as a god.”57⬈"
}