{
  "articleId": "isaw_paper7_0",
  "text": "ARTICLE_ID: isaw_paper7_0\nAbstract: Reports on current work relevant to the role of Linked Open Data (LOD) in the study of the ancient world. As a term, LOD encompasses approaches to the publication of digital resources that emphasize stability, relatively fine-grained access to intellectual content via public URIs, and re-usability as defined both by publication of machine reabable data and by publication under licenses that permit further copying of available materials. This collection presents a series of reports from participants in 2012 and 2013 sessions of the NEH-funded Linked Ancient World Data Institute. The contributors come from a wide range of academic disciplines and professional backgrounds. The projects they represent reflect this range and also illustrate many stages of the process of moving from concept to implementation, with a focus on results achieved by the mid 2013 to early 2014 timeframe. Subjects: Humanities--Study and teaching.1. Prologue and Introduction (Thomas Elliott, Sebastian Heath and John Muccigrosso) 2. Linked Open Bibliographies in Ancient Studies (Phoebe Acheson) 3. Linked Data in the Perseus Digital Library (Bridget Almas, Alison Babeu, Anna Krohn) 4. Herculaneum Graffiti Project (Rebecca Benefiel and Sara Sprenkle) 5. The Homer Multitext and RDF-Based Integration (Christopher Blackwell and D. Neel Smith) 6. Moving the Ancient World Online Forward (Thomas Elliott and Charles Jones) 7. Linked Open Data and the Ur of the Chaldees Project (William B. Hafford) 8. ISAW Papers: Towards a Journal as Linked Open Data (Sebastian Heath) 9. Beyond Maps as Images at the Ancient World Mapping Center (Ryan Horne) 10. Open Context and Linked Data (Eric Kansa) 11. Geolat: Geography for Latin Literature (Maurizio Lana) 12. The Europeana Network of Ancient Greek and Latin Epigraphy (EAGLE) (Pietro Maria Liuzzo) 13. Bryn Mawr Classical Review (Camilla MacKay)14. Byzantine Cappadocia: Small Data and the Dissertation (A. L. McMichael) 15. Coinage and Numismatic Methods. A Case Study of Linking a Discipline (Andrew Meadows and Ethan Gruber) 16. Exploring an Opportunity to Link the Dead in Ancient Rome (Katy Meyers) 17. RAM 3D Web Portal (William Murray)18. Assessing the Suitability of Existing OWL Ontologies for the Representation of Narrative Structures in Sumerian Literature (Terhi Nurmikko-Fuller) 19. Berkeley Prosopography Services (Laurie Pearce and Patrick Schmitz) 20. Linking Portable Antiquities to a wider web (Daniel Pett) 21. Pompeii Bibliography and Mapping Resource (Eric Poehler) 22. It’s about time: Historical Periodization and Linked Ancient World Data (Adam Rabinowitz) 23. Publishing Archaeological Linked Open Data: From Steampunk to Sustainability (Andrew Reinhard) 24. Mining Citations, Linking Texts (Matteo Romanello) 25. Linked Data and Ancient Wisdom (Charlotte Roueché, Keith Lawrence, and K. Faith Lawrence) 26. Linked Open Data for the Uninitiated (Rebecca Seifreid) 27. Pelagios (Rainer Simon, Elton Barker, Pau de Soto, and Leif Isaksen) 28. Linked data and the future of cuneiform research at the British Museum (Jon Taylor) 29. Integrating Historical-Geographic Web-Resources (Tsoni Tsonev) 30. Moving from Cross-Collection Integration to Explorations of Linked Data Practices in the Library of Antiquity at the Royal Museums of Art and History, Brussels (Ellen Van Keer)"
}