{
  "articleId": "isaw_paper25",
  "text": "ARTICLE_ID: isaw_paper25\nHistorical astronomical dating suffers from two basic uncertainties the inaccurately known rotation of the earth, and the unreliability of ancient records.2b08#p1The inaccurately known rotation of the earth is expressed by the poorly known difference 0394T = ET 2013 UT between the uniform Ephemeris Time (ET) underlying the astronomical calculations and the somewhat irregular Universal Time (UT) based on the rotation of the earth that regulates the time of day. Because of tidal friction the rotation of the earth slows down, therefore 0394T increases quadratically with time, but it is subject to substantial random fluctuations.Extrapolation of 0394T to 2000 BC is affected by a standard error of about 60 minutes, conservatively estimated on the basis of a Brownian motion model with infinite relaxation time, see Huber (2006 298). A more optimistic experimentally indistinguishable autoregressive model with 500 years relaxation time reduces the estimated standard error to 23 minutes. As a default 0394T I am taking a simple formula proposed by Morrison and Stephenson (1982) 0394T = c t2 seconds, with c = 32.5 and t measured in centuries since 1800 AD, and am using a value of 201226.00 cy20122 for the lunar orbital tidal acceleration.Deviations from the default 0394T shall be denoted by d0394T.Near 700 BC the default agrees with the best estimate of 0394T within less than 2 minutes, see Huber and De Meis (2004 26).2b08#p2In Mesopotamia, systematic astronomical observations apparently started in the 8th century BC. From before that time we have (i) scattered observations of lunar eclipses and of the planet Venus, both preserved in the protases of celestial omens, (ii) a few literary records of solar eclipses, and (iii) contemporary records of month-lengths.The chronological value of such data has been doubted, but never convincingly refuted.2b08#p3The lunar eclipse omen texts have been published by Rochberg-Halton (1988). Most of them appear to be schematic, not referring to identifiable events, and therefore useless for chronological purposes.On the other hand the omens of EAE Tablets 20 and 21 are so detailed and unsystematic that they appear to contain records of actual lunar eclipse observations preceding a change of reign in specified dynasties.2b08#p4The present paper first summarizes relevant results from earlier papers and then adds a new study on the dependence of the recorded month-lengths on the clock-time correction. These lunar calculations were done with an improved version of a program based on Chapront-Touz00e9 and Chapront (1991).The results of that study crucially enforce the trust we can place on such month-length data.They produce not only a precise Amar-Sin date (Year 1 = 2094 BC) but also a value of 0394T which is accurate within a few minutes.2b08 Lunar eclipse omens and the Dynasty of Akkad.Typical omen protases contain information about the month, the watch of the night and a crude entrance angle (north, east or south) of a lunar eclipse. On average, about four eclipses per century will match this information.2b08#p6Thus, a single lunar eclipse omen is of little use for dating purposes.However, if multiple omens relate to transitions in a given dynasty with known lengths of reign, the number of good match-ups of omens with calculated eclipses is much reduced.This applies in particular to the Dynasty of Akkad.In the search described in Huber (19992000) I searched in a wide chronological range (namely assuming that Sargons reign began between 22122400 and 20121950), and a wide 0394T range (namely assuming an uncertainty of 00b10.4 watches of the night, that is about 00b11.6 hours). It turned out that for two particular chronologies, with Sargon year 1 = 22122380 or 22122326, not only most transitions of reign were preceded by large lunar eclipses, but most of those eclipses were also matched by appropriate omens, see Huber (19992000 66-67).2b08#p7The difference of 54 years between the two chronologies is a well-known eclipse period.Later, it turned out that only the higher chronology is compatible with the solar eclipse from the time of Sargon, see Huber (2012 726) and below. The listing given in Table 1 corresponds to that chronology.2b08#p8Here I am following the traditional assumption that Sargons reign lasted 56 years and Naramsins 37 years.Recently, on the basis of a newer king list (USKL) different reign lengths of 40 and 56 years, respectively, have been favored, see in particular Steinkeller (2003) and Sallaberger and Schrakamp (2015 108, 136).The length of Sargons reign is irrelevant for my purposes, but for Naramsin I retained the 37 years of Jacobsens list (1939) against the 56 years preferred by Sallaberger and Schrakamp, because the protasis of omen 20-I corresponds to two almost identical eclipses spaced 37 years. As illustrated in Table 1, this eclipse pair then is able to ominously presage the deaths of the two consecutive kings Mani0161tusu and Naramsin.2b08#p9The best match obtained by Huber (19992000) and (2012) for omens pertaining to the Dynasty of Akkad is listed in Table 1.2b08#p10Kings of Akkad Length of reign First year of reign Eclipse preceding the accession Omen in EAE Sargon 56 22122380 Rimu0161 9 22122324 Mani0161tusu 15 22122315 Naramsin 37 22122300 22122301MAR09 22122301SEP02 20-I 21-VI 0160arkali0161arri 25 22122263 22122264MAR19 20-I Igigi, Nanum, Imi, Elulu 3 22122238 22122239NOV04 21-VI? Dudu 21 22122235 22122236MAR10 22122236SEP02 20-I 21-VI 0160u-DURUL 15 22122214 22122214JAN07 18-XI?End of dynasty 22122199 22122200MAR31 21-IOutside support for this chronology is found in the Tell Leilan excavations.There, the post-Akkadian level IIc (i.e. post- 0160arkali0161arri) is 14C dated to the second half of the 23rd century, namely with 95% probability to 2252-2202 BC (Weiss et al. 2012 175).2b08#p11After seeing an early draft of Huber (2012) the late John Britton had wondered whether it would be possible to estimate 0394T from the lunar eclipse omens. Indeed, for the chronology shown in Table 1, if we accept the timings of the two omens EAE 20-I and 21-VI at face value, they yield tight bounds for 0394T 20139 < d0394T < 31 minutes, see Huber (2012 721). (In view of the crudeness of ancient eclipse timings these bounds admittedly may be overly optimistic.)2b08 The solar eclipse of Sargon.A beautiful description of a total solar eclipse is contained in the Legends of the Kings of Akkade, see Westenholz (1997). It is discussed in Huber (2012 723-725).Among the two best matches the eclipse of 20122352JUN14 supports the chronology of Table 1.It implies a d0394T range of 201320 < d0394T < 7 minutes, overlapping with the range just determined from lunar eclipse omens.The other well-matching eclipse (20122285APR25) would fit inside the range of the lower lunar chronology (Sargon reigning 22122326 to 22122271). I reject it, since it requires a high d0394T > 80, while for d0394T > 54 none of the three instances of EAE 20-I sets eclipsed, as required by that omen.2b08 Lunar eclipse omens for the kings of Uruk and Ur.Four or five lunar eclipse omens apparently refer to this period.Accepting them at face value, I matched them in Huber (19992000) as follows with transitions of reign.2b08#p14Kings of Uruk and Ur Length of reign First year of reign Eclipse preceding the accession Omen in EAE Utu1e2begal (king of Uruk) Ur-Namma (governor of Ur) 10 22122159 22122159JUL24 21-IV Ur-Namma (king of Ur) 8 22122149 22122149JUL04 22122149JAN08 20-IV 21-VIII? 0160ulgi 48 22122141 Amar-Sin 9 22122093 22122094JUL25 20-III, 20-IV 0160u-Sin 9 22122084 Ibbi-Sin 24 22122075 End of dynasty 22122051 22122052APR13 21-XIIThe above date (22122093) for the accession of Amar-Sin had been determined disregarding the Venus chronologies. Back-reckoning from the Babylon I dynasty to that of Ur III is assumed to be accurate within very few years, see Sallaberger and Schrakamp (2013 5).The above Amar-Sin date is close to the date (22122099) obtained by back-reckoning from the High Venus chronology (Ammi1e63aduqa year 1 = 22121701).Thus the Ur III eclipse omens appear to favor the high Venus chronology.2b08 Month-lengths of Ur III.The lengths of the Mesopotamian months, that is the intervals between first visibilities of the lunar crescent, vary more or less randomly between 29 and 30 days. The disagreement- or miss-rate between (modern) calculations and (ancient) observations of 30-day months is about 10% for Late-Babylonian astronomical diaries, about 33% for Neo- and Late-Babylonian administrative texts.The rate of 33% need not apply to earlier texts, but if the dating practice bears any relation to the first visibility of the lunar crescent, we can expect a miss rate below the theoretical 47% applying for randomly wrong aligned months. With the currently available sample sizes, the difference between expected miss rates is too small to permit a statistically reliable dating on the basis of month-lengths alone.2b08#p16The Ur III period has its peculiar problems.In different cities different calendars were in use, with different, possibly incompletely known intercalations, and their synchronization is in part conjectural.Modern synchronization errors do not necessarily invalidate the conclusions, but they impair the discrimination power of the data by raising the overall miss-count.2b08#p17Sallaberger and Schrakamp (2015 613) comment about the high number of mismatches between 29- and 30-day-months of the Umma and Drehem calendars. Clearly, we need more data to elucidate what is going on here.However, a high number of mismatches is not surprising.As shown by differences in the intercalations, the two calendars are largely independent, and so we can assume that also the month-lengths were recorded independently.The discrepancies between recorded and calculated month-lengths seem to be essentially random.For the sake of the argument we shall assume them to amount to 33%. If we can assume that these 33% in the two calendars were occurring independently, the discrepancy rate between the recorded month-lengths of the two calendars will rise to about 44% 2013 which is practically indistinguishable from the previously mentioned rate of 47% for random wrong alignments between recorded and calculated month-lengths.2b08#p18By 1987 I had 228 useable Ur III month-length data, most of them supplied by Robert Whiting (see the Appendix). In the Amar-Sin to Ibbi-Sin range there were 126 data from Drehem, 60 from Umma, and in the 0160ulgi range there were 42 data from Drehem.Between 22122150 and 22121900 the best agreements (among over 3000) occurred if we date year 1 of Amar-Sin to 22122093 or to 20122005, with a tied miss rate of 83228 = 36.4%, see Huber (19992000 53-54).The agreement at 22122093 is persuasive it not only confirms the accession year of Amar-Sin we had found on the basis of lunar omens, but also the applicability of month-length data to chronological problems.2b08#p19Later, I realized that the 0160ulgi segment of month-lengths has peculiar problems, cf. Sallaberger (1993 5).Its month-lengths agree poorly with calculation, and if that segment is omitted, the miss-rate is lowered to 61186 = 32.8%.In the remainder of this paper the 0160ulgi segment shall be ignored.2b08 Estimating 0394T from the month-lengths?In my contribution to the Festschrift for Lis Brack-Bernsen (Huber 2017) I had been varying the value of c in the formula 0394T = ct2 (see Section 1 for that formula) in order to check the sensitivity of the miss counts to 0394T. There I had been concerned with the Ammiditana-Ammi1e63aduqa data.After reading my contribution, Lis persuaded me to overcome my initial reluctance and to apply the approach to the Ur III data, in order to check and possibly to improve the estimate of 0394T.2b08#p21The approximate chronological ranges obtained by back-reckoning from the conventional four main Venus chronologies (i.e. within a back-reckoning error of 00b110 years and assuming a New Year syzygy longitude between 31000b0 and 5000b0) gave a total of 252 feasible alignments, of which at most one could be correct. Among these alignments I picked the four years giving the best month-length matches obtainable with the default value c = 32.5.For each of those four years I then varied c in steps of 0.25 from 27 to 38.For the period in question this range of c corresponds to a 0394T range of a little over 00b12 hours, and the step-size of 0.25 changes 0394T by approximately 6 minutes.2b08#p22The best matches for the Amar-Sin to Ibbi-Sin data are obtained for Amar-Sin year 1 = 20122093, with an optimum centered near c = 32.75, clearly visible in Figure 1. For the sample size n=186, a theoretical calculation (based on a binomial distribution model with a miss rate of 47%, and approximately checked by playing with empirical alignments) yields that only about 1 in 10000 random wrong alignments will reach a miss count of 62 or lower.In order to check for a possible bias caused by performing the initial search for the four best chronologies with the default 0394T (c=32.5), I repeated the entire analysis, but searched for the four best matches with c = 30.0 or 35.0. I obtained basically the same results. The curve for Amar-Sin year 1 = 22122093 with a minimal nmiss = 60, again turned out to be the best solution.Actually, it turned out that for all 252 feasible alignments, except 22122093, the miss counts stay throughout above 66.My conclusion is unless we should suffer from an insidious attack by Murphys law (201cIf something can go wrong, it will201d), we can claim that Amar-Sins Year 1 began on 22122093 April 4, with a New Year syzygy longitude of 354.800b0.2b08#p23The location of the optimum suggests a narrowly constrained value of d0394T = +6 minutes in Ur III times, consistent with the ranges independently estimated from the Akkad lunar omens (20139 < d0394T < 31) and the Sargon solar eclipse (201320 < d0394T < 7). The singular importance of this month-length evidence is that it simultaneously verifies the Amar-Sin date derived from lunar eclipse omens and the clock-time correction derived from Akkad eclipses.2b08 Summary and conclusions.Three distinct kinds of data are potentially relevant for the astronomical dating of the late 3rd millennium BC lunar omens pertaining to the dynasties of Akkad and Ur III, a literary solar eclipse from the reign of Sargon, and Ur III month-length records. The data are precarious, and taken singly, their chronological reliability can be, and has been, questioned.But taken in conjunction, they persuasively yield unique, coherent chronologies for the dynasties concerned (Tables 1 and 2), and they are supported by 14C dates from Tell Leilan.Moreover, the Akkad lunar eclipse omens, the Sargon solar eclipse and the Ur III month-lengths unexpectedly yield narrowly constrained independent values for the clock-time correction 0394T. In particular, the newly determined results from the Ur III month-lengths (Figure 1) removed my earlier misgivings about the chronological value of the Ur III month-lengths.In my opinion they now give a decisive confirmation of both the clock-time corrections and the proposed chronologies for the late 3rd millennium.2b08#p25I am concerned here with the 3rd millennium chronology, but I should add a few remarks on the following period. The currently accepted chronology of the 2nd millennium BC is based primarily on dendro-chronological and 14C data from Anatolia, see Barjamovic, Hertel and Larsen (2012) and the discussion by Sallaberger and Schrakamp (2015 5-11).It is compatible with the Middle Venus chronologies (Ammi1e63aduqa year 1 = 20121645 or 20121637), but not with the High and Low Venus chronologies (20121701, 20121581). Undoubtedly, the Anatolian evidence favoring the range of the Middle chronologies is very strong.On the other hand one should keep in mind that the latter are poorly supported by astronomy.The Venus Tablet favors the High and Low Chronologies over the Middle ones, and depending on ones interpretation of the data, its evidence may even be strong enough to reject the middle two with statistical significance. This was pointed out already by van der Waerden (1965 47) and later elaborated by Huber et al. (1982 23).In addition, the Ammi1e63aduqa month-length evidence favors the High Venus chronology, see the detailed discussion in Huber (2017), in particular Figure 4 and Table 7. 2b08#p26Sallaberger and Schrakamp fix the chronology of the 3rd millennium through back-reckoning from Ammi1e63aduqa year 1 = 20121645; they obtain Ur-Namma year 1 = 20122109 (ibid. p. 5 and 136). Thus, their chronology for the 3rd millennium is 50 years lower than the one proposed here.One of the three pillars supporting the two chronologies thus must be off by these 50 years either my astronomical chronology for the 3rd millennium, or the dendro-chronological chronology for the 2nd millennium, or the back-reckoning.In order to settle the problem, rather than to waste ink on opinionated fruitless discussions, we need more data, and it appears that the only pertinent materials currently available are month-length data.2b08#p27How should we go on from here? First of all, we should use new month-length data to check the validity of the precise but fragile results described in this paper. I hope that the potential usefulness of the month-length data 2013 they might enable us to determine the absolute chronology of the late 3rd millennium within an accuracy of one day 2013 will animate some Sumerologists to dig into the enormously increased Ur III data basis we have by now and to extract trustworthy month-length information. I am not up to such a task. It is necessary but delicate to cleanly separate the month-length data according to local calendars and to pay attention to their synchronization.In particular, one should take a close look at lists of regular daily deliveries, since they give reliable actual month-lengths 2013 29 or 30 days 2013, more reliable than texts dated on day 30. 2b08#p28Works citedBarjamovic, , Hertel, & Larsen, , (2012) Ups and downs at Kanesh, Nederlands Instituut voor het Nabije Oosten, Leiden.2b08#reference-1Chapront-Touz00e9, , and Chapront, (1991). Lunar Tables and Programs from 4000 to 8000.Willmann-Bell, Richmond VA.2b08#reference-2Huber, (19992000).Astronomical Dating of Ur III and Akkad.Archiv f00fcr Orientforschung 4647 (19992000) 50-79.2b08#reference-3Huber, (2006).Modeling the length of day and extrapolating the rotation of the Earth.Geod. 80 (2006), 283-303.2b08#reference-4Huber, (2012).Dating of Akkad, Ur III, and Babylon Proc. of the 54th Rencontre Assyriologique Internationale, ed. Wilhelm. (2012) 715-733.Eisenbrauns, Winona Lake, Indiana.2b08#reference-5Huber, (2017).Dating by Month-Lengths Revisited.In Studies on the Ancient Exact Sciences in Honor of Lis Brack-Bernsen, John Steele, Mathieu Ossendriver (eds.). (2017) 19-68.Berlin Studies of the Ancient World 44 (ISBN 978-3-9816384-5-5; URN urnnbndekobv11-100246190).2b08#reference-6Huber, , and De Meis (2004).Babylonian Eclipse Observations from 750 BC to 1 BC. IsIAO 2012 Mimesis, Milano.2b08#reference-7Huber, , Sachs, , Stol, , Whiting, , Leichty, , Walker, and vanDriel, (1982).Astronomical Dating of Babylon I and Ur III.Occasional Papers on the Near East, Vol. 1, Issue 4.Malibu Undena Publications.2b08#reference-8Jacobsen, Th. (1939).The Sumerian King List.The Oriental Institute Chicago, AS 11.2b08#reference-9Morrison, , and Stephenson (1982).Secular and Decade Fluctuations in the Earths Rotation 700 BC 2012 AD 1978. In Fricke and Teleki (eds.), Sun and Planetary System, Dordrecht, Holland, Reidel Publishing Company.2b08#reference-10Rochberg-Halton, (1988).Aspect of Babylonian Celestial Divination The Lunar Eclipse Tablets of Enuma Anu Enlil.Archiv f00fcr Orientforschung, Beiheft 22.2b08#reference-11Sallaberger, (1993).Der kultische Kalender der Ur III-Zeit.Erg00e4nzungsb00e4nde zur Zeitschrift f00fcr Assyriologie und Vorderasiatische Arch00e4ologie, Band 71. De Gruyter.2b08#reference-12Sallaberger, , and Schrakamp (eds.) (2015). ARCANE III, History & Philology.Brepols Belgium.2b08#reference-13Sollberger, (1954-56).Sur la chronologie des rois d'Ur et quelques probl00e8mes connexes.Archiv f00fcr Orientforschung 17, 10-48.2b08#reference-14Steinkeller, (2003).An Ur III Manuscript of the Sumerian King List, in Literatur, Politik und Recht in Mesopotamien Festschrift f00fcr Claus Wilcke, herausgegeben von Walther Sallaberger, Konrad Volk und Annette Zgoll. Wiesbaden Harrassowitz, pp. 267201292, especially p. 272.2b08#reference-15van der Waerden, (1965).Anf00e4nge der Astronomie.Noordhoff.2b08#reference-16Weiss, , et al. (2012). 201cTell Leilan Akkadian Imperialization, Collapse and Short-Lived Reoccupation Defined by High-Resolution Radiocarbon Dating,201c in Weiss (ed.), Seven Generations Since the Fall of Akkad (Studia Chaburensia, Band 3).Harassowitz.2b08#reference-17Westenholz, (1997). Legends of the Kings of Akkade.Eisenbrauns, Winona Lake, Indiana.2b08#reference-18Appendix Ur III month-length dataDREHEM MONTH-LENGTHS (WHITING 1986)K Y M D Syz# Type Source Sh 39 6 30 883 2 CST 47 Sh 40 5 30 894 1 JCS 24 64 Sh 40 8 30 897 1 CST 51 Sh 40 10 29 2212899 2 AnOr 7 66 Sh 41A 1 30 902 2 TRU 274 Sh 41A 8 30 909 1 POL 19 162 (19) Sh 42 2 30 916 2 CST 467 Sh 42 12 30 926 1 MVN 11 210 UMMA? cf BIN 5 22 = AS 6? Sh 43 2 30 928 1 RT 37 p 136a + Sh 43 2 30 1 OLP 8 p 7 no 2 + Sh 43 9 30 935 1+3 ASJ 4 p 134 Kelsey 89203 + Sh 43 9 30 3 PDT 30 Sh 43 11 30 937 1 RO 11 p 96 no 1 Sh 44A 1 30* 939 1 MVN 3 200 Sh 44A 1 min 29* 2 MVN 10 169 Sh 44A 3 30 941 3 TS 69 Needs collation Sh 44A 4 min 29 2 PDT 460 Sh 44A 7 30 945 2 CST 76 + Sh 44A 7 30 3 CST 70 + Sh 44A 13 30 951 1 MVN 2 169 Sh 45 1 30 952 4 TRU.278 Sh 45 6 29* 2 Nik 2 496 + Sh 45 6 30* 1 MVN 13 517 + mu-DU A2-ki-ti; different month? Sh 45 7 29 2212958 2 MVN 13 224 + Sh 45 7 29 4 TS 177 + Needs collation Sh 45 8 30 959 1 MVN 13 127 + Sh 45 8 30 3 TRU 276 + Sh 45 9 30 960 1 RA 9 SA 17 + Sh 45 9 30 1 AnOr 7 74 + Sh 45 9 30 2 BIN 3 496 + Sh 46 2 30 965 1 TCL 2 5516 + Sh 46 2 30 3 TS 120 + Needs collation Sh 46 3 30 966 1 STD 12 Sh 46 4 30 967 1 TRU 262 + Sh 46 4 30 1 MVN 11 149 + Sh 46 4 30 3 TCL 2 5510 + Needs collation Sh 46 5 29 2212968 2 RO 5 p 5 no 4 Sh 46 6 30 969 4 CST 115 Sh 46 7 30 970 1 HVN 11 141 Sh 46 10 30 973 2 PDT 414 + Sh 46 10 30 2 BIN 3 10 + Sh 46 10 30 2 JCS 24 29 + Sh 46 11 30 974 1 TRU 270 + Sh 46 11 30 2 CST 150 + Sh 46 11 30 3 HVN 13 512 + Needs collation Sh 46 12 30 975 2 SRD 10 Sh 47A 1 30 976 1 DC 1 289 + Sh 47A 1 30 3 Aegyptus 19 p 228 + Needs collation Sh 47A 2 30 977 3 MVN 8 102 Sh 47A 5 30 980 2 OrAn 11 p 273 Sh 47A 7 30 982 1 TRU 114 + Sh 47A 7 30 1 Nik 2 450 + Sh 47A 7 30 1 AAS 212+ Needs collation Sh 47A 7 30 1 AUCT 1 896 + Sh 47A 7 30 3 AUCT 1 376 + Needs collation Sh 47A 8 29 2212983 3 POL 19 321 (4*) Sh 47A 9 30 984 1 SETDA 97 + Sh 47A 9 30 4 STD 13 + Sh 47A 10 30 985 1 Bab 7 p 78 no 14 Sh 47A 11 30 986 1 CST 194 + Sh 47A 11 30 1 JCS 24 6 + Sh 47A 11 30 1+3 MVN 13 429 + Sh 47A 1 1 30 3 Aegyptus 19 p 227 no 1 + Sh 47A 13 29 2212988 2 UCP 9 p 182 no 31 Sh 48 3 30 991 4 JCS 31 p 172f c HSM 911.3.93 Sh 48 8 30 996 1 POL 19 156 (13) Sh 48 9 29 2212997 3 MVN 2 160 Sh 48 10 29 2212998 5 RA 9 SA 56 ?Sh 48 11 30* 999 2 PDT 343 + Sh 48 11 28* 3 AUCT 1 331 + Needs collation AS 1 1 30 1001 1 TCL 2 5563 + AS 1 1 30 1 SET 29 + AS 1 2 29 22121002 4 RA 9 SA 60 AS 1 3 30 1003 1 CST 222 AS 1 4 30 1004 1 CST 227 + AS 1 4 30 1 TLB 3 130 + AS 1 6 30 1006 1 MVN 10 146 + year uncertain AS 1 6 30 5 Or 47-49 8 + AS 1 7 30 1007 1 AUCT 1 101 AS 1 10 30 1010 1 AUCT 1 25 AS 2 1 30 1013 1 CT 32 pl 48b AS 2 3 30 1015 1 PDT 171 + AS 2 3 30 1 TS 108 + AS 2 3 30 1 Or 47-49 10 + AS 2 5 30 1017 1 Or 47-49 65 + AS 2 5 30 1 Or 47-49 71+ AS 2 5 30 1 JCS 14 p 108 YBC 12560 + AS 2 5 30 3 POL 19 345 (Bab 12) + AS 2 5 30 4 SRD 15 + AS 2 7 30 1019 1 AUCT 2 365 AS 2 11 30 1023 1 BIN 3 44 + AS 2 11 30 1 AUCT 1 808 + AS 2 11 30 2 RA 9 SA 92 + AS 2 12 30 1024 1 TCL 2 5498 AS 3A 3 30 1027 1 TRU 43 + AS 3A 3 30 3 MVN 11 184 + AS 3A 4 30 1028 1 BIN 3 527 AS 3A 6 30 1030 1 TRU 318 + AS 3A 6 30 1 BRM 3 72 + AS 3A 6 30 1 AnOr 1 11 + AS 3A 6 30 1 Or 47-49 24 + AS 3A 6 30 2 PDT 537 + AS 3A 7 30 1031 4 SETDA 144 AS 3A 9 30 1033 1 CST 282 AS 3A 10 30 1034 1+3 BIN 3 368 AS 3A 11 30 1035 1 MVN 13 443 + AS 3A 11 30 1 MVN 13 446 + AS 3A 12 29 22121036 6 PDT 150 + AS 3A 12 29 6 Or 47-49 74 + AS 3A 13 30* 1 BIN 3 67 + AS 3A 13 29* 3 TRU 330 + AS 4A 1 30 1038 1 UCP 9 p 242 no 45 AS 4A 2 30 1039 1+6 PDT 211 AS 4A 3 30 1040 1 BIN 3 79 AS 4A 4 29 22121041 6 AJSL 38 p 141 AS 4A 5 30 1042 1 AUCT 1 700 AS 4A 6 30 1043 1 TAD 11 AS 4A 7 29 22121044 4 SETDA 152 AS 4A 8 30 1045 1 TRU 326 + AS 4A 8 30 1 RA 10 p 210 BM 103413 + AS 4A 8 30 1 AUCT 1 134 + AS 4A 10 30 1047 1 AUCT 2 126 AS 4A 11 30 1048 1 AUCT 1 242 AS 4A 12 29 22121049 2 RA 9 SA 129 AS 4A 13 29 22121050 3 St.Louis B3 cited in Cooper (diss.) p 48 AS 5 1 30 1051 1 SET 15 + AS 5 1 30 1 SET 16 + AS 5 1 30 4 SET 62 + AS 5 2 30 1052 1 PDT 62 + AS 5 2 30 1 CST 306 + AS 5 2 30 2 MVN 5 ll2 + AS 5 3 29 22121053 3 PDT 439 AS 5 4 30 1054 1 PDT 74 + AS 5 4 30 1 CST 314 + AS 5 5 30 1055 1 PDT 118 + AS 5 5 30 1 SA XLVI + AS 5 5 30 2 RA 9 p 50 SA 143 + no copy AS 5 6 30 1056 1 CST 323 + AS 5 6 30 1 ASJ 7 P 122 no 7 + AS 5 7 30 1057 3 PDT 584 AS 5 8 30 1058 1 DC 1 256 + AS 5 8 30 1 DC 1 311 + AS 5 8 30 3 PDT 584 + AS 5 9 30 1059 1 CST 333 + AS 5 9 30 3 PDT 584 + AS 5 10 30 1060 1 Nik 2 512 AS 6 2 30 1064 1 MVN 8 57 AS 6 3 29 22121065 3 MVN 13 49 Needs collation AS 6 4 30 1066 1 JANES 9 p 21 no 4 AS 6 8 30 1070 1 SETDA 158 + AS 6 8 30 1071 1 AUCT 1 827 + AS 6 8 30 1 MVN 13 8 38 + AS 6 8 30 1 JCS 14 p 112 NBCT 1556 + AS 6 9 30 1072 1 AUCT 1 253 + AS 6 9 30 1 AUCT 2 65 + AS 6 9 30 1 Or 47-49 94 + AS 6 9 30 1+3 TRU 283 + AS 6 10 30 6 SET 22 ? AS 7 1 29 22121075 3 AUCT 2 89 + AS 7 1 29 6 UDT 125 + AS 7 2 30 1076 1 SET 101 + AS 7 2 30 1 HVN 8 80 + AS 7 2 30 1+6 Or 47-49 104 + AS 7 3 29 22121077 6 AUCT 1 125 AS 7 4 30* 1 JCS 14 p 109 MLC 84 + AS 7 4 30* 2 MVN 13 694 + AS 7 4 29* 3 RA 9 SA 168 + Needs collation AS 7 5 30 1079 1 CT 32 pl 28-29 + AS 7 5 30 2 TRU 346 + AS 7 5 30 4 AUCT 1 694 + AS 7 7 30 1081 1 Or 47-49 55 + AS 7 7 30 1+6 AUCT 2 375 + year broken AS 7 8 30 1082 1 TCL 2 5590 + AS 7 8 30 1 AnOr 1 15 + AS 7 9 30 1083 1 TRU 13 + AS 7 9 30 1 AueT 1 711 + AS 7 9 30 1 Or 47-49 110 + AS 7 12 30 1986 1 BRM 3 71 + AS 7 12 30 3 TRU 333 + AS 8 2 30 1088 1 AUCT 1 801 AS 8 4 30 1090 1+6 AUCT 1 923 AS 8 6 30 1092 1 JCS 23 30 AS 8 7 30 1093 1 Sigrist p 5 + AS 8 7 30 4 AUCT 1 263 + AS 8 8 30 1094 4 AUCT 2 176 + AS 8 8 30 6 MVN 13 568 + AS 8 9 30 1095 1 BIN 3 186 + AS 8 9 30 1 AUCT 1 266 + AS 8 9 30 1 AUCT 1 891 + AS 8 10 29 22121096 2 POL 19 248 (012) AS 8 11 30 1097 1 SET 105 + AS 8 11 30 1 AUCT 1 187 + AS 8 12 30 1098 1+6 AUCT 1 97 + AS 8 12 30 1+6 AUCT 1 221 + AS 9A 1 28* 6 AUCT 1 398 Needs collation AS 9A 6 30 1104 1 AUCT 1 900 AS 9A 9 30 1107 4 JCS 31 p 173 E ASM 12078 AS 9A 10 29 22121108 2 POL 19 152 (H37) AS 9A 11 30 1109 1 PDT 384 SS 1A 2 30 1113 2 TCL 2 5527 + SS 1A 2 30 2 BIN 3 218 + SS 1A 3 30 1114 1 AUCT 1 559 + SS 1A 3 30 1 AUCT 2 82 + SS 1A 6 30 1117 1 PDT 298 SS 1A 8 30 1119 1 Or 47-49 122 SS 1A 9 30 1120 1 TS 93 SS 1A 12 29 22121123 2 RA 9 p 62 AM 13 SS 2A 3 30 1127 1 BIN 3 222 SS 2A 4 30 1128 1 MVN 3 247 SS 2A 6 30 1130 2 BIN 3 221 SS 2A 8 30 1132 1 Brooklyn Museum 74.71.17 Owen copy SS 2A 9 30 1133 4 PDT 573 collated OrAn 14 SS 2A 10 29 22121134 4 BIN 3 558 SS 2A 12 29 22121136 4 Bab 7 p 78 no 12 SS 3 3 30 1140 1 RA 9 SA 209 + SS 3 3 30 1 Sigrist p 18 + SS 3 6 30 1143 1 TS 169 SS 3 12 29 22121149 2 CT 32 pl 12 SS 4 3 30* 1 MVN 8 135 + SS 4 3 30* 1 Sigrist p 32 + SS 4 3 29* 2 Nik 2 480 + SS 4 8 30 1157 1 AUCT 1 284 + SS 4 8 30 1 UM not accessioned + Owen copy SS 4 9 29 22121158 2 POL 19 50 (E5) + SS 4 9 29 5 PDT 514 + SS 4 10 29 22121159 2 AUCT 2 244 SS 4 12 30 1161 1 SRD 24 SS 5A 3 30 1164 2 SETDA 174 SS 5A 5 30 1166 4 AUCT 2 372 SS 5A 8 30 1169 1 MVN ll l48 SS 5A 11 30 1172 1 MVN 13 692 SS 5A 12 30 1173 1 MVN 13 427 ? SS 6A 2 30 1176 1+4 CTC 7 SS 6A 3 29 22121177 4 CST 436 SS 6A 4 30 1178 1 TRU 253 SS 6A 11 30* 1 TRU 357 + SS 6A 11 29* 2 PDT 564 + SS 6A 13 30 1187 1 TRU 4 + SS 6A 13 30 1 Jones AV (Cadorini 4) + SS 7 1 29 22121188 3 MVN 13 422 + SS 7 1 29 3 TLB 3 34 + SS 7 7 29 22121194 3 AUCT 2 15 SS 7 8 30 1195 3 AUCT 2 15 SS 7 9 30 1196 1 MVN 13 484 + SS 7 9 30 3 AUCT 2 15 + SS 7 9 30 4 MVN 13 646 + SS 7 10 30 1197 3 AUCT 2 15 SS 8 1 30 1200 1 PDT 526 + SS 8 1 30 3 Aegyptus 19 p 230 no 5 + Needs collation SS 8 6 30 1205 3 PDT 409 SS 8 7 29 22121206 5 YOS 4 245 + SS 8 7 29 3 SETDA 178 + SS 8 8 30 1207 5 YOS 4 245 SS 8 9 29 22121208 5 Y0S 4 245 SS 8 10 30 1209 5 YOS 4 245 + SS 8 10 30 3 AUCT 1 543 + SS 8 11 30 1210 5 YOS 4 245 SS 8 12 30 1211 5 YOS 4 245 + SS 8 12 30 2 MVN 13 115 + SS 8 12 30 3 MVN 13 89 + SS 9 4 30 1215 1 SET 87 Chart SS 9 6 29 22121217 3 SET 87 xii 596-98 SS 9 7 30 1218 1 SET 87 + Chart SS 9 7 30 1 AUCT 1 715 + SS 9 7 30 3 SET 87 xii 599-601 + SS 9 7 30 3 UDT 171 + SS 9 9 29 22121220 3 PDT 7 SS 9 10 30 1221 1 SET 87 + Chart SS 9 10 30 1 AnOr 7 108 + SS 9 10 30 3 SET 87 xii 608-10 + SS 9 10 30 3 TSDU 94 + SS 9 10 30 3 AUCT 1 224 + SS 9 11 30 1222 1 SET 87 + Chart SS 9 11 30 3 SET 87 xii 613-15 + SS 9 12 30 1223 3 SET 87 xii 614-16 IS 1A 1 30 1224 4 AUCT 1 443 + IS 1A 1 30 5 CT 32 pl 47a + IS 1A 4 30 1227 1 OrAn 14 p 16 IS 1A 8 29 22121231 5 YOS 4 302 IS 1A 12 30 1235 2 BIN 3 260 IS 1A 13 29 22121236 2 TENS 63 IS 2A 1 29 22121237 3 TCL 2 5507 IS 2A 4 30 1240 1 BIN 3 618Intercalary years are indicated by A after the number of the year.2b08#p30Syzygy numbers (Syz#) are arbitrarily based at AS 1 1 = 1001. Months recorded as hollow are given a minus sign.If several months have the same recorded length, only one is considered.Questionable data are omitted (e.g. AS 6 10), also conflicting lengths are omitted (eg. AS 3 13).2b08#p31Type2b08 = UD.30.KAM (or equivalent expression)2b08 = New moon text2b08 = Regular deliveries for Gula andor the dogs2b08 = Other regular deliveries for a month2b08 = Unique-text type or information2b08 = Terminated(?) regular deliveries2b08#p38UMMA MONTH-LENGTHS (FROM HUBER et al. ded the Type and the Source) unfortunately were lost. A few entries were added after the monograph had been printed (marked B in the Source field; they were ignored in the later analysis).2b08#p39The first four columns give King, Year, Month and Day.2b08#p40Intercalary years (some of them conjectural) are indicated by A after the number of the year.2b08#p41Syzygy numbers (Syz#) are arbitrarily based at AS 1 1 = 1001. Months recorded as hollow are given a minus sign.If several months have the same recorded length, only one is considered.Questionable data are omitted.2b08"
}