{
  "articleId": "isaw-papers-1-2011",
  "text": "ARTICLE_ID: isaw-papers-1-2011 Two cuneiform astrological tablets in the British Museum provide the first evidence for Babylonian knowledge of the so-called doctrine of the Terms of Greco-Roman astrology (BM 36326 and BM 36628+36817+37197).Greek, Latin, and Egyptian astrological sources for the various systems of Terms and their origin are reviewed, followed by preliminary editions and translations of the relevant sections of the tablets. The system of Terms is shown to be so far the most technically complex component of Greek astrology to originate in Babylonia. Over the course of the Hellenistic period an Egyptian origin was ascribed to the systems of Terms as it was combined with components of Greek horoscopic astrology.By Ptolemy's day, this spurious history had largely displaced the true. Two recently identified cuneiform astrological tablets in the British Museum provide the first evidence for Babylonian knowledge of the so-called doctrine of the Terms of Greco-Roman astrology, which ascribed to the planets a special influence over fixed sections of each of the twelve zodiacal signs.3 BM 36326 and BM 36628+36817+37197 preserve parts of what appears to have been an astrological compendium containing material on calendrical and zodiacal astrology, stellar astrology, and constellations and city names. Although detailed provenance information has been lost, the two tablets are almost certainly from Babylon and may well have been written by the same scribe. Unfortunately, the date of composition of the tablets is not known. The presence of the zodiac indicates that they must date to after the development of the zodiac in the late fifth century ,4 and the scribes use of the old form of the number 9 (written with nine vertical wedges stacked in three rows of three) alongside the later cursive form (written with three winkelhaken placed in a diagonal line) is suggestive of a date in the fifth or fourth century , but a later date cannot be ruled out.#p1In the following we review the principal evidence from Greek, Latin, and Egyptian astrological sources for the various systems of Terms and their origin, and then discuss the sections of BM 36326 and BM 36628+36817+37197 which preserve details of the terms, concluding with a consideration of their relationship with the Greco-Roman and Egyptian tradition. A complete edition of the two tablets will be published elsewhere by Steele. The Terms in Greco-Roman and Egyptian astrology. Terms (ὅρια, literally boundaries) are subdivisions of the zodiacal signs comprising whole numbers of degrees, such that each of the five planets (and, in some systems, the Sun or both the Sun and Moon) is assigned the astrological lordship of one Term in each sign.5 The sequence and size of the terms typically varies from sign to sign.The principal application of the Terms was in horoscopes. The longitude of each of the heavenly bodies and astrologically significant points of the ecliptic (e.g. the ascendant and other cardines and the various lots, κλῆροι) determined which of the Terms it occupied and thus which of the planets was temporarily associated with it in the relationship of lord of its Terms.#p3The great majority of horoscopes on papyri and other archeologically recovered media specify only the zodiacal signs or, less often, the precise longitudes occupied by the Sun, Moon, planets, and ascendant at the moment of birth. In the horoscopes that do provide further data, the lords of the terms very frequently appear, normally paired with the lords of the Houses (οἶκοι), that is, of the entire zodiacal signs.6 For example, Oxy. astron. 4237, a horoscope for a person born in 84, reads as follows:7#p4Year 4 of Domitian, month Thoth the 9th, at the 6th hour of day, Sun in Virgo at degree 11, House of Mercury, Terms of Venus, Moon in Aries at degree 23 1/2, House of Mars, Terms of Saturn, Saturn in Aries at degree 24, House [remainder lost]#p5Terms appear in papyrus horoscopes as early as the mid first century of our era.8 The papyrus horoscopes practically never contain any interpretations or prognostications based on the recorded data, and thus never state any consequences drawn from the Terms. To survey what ancient astrological treatises say about the significance of the Terms would be a task beyond the scope of the present paper; the horoscopes used as examples in the treatises seldom include or interpret Terms.9 While the theoretical literature from antiquity does not preserve a systematic ranking of all the elements in the interpretation of a horoscope, Arabic sources that may reflect ancient traditions state that the Terms have less importance than the Houses and Exaltations, but more than the Decans.10 The comparative frequency of their appearance in papyrus horoscopes suggests that they may have played a fairly large role in astrological practice.#p6Ptolemy (Tetrabiblos 1.21, ed. H࿋ner) writes that two systems of Terms were in general use (περὶ δὲ τῶν ὁρίων δισσοὶ μάλιστα φέρονται τρόποι). In fact several systems of Terms are attested in ancient sources:11 (1) The system designated by Ptolemy as Egyptian, which is also described in numerous other Greek and Latin sources, none of which refer the system to the Egyptians, or to anyone else for that matter, and in Demotic papyri.This is the only known system attested in papyrus horoscopes, and by far the most commonly attested one in the horoscopes in astrological treatises. It assigns Terms only to the five planets.We will discuss this system in more detail below. (2) The system designated by Ptolemy as Chaldean.12 It is attested in no other source.The Terms are assigned only to the five planets, following a regular pattern for the order and lengths of the Terms based on the grouping of zodiacal signs into Triplicities (τρίγωνα) and the planets that were regarded as lords of the Triplicities. This system has distinct diurnal and nocturnal versions. (3) Ptolemy's own system, which he professes to have based on study of an old and damaged manuscript.13 It is elsewhere rarely attested, and only in sources dependent on Ptolemy.The Terms are assigned only to the planets, according to a complicated system of criteria determining their order and lengths. (4) A system alluded to but rejected by Vettius Valens (3.6bis ed. Pingree) as according to the seven-zone (ἑπτάζωνος).It apparently assigned Terms only to the five planets, according to their rank in distance from the Earth in a cosmology positing nested spherical shells or zones for the seven heavenly bodies.14 (5) The system preferred by Vettius Valens in the same chapter. Terms are assigned to the Sun and Moon as well as the five planets according to a regular scheme based on the lordships of the triplicities, and related to Ptolemy's Chaldean system (2).15 There are distinct diurnal and nocturnal versions of this system. (6) Yet another system preserved by Vettius Valens (8.9 ed. Pingree) in a corrupt form embedded in a table for calculating lifespans. Pingree has argued that this system derives from Critodemus, one of Vettius Valens' sources.16 Terms are assigned to the Sun as well as the five planets, in an order determined by their rank in distance from the Earth.17 This system is used in the same work (3.6 ed.Pingree) in a horoscope (GH18 L61,X), apparently for a date in 2,which Pingree, following Neugebauer and van Hoesen's suggestion, also conjecturally ascribes to Critodemus.19 (7) According to Porphyry, Introductio in Tetrabiblum Ptolemaei ed. Boer & Weinstock 212,20 Apollinarius had a system of Terms different from those of Ptolemy and of Thrasyllus and Petosiris and the rest of the ancients, by which Porphyry probably means the Egyptian system (1).Apollinarius was probably active during the first century ;21 nothing more is known of his system of Terms. (8) A system preserved in a Roman period (probably 2nd century ) Demotic papyrus, PYale CtYBR inv. 1132(B).22 The Terms are assigned only to the five planets, in a complex pattern that is partly related to the Egyptian system (1) while incorporating a regular pattern in the order of the assignment of Terms to the planets in each zodiacal sign. (9) A system described in the Sanskrit Yavanaja̅taka of Sphujidhvaja (3rd century ), based on a 2nd century Sanskrit rendering of a lost Greek astrological work.23 There are only two patterns of division of the zodiacal signs into Terms for the five planets, one applying to odd-numbered and the other to even-numbered signs.#p16Notwithstanding this profusion of systems, which bears out Sextus Empiricus' charge (Adv. math. 5.37) that a significant disagreement exists in the astrologers' tables of Terms, only the so-called Egyptian system is attested in more than one independent source, and only this system can be shown to be employed in archeologically recovered horoscopes.24#p17Our sources for the various systems of Terms commonly employ either of two methods of listing the Terms within each zodiacal sign.Method (a) is to state how many degrees belong to each heavenly body, in order of increasing longitude; the numbers for each sign should of course total 30. Method (b) is to state the ranges of degrees belonging to each body, again in order of increasing longitude; in this method, the degrees are treated as intervals beginning with the first degree and ending with the thirtieth degree, not as pointlike longitudes beginning with 0° and ending with 30°.Thus the first terms of Aries according to the Egyptian system are described either as the first six degrees belong to Jupiter; the next six degrees belong to Venus and so forth, or as from the 1st degree to the 6th degree belongs to Jupiter; from the 7th degree to the 12th degree belongs to Venus and so forth.#p18Some ambiguity adheres to the precise boundaries of the Terms as expressed in longitudes counted from 0° as the beginning of a zodiacal sign. For example in Oxy. astron. 4245 (a horoscope for 218), lines 12-13, Saturn's longitude is stated to be at Scorpio 11° 3x' (the final digit of the minutes is missing), in the Terms of Mercury.In the Egyptian system degrees 8 through 11 in Scorpio are conventionally assigned to Venus, and degrees 12 through 19 to Mercury, so it would appear that a longitude in the range between Scorpio 11° and 12° is counted as belonging to the 12th degree.25 On the other hand, in Paris 19 (a horoscope for 137, GH no. 137a), col. i lines 12-15, Jupiter is stated to be at Aries 12° 44', in the Terms of Venus. According to the Egyptian system, degrees 7 through 12 of Aries belong to Venus, and degrees 13 through 20 to Mercury; so in this case a longitude in the range between Aries 12° and 13° appears to be assigned to the 12th degree.26 This is the counterpart of the ambiguity of whether one should consider longitudes such as Taurus 0° 15' as belonging to Taurus (as Taurus 0° 15') or Aries (as Aries 30° 15').#p19As we have already mentioned, Ptolemy alone provides an attribution for the so-called Egyptian system, and it is no more specific than to Egyptian authors (παρὰ τοῖς Αἰγυπτίοις συγγραφεῦσιν). Modern historians have tended to suppose that the ultimate source was the pseudepigraphic Greek writings ascribed to the Egyptian sages Nechepso and Petosiris, a hypothesis that gains support from Porphyry's inclusion of Petosiris as one of the ancients (ἀρχαῖοι) whose system of Terms was different from those of the moderns (νεώτεροι) Ptolemy and Apollinarius, though Porphyry does not report any details of the system of the ancients that would confirm its identity with the Egyptian system.27 Complete descriptions of the Egyptian system are provided in a number of Greek and Latin sources, including the following:#p20Dorotheus of Sidon (mid first century ), extracts preserved by Hephaestio.28 The expression of the system in verse guarantees the textual integrity of this version, which employs method (a) for defining the Terms.#p21Teucer of Babylon (first century ?) as reported in a late compilation of uncertain authorship.29 Employs method (b).#p22Critodemus (first century ?) as reported in a late compilation of uncertain authorship.30 Employs method (b).#p23Ptolemy (second half of second century ), Tetrabiblos 1.21 (ed. H࿋ner). The system is presented in tabular format, employing method (a) along with running totals of degrees within each sign, i.e. the final degree of each Term's range according to method (b).#p24Vettius Valens (second half of second century ) 1.3 (ed.Pingree), employing method (a).#p25Firmicus Maternus (mid fourth century ) 2.6, employing method (b).#p26Paulus Alexandrinus (late fourth century ) 3, employing method (a).#p27Anonymous addition to Vettius Valens (mid fifth century ), in similar tabular format to Ptolemy's.31#p28Liber Hermetis (medieval, probably derived from a Greek source from late antiquity) 25, employing method (b).#p29The table below, based on the version in Dorotheus, presents the Egyptian system following both methods of specification.#p30Term 1 Term 2 Term 3 Term 4 Term 5 Aries ♃ N 6 (1-6) ♀ 6 (7-12) ☿ 8 (13-20) ♂ H 5 (21-25) ♄ – 5 (26-30) Taurus ♀ HD 8 (1-8) ☿ 6 (9-14) ♃ 8 (15-22) ♄ 5 (23-27) ♂ 3 (28-30) Gemini ☿ HN 6 (1-6) ♃ 6 (7-12) ♀ 5 (13-17) ♂ 7 (18-24) ♄ D 6 (25-30) Cancer ♂ 𠄽N 7 (1-7) ♀ 6 (8-13) ☿ 6 (14-19) ♃ + 7 (20-26) ♄ 4 (27-30) Leo ♃ N 6 (1-6) ♀ 5 (7-11) ♄ 7 (12-18) ☿ 6 (19-24) ♂ 6 (25-30) Virgo ☿ H+ 7 (1-7) ♀ 𠄽 10 (8-17) ♃ 4 (18-21) ♂ 7 (22-28) ♄ 2 (29-30) Libra ♄ +D 6 (1-6) ☿ N 8 (7-14) ♃ 7 (15-21) ♀ H 7 (22-28) ♂ 2 (29-30) Scorpio ♂ HDN 7 (1-7) ♀ 4 (8-11) ☿ 8 (12-19) ♃ 5 (20-24) ♄ 6 (25-30) Sagittarius ♃ HN 12 (1-12) ♀ 5 (13-17) ☿ 4 (18-21) ♄ 5 (22-26) ♂ 4 (27-30) C apricorn ☿ 7 (1-7) ♃ – 7 (8-14) ♀ D 8 (15-22) ♄ H 4 (23-26) ♂ + 4 (27-30) Aquarius ☿ N 7 (1-7) ♀ 6 (8-13) ♃ 7 (14-20) ♂ 5 (21-25) ♄ HD 5 (26-30) Pisces ♀ + 12 (1-12) ♃ H 4 (13-16) ☿ – 3 (17-19) ♂ DN 9 (20-28) ♄ 2 (29-30)Egyptian system of Terms.Benefic planets in green, malefics in red.Superscripts: H = lord of House; + = Exaltation; – = Depression; D = diurnal lord of Triplicity; N = nocturnal lord of Triplicity#p31A widely recognized principle was that the sum of the terms for each planet, interpreted as years, is the maximum lifespan associated with the influence of that planet. The accepted values for these maximum lifespans, in agreement with the above table, are: ♄ 57 years ♃ 79 years ♂ 66 years ♀ 82 years ☿ 76 years #p32Some of our sources for the Egyptian system give occasional variants for the lengths of the Terms, though the order within each sign is always the same.Since these variants affect the total of degrees for some of the planets, making them different from the conventional values for the maximum lifespans, it may be suspected that they arose from textual corruption rather than reflecting intentional divergences from the more commonly transmitted system.32 The variants are as follows, with the differing elements in bold:#p33Vettius Valens Libra: ♃ 5 (15-19), ♀ 7 (20-26), ♂ 4 (27-30) #p34Firmicus Maternus Gemini: ♀ 6 (13-18), ♂ 6 (19-24) Cancer: ☿ 7 (14-20), ♃ 7 (21-27), ♄ 3 (28-30) Sagittarius: ☿ 6 (18-23), ♄ 4 (24-27), ♂ 3 (28-30)#p35Addition to Vettius Valens Taurus: ♄ 6 (23-28), ♂ 2 (29-30) Leo: ♃ 5 (1-5), ♀ 6 (6-11) Libra: ♃ 8 (15-22), ♀ 6 (23-28) Aquarius: ♂ 4 (21-24), ♄ 6 (25-30)#p36Liber Hermetis Scorpio: ♃ 5 (20-24) but ♄ 5 (26-30)#p37Until recently, notwithstanding Ptolemy's attribution of it to unspecified Egyptians, no attestation of the Egyptian system was known in Egyptian-language sources. This situation has recently changed with the discovery of two Roman period Demotic papyri from the Tebtunis temple library (and apparently written by the same scribe), Carlsberg 81 and Carlsberg 89, that contain fragmentary portions of a list of Terms according to a variant of the Egyptian system.33 Between the two copies we can recover degree ranges or lordships or both for the majority of the terms, with the following deviations from Dorotheus' version, including a few differences in the assignment of planets as underlined: Aries: ♄ 6 (1-6); the last three terms of the sign are not preserved Taurus: ♄ 8 (15-22); the last two terms of the sign are not preserved Leo: ♀ 8 (7-14); other terms in the sign are not preserved Libra: ♄ 7 (1-7); ☿ 6 (8-14); ♃ 6 (15-20) Capricorn: ♀? 10 (15-24); ♄? 3 (25-27); ♂ 3 (28-30) Pisces: ♄ uncertain extent (x-27); ♂ 3 (28-30)#p38The fact that the source is an original document from antiquity rather than a medieval copy recommends taking the variants seriously as witnesses to a genuine alternative version of the Egyptian system, though scribal errors cannot be ruled out. It is of course impossible to tell whether the totals for each planet equalled the conventional maximum lifespans.Though one might be tempted to regard the existence of Demotic versions of the system as evidence that it was indeed Egyptian in origin, such a conclusion would be rash, since the papyri are likely to date from the second century , thus later than the earliest Greek sources for the system, and transmission of astrological doctrines from Greek to Egyptian is also plausible.#p39Concerning the basis of construction of the Egyptian system, Ptolemy says, first, that it is primarily founded on the lordships of the Houses, and then that, with respect to which of the planets is allotted the first Term in each sign, it follows the lordships of the Houses in some places, the lordships of the Triplicities in others, and sometimes the Exaltations. Of these, we have already mentioned the lordships of the Houses.They are allotted symmetrically according to the presumed order of distance of the planets derived from Greek astronomy:#p40Sign Lordship Sign Lordship Leo Sun Cancer Moon Virgo Mercury Gemini Mercury Libra Venus Taurus Venus Scorpio Mars Aries Mars Sagittarius Jupiter Pisces Jupiter Capricorn Saturn Aquarius SaturnThe exaltations (derived from Babylonian astrology) and the diametrically opposite depressions are as follows:#p41Exaltation Depression Sun Aries Libra Moon Taurus Scorpio Mercury Virgo Pisces Venus Pisces Virgo Mars Capricorn Cancer Jupiter Cancer Capricorn Saturn Libra AriesThe grouping of zodiacal signs into Triplicities is a concept of Babylonian origin, although their lordships have not been traced to Babylonian sources:34#p42Diurnal Nocturnal Aries, Leo, Sagittarius Sun Jupiter Taurus, Virgo, Capricorn Venus Moon Gemini, Libra, Aquarius Saturn Mercury Cancer, Scorpio, Pisces Mars (with Venus) Mars (with Moon)Ptolemy (1.19) connects these lordships with the lordships of the Houses and the conventional classification of the heavenly bodies into sects characterized as diurnal (Sun, Jupiter, Saturn, sometimes Mercury) and nocturnal (Moon, Venus, Mars, sometimes Mercury): the lords of a Triplicity are usually chosen from the lords of the Houses that it comprises, and the lords of alternating triplicities are either both diurnal or both nocturnal.It is not clear how much of this is after-the-fact rationalization of accidental patterns.#p43When it comes to the order of the Terms themselves, the one truly manifest determining consideration is one that Ptolemy does not mention in this context, the classification (again of Babylonian origin) of the planets into benefic (Jupiter and Venus), ambivalent (Mercury), and malefic (Saturn and Mars).35 The last two Terms of each sign are almost always, and the last Term always, assigned to a malefic planet, while the first three Terms are mostly reserved for the benefics and Mercury. The relative order of these two groups seems to follow no pattern.The lord of the first Term has a strong tendency to hold some kind of lordship applying to the entire zodiacal sign, but (as Ptolemy himself remarks) it is difficult to discern any general principles.For five of the twelve signs the lord of the House is also the lord of the first Term, apparently justifying Ptolemy's statement connecting the system to the House lordships. But in every one of these instances, the same planet has another association with the sign, so that it is by no means assured that the Egyptian system was originally devised in relation to the scheme of Houses𠅊 critical point, since the Houses are undoubtedly dependent on a Greek cosmology. Edition and translation of the lists of Terms in Babylonian tablets.BM 36628+36817+37197#p45Obv. I3 [TA … EN] 5 šá MÚL-BABBAR4 [TA … E]N 12 šá dele-bat5 [TA … E]N 20 šá GU4-UD6 [TA … E]N 25 šá GENNA7 [TA … E]N 30 šá AN8 [TA … EN] 6 šá dele-bat9 [TA … EN 1]4? šá GU4-UD10 [TA … EN …] šá MÚL-BABBAR11 [TA … EN] 26 šá [GEN]NA12 [TA … EN] 30 šá AN13 [TA … E]N 6 šá GU4-UD14 [TA … E]N 12 šá MÚL-BABBAR15 [TA … E]N 16 šá dele-bat16 [TA … E]N 24 šá AN17 [TA …] EN 30 šá GENNA3 [From … to] 5 of Jupiter4 [From … t]o 12 of Venus5 [From … t]o 20 of Mercury6 [From … t]o 25 of Saturn7 [From … t]o 30 of Mars8 [From … to] 6 of Venus9 [From … to 1]4? of Mercury10 [From … to …] of Jupiter11 [From … to] 26 of [Sat]urn12 [From … to] 30 of Mars13 [From … t]o 6 of Mercury14 [From … t]o 12 of Jupiter15 [From … t]o 16 of Venus16 [From … t]o 24 of Mars17 [From …] to 30 of SaturnBM 36323#p46Obv. I1 [TA … EN …] šá AN2 [TA … EN …] šá dele-bat3 [TA … EN …] šá GU4-UD4 [TA … EN …] šá MÚL-BABBAR5 [TA … EN 30] šá GENNA6 [TA … EN …] šá MÚL-BABBAR7 [TA … EN …] šá dele-bat8 [TA … EN …] šá GENNA9 [TA … EN …] šá GU4-UD10 [TA … EN 30] šá AN11 [TA … EN …] šá dele-bat12 [TA … EN …] šá GU4-UD13 [TA … EN 2]1 šá MÚL-BABBAR14 [TA … EN …] šá AN15 [TA … EN] 30 šá [GEN]NA16 [TA … EN …] šá [GEN]NA17 [TA … EN …] šá GU4-UD18 [TA … EN 2]1? šá MÚL-BABBAR19 [TA … EN 2]6 šá dele-bat20 [TA … EN 30] šá A[N]21 [TA … EN …] šá AN?22 [TA … EN …] šá dele-bat23 [TA … EN 30] šá […]1 [From … to …] of Mars2 [From … to …] of Venus3 [From … to …] of Mercury4 [From … to …] of Jupiter5 [From … to 30] of Saturn6 [From … to …] of Jupiter7 [From … to …] of Venus8 [From … to …] of Saturn9 [From … to …] of Mercury10 [From … to 30] of Mars11 [From … to …] of Venus12 [From … to …] of Mercury13 [From … to 2]1 of Jupiter14 [From … to …] of Mars15 [From … to] 30 of [Sat]urn16 [From … to …] of [Sat]urn17 [From … to …] of Mercury18 [From … to 2]1? of Jupiter19 [From … to 2]6 of Venus20 [From … to 30] of Ma[rs]21 [From … to …] of Mars?22 [F rom … to …] of Venus23 [From … to 30] of […]3.Discussion.Both sections, so far as they are preserved, lack an explanatory heading, and we have only the ends of the lines.Rulings group the lines in sets of five, with the five planets named in varying order in each set.Preceding each planet's name, a numerical range was specified, of which we have none of the initial numbers but many of the terminal numbers, especially in BM 36628+; they are whole numbers increasing by variable increments, always ending with 30 for the terminal number for the last planet in a set.#p47If we compare the two lists with the Egyptian system of Terms, it becomes immediately obvious that the Babylonian tablets preserve parts of a variant of the Egyptian system set out according to method (b).36 The section in BM 36628+ covers the signs Aries through Gemini, while that in BM 36323 covers Cancer through the first part of Scorpio, thus a little more than half the zodiac.#p48There are two difference in the order of planets compared to the standard Egyptian system, in both cases involving interchange of two consecutive lordships: the last two Terms of Aries (BM 36628+, 6'-7') are assigned respectively to Saturn and Mars rather than vice versa, and the first two Terms of Virgo (BM 36623, 11-12) are assigned respectively to Venus and Mercury rather than vice versa. Variants in the lengths of the Terms are more frequent despite the loss of most of the degree numbers in BM 36623: Aries: ♃ 5 (1-5), ♀ 7 (6-12) Taurus: ♀ 6 (1-6), ☿ 8? (7-14?), ♄ ? (?-26), ♂ 4 (27-30) Gemini: ♀ 4 (13-16), ♂ 4 (17-24) Libra: ♀ 5 (22-26), ♂ 4 (27-30) #p49These variants do not include any coincidences with the variants listed above from Greco-Roman and Egyptian sources.#p50In our present state of comparative ignorance of late Babylonian astrology, we can say little about what function was imputed to the Terms. They obviously presume not merely an astrology based on the uniform zodiac but one in which precise longitudes of heavenly bodies in degrees were available and regarded as significant.This suggests that they were employed in the interpretation of personal proto-horoscopes that gave longitudes in degrees, probably derived from mathematical astronomy—the kind of proto-horoscope that most nearly resembles the Greco-Roman horoscopes.37#p51Of the 28 currently known proto-horoscope tablets, seven (with birth years ranging from the mid third to the mid first century ) give degrees for at least some of the heavenly bodies. Among these seven documents, only one contains what may be a reference to a Term, but likely is not.In NCBT 1231 (Rochberg no. 9), the proto-horoscope of the astronomer Anu-bēlšunu, line 6 appears to read: ] 12 GU KI dele-bat a-lid DUMU.MEŠ TUK ] Aquarius 12° in the place of Venus he was born: He will have sons.#p52The longitude Aquarius 12° exactly matches the longitude of the Moon stated in line 4, suggesting that an omen text is being invoked to the effect that if the Moon is in the place of Venus: he will have sons. As it happens, at the birthdate in question (249 December 29, evening) the Moon was simultaneously within the Terms of Venus according to the Egyptian system (Aquarius 8°-13°) and close to the planet Venus (at approximately Aquarius 7° tropical longitude).#p53Although it cannot be proved that the two known tablets containing the list of Terms were written earlier than the composition of the Nechepso-Petosiris corpus from which the Greek doctrine of Terms is presumed to stem, it is exceedingly improbable that the Terms entered Babylonian astrology by a transmission from Greek or Egyptian. Rather, we have a further instance of the incorporation into Greek astrology of elements derived from Babylonian astrology, others of which include:38#p54basing a prediction for the life and character of an individual on celestial conditions prevailing on or near his or her birthdatethe uniform zodiacthe classification of planets as benefic or malefic39the so-called δωδεκατημόριον, associating with any longitude a dependent longitude that is 12 times as many degrees greater than the given longitude as the given longitude is greater than the beginning of its zodiacal sign40the designation of specific zodiacal signs as Exaltations of the heavenly bodies (matching the Babylonian secret places, bīt niṣirti)the association of zodiacal signs into triplicitiesThe system of Terms is the most technically complex component of Greek astrology so far shown to originate in Babylonia, involving as it does an irregular pattern of sixty distinct lengths and lordships of Terms, most of which were retained unchanged in the standard Greek version. Such a detailed scheme was surely transmitted by the aid of written texts, not merely oral instruction.#p55Situating the system's origin in Babylonia rather than Egypt puts the question of the principles of its organization in a new perspective; and the variants in the sequence and length of the Terms, which are most plausibly to be explained as the result of changes introduced after the transmission, imply that the answer is likely to be too complicated to recover unless a more nearly complete text of the Babylonian version becomes available. The traditional claims, reported with scepticism by Ptolemy, that the system was constructed around the lordships of the Houses, Triplicities, and Exaltations, is cast into doubt, since the lordships of the Houses depend on a Greek cosmology, while those of the Triplicities have not as yet turned up in cuneiform sources and perhaps derive in part from the House lordships.In this light it is noteworthy that one of the changes in order of planets gave Mercury the lordship of the first Term of Virgo, in which sign it has both House lordship and exaltation. This change, at least, looks like a deliberate attempt to bring the system into closer harmony with the other lordships.We still lack a satisfactory explanation for the original order of planets, and in particular the reasons behind assigning the first Terms of Cancer, Libra, and Scorpio to the malefic planets.The original lengths of the terms, and the various changes to them introduced in the Greek version, also remain unexplained, and we do not know at what stage or in what manner their totals were connected with the doctrine of maximum lifespans.#p56Setting aside these questions of technical detail, the most interesting outcome of the discovery of the Babylonian lists of Terms is the realization that the Babylonian origin of the Egyptian scheme could have been forgotten or suppressed in the Greek tradition, and moreover that it came to be strongly associated with Egyptian sages of old, in contrast to an allegedly Chaldean system that, up to the present, has not turned up in cuneiform sources.41 During the Hellenistic period, astrological prognostication was strongly associated with Babylonians or Chaldeans, and many of its first practitioners in the Greco-Roman world were undoubtedly of genuine Near Eastern derivation or were trained by scholars belonging to the Mesopotamian tradition. The fusion of Babylonian proto-horoscopic astrology into a Greek, truly horoscopic astrology incorporating a horizon frame of reference and elements from Greek cosmology was accompanied from the outset by a fictitious account of the ancient Egyptian origins of astrology, most concretely embodied in the persons of Nechepso and Petosiris (and to a lesser extent Hermes-Thoth).By Ptolemy's day, the spurious history had largely displaced the true."
}