{
  "articleId": "isaw_paper7_6",
  "text": "ARTICLE_ID: isaw_paper7_6\nISAW Papers 7.6 (2014)Moving the Ancient World Online ForwardTom Elliott and Chuck JonesFrom its very beginning it has been the mission of the library of the Institute for the Study of the Ancient World not only to acquire traditional paper-based scholarship but also to develop digital resources as a fundamental component of its collections, integrating the worlds oldest languages, scripts, and cultures with the newest technologies. Under Charles Jones' leadership as ISAW's Head Librarian, it has pursued this agenda in partnership with not only NYU Library's Digital Library Technology Services team, but also ISAW's own Digital Programs department (directed by Tom Elliott), both of which are widely regarded as innovative thought leaders in the fields of digital scholarly publication and preservation.#p1In this context, a key concern remains the identification, description, cataloging, and accessibility of the growing global corpus of digital scholarly resources for the widest possible audiences. Both retrospective digitization and born-digital scholarly publishing are producing a vast, varied trove of documents, databases, web sites, and other digital resources of value for the study of antiquity. ISAW's research mission and spatio-temporal footprint demand that these be brought within the reach of its faculty, students, and visiting scholars in an organized and useful manner, continuously updated. Both the nature of the material, and the transformative vision pursued by ISAW, dictate that we address this concern not only for our own internal needs, but also for an extramural, global audience.That much of this material appears on the open web, outside established library acquisition and cataloging channels, reveals tension with traditional library practises.What we need, therefore, is an easy way to capture and describe digital resources anywhere on the open web that integrates smoothly with existing and emerging library systems, with standard scholarly research management software, and with ISAW and NYU's public facing websites and digital publications.#p2ISAW took its first public step in support of this goal in 2009, when Jones launched AWOL: The Ancient World Online1 as an extension to Abzu2, his pioneering guide to networked open access data relevant to the study and public presentation of the Ancient Near East and the Ancient Mediterranean world. AWOL is now firmly established as the primary vector of information on digital and digitized antiquity, with more than five thousand subscribers to its daily update and more than 750 unique visitors daily over the past year. It indexes and describes more than twenty existing and emerging scholarly resources each week, and its running list of open access serial publications includes well over a thousand titles.3 It regularly lists emerging and existing born digital projects, and it publicizes repositories of digitized scholarship relating to antiquity with a cumulative content of thousands of volumes.#p3With the assistance of a grant from the Delmas Foundation, we now seek to expand upon AWOL's current, lightweight but labor-intensive blog-based format to realize the vision outlined above, i.e., a comprehensive and sustainable combination of software, process, and people that can help scholars and students around the world find and use the full richness of the new digital scholarly landscape. A short, illustrated description of the current and proposed workflows follows.#p4The Ancient World Online reaches its audience through a blog4 and via syndication of the news feed from the blog to email and social media outlets. As illustrated in Figure 1, Jones identifies web content suitable for inclusion in AWOL and then copies it manually into the blog via the standard web interface provided by Google's Blogger service, which hosts the blog.5 He edits the blog content as necessary and then publishes it, making it immediately available to AWOL's blog audience over the World-Wide Web.Blogger pushes summary information about each publishing update to Google's Feedburner service,6 which in turn automatically publishes both an update feed (to which users can subscribe using third-party feed reading tools like Feedly.com) and a daily email digest. AWOL has 6,096 current subscribers7 to the daily email syndication of the news feed8; 277 persons connected to the Facebook syndication of the news feed ; and 585 persons connected to the Twitter syndication of the news feed9. On the blog page itself in the last six months there have been 184,795 unique visits (=1,200 /day) of which 31,622 are returning visits.#p5Our proposed enhancements to AWOL will maintain the core delivery mechanisms via the existing blog and Feedburner, while adding additional publication channels via NYU library systems and OCLC Worldcat,10 as well as ISAW's own website.We will also streamline and improve content capture and preparation through automation and the use of a structured, collaborative web database designed for web and bibliographic citation.#p6As illustrated in Figure 2, instead of manually copying information about websites into the blog, the editor will use the free, open-source Zotero citation manager11 to capture snapshots of individual web resources and to annotate these with bibliographic information and categorical tags. This data will be automatically synchronized with a free group account on the Zotero server, thereby enabling the editor to involve interested third-party collaborators and the existing ISAW cataloging staff in capturing, refining, and updating data for publication.Zotero server's open Application Programming Interface (API)12 will automatically make the resulting data available in a variety of formats suitable for further use online and in other citation management systems like ProCite and EndNote, thereby creating a new dissemination channel for a broader set of audience use cases (not shown in diagram). One of these Zotero output formats u2013 an open standard called Bibliontology RDF13 u2013 will provide the input to two conversion programs ISAW developers will create: one to transform the AWOL bibliographic content into bibliographic data suitable for submission to NYU's library catalog systems and the other to use Blogger's open API14 to post new or updated content to the existing blog without manual intervention. ISAW's website and other digital publications will also take advantage of the Zotero API outputs to incorporate and reuse AWOL content as appropriate."
}