{
  "articleId": "isaw_paper15",
  "text": "ARTICLE_ID: isaw_paper15\nISAW Papers 15 (2019) Tables of Synodic Events from -800 to 1650 Using Modern and Almagest Models Christián Carman (Universidad Nacional de Quilmes, CONICET) and Dennis Duke (Florida State University) http://hdl.handle.net/2333.1/2fqz68dk Abstract: This article describes and makes available computed data for the major synodic events for the inner (Mercury, Venus) and outer (Mars, Jupiter, Saturn) planets for the time period -800 to 1650. Library of Congress Subject: Astronomy. We have computed the major synodic events for the inner (Mercury, Venus) and outer (Mars, Jupiter, Saturn) planets for the time period -800 to 1650. The events are computed using modern models (Bretagnon 1986) and the models from Ptolemy’s Almagest (Pedersen 2011). While ordinary ephemerides give planetary positions at a list of times, our tables give the times and positions of the planets for a list of events. Often in discussions of ancient astronomy it is helpful to be able to look up directly the time and positions of such events for both modern models and the Almagest models. The events computed for the inner planets are: 1) superior conjunction of the true planet and the mean Sun, 2) greatest elongation (east), 3) first station, 4) inferior conjunction of the true planet and the mean Sun, 5) second station, and 6) greatest elongation (west). The events computed for the outer planets are: 1) conjunction of the true planet and the mean Sun, 2) first station, 3) opposition of the true planet and the mean Sun, and 4) second station. For each event we give the date/time and the corresponding true and mean longitudes of the planet and the Sun. The accuracy of the computed times is about 1/28th of a second. This is accomplished in each case by an appropriate set of iterations and/or interpolations, and, no doubt needless to say, is far more precise that any possible observation timing by any ancient astronomer. We have also computed the date and time of first and last visibilities of the inner and outer planets at Alexandria (longitude 29;55 degrees east, latitude 31;13,12 degrees north) and Babylon (longitude 44;26 degrees east, latitude 33;20 degrees north) for the same time period -800 to 1650 using the same modern and Almagest models. The events computed for the inner planets are: 1) first visibility of the planet in the west after sunset (EF), 2) last visibility of the planet in the west after sunset (EL), 3) first visibility of the planet in the east before sunrise (MF), 4) and last visibility of the planet in the east before sunrise (ML). The events computed for the outer planets are: 1) first visibility of the planet in the east before sunrise (EF), 4) last visibility of the planet rising after sunset (AR), 3) first visibility of the planet setting before sunrise (CS), and 4) last visibility of the planet in the west after sunset (EL). The AR and CS events are not mentioned in ancient sources, but are included here for completeness. Computation of these visibility events requires a number of additional assumptions beyond the specification of the models. We use the arcus visionis (AV) model of the Almagest, which depends upon the specification of an AV distance of the Sun below the horizon at the moment the planet is on the horizon. For both the modern and Almagest models we give results for two sets of parameters. The first set uses the default convention of the program PLSV (Swerdlow 2004) that the apparent planet, i.e. corrected for refraction (Meeus 1998, 101), is on the horizon and the Sun is depressed below the horizon at a set of AV values specific to each planet and event type that generally follow Schoch (Schoch 1924). The second set assumes the true planet is on the horizon and uses the values from the Almagest XIII 7 (Toomer 1984) except that for the AR and CS events we use half the AV value since the Sun is on the opposite horizon as the planet. In all cases the date given for the visibility events cannot be considered as more than indicative, since such events are in reality sensitive not only to the AV values but also to local weather, obscurations of the horizon, azimuth differences of the planet and the Sun, etc. It is the case, however, that our results for the modern model do match fairly closely with the results from PLSV."
}