{
  "articleId": "isaw_paper8",
  "text": "ARTICLE_ID: isaw_paper8\nThe extant portion of the verso side of the Muziris papyrus (PVindob G 40822 v = SB XVIII 13617 v) contains the monetary evaluation of three-quarters of an Indian cargo loaded on the ship Hermapollon.Among the commodities are 167 elephant tusks weighing 3,228.5 kgs and schidai weighing 538.5 kgs.It is argued that schidai are fragments of tusks trimmed away from captive elephants. A comparison with commercial ivory lots of the early sixteenth century shows the selected quality of the tusks loaded on the Hermapollon.#abstractSubjects: India--Relations--Rome, Ivory industry, Economic history--to 500. IntroductionThe texts on the Papyrus Vindobonensis G 40822,1 now widely known as the Muziris papyrus, will be remembered as among the most significant pieces of evidence related to Indo-Roman trade published in the twentieth century, and the more we understand them, the more important they become.The extant portion of the text on the verso contains the monetary evaluation of three-quarters of the South Indian cargo loaded on the ship Hermapollon (probably at Muziris, mentioned in the text on the recto), and two recent papers, one by Federico Morelli and the other by me, have proposed an almost complete reconstruction of the evaluated commodities. Both papers emphasized, albeit in very different measures, the predominant share of pepper and malabathron in the cargo, the two main exports from the Limyrike emporia.2 Both Morelli and I came to recognize that the 771 money talents and 4,632 drachmae recorded at col. i, ll. 25-263 are the value of (almost) three-quarters of the pepper cargo, but while Morelli suggests that that value resulted from a price of 24 drachmae per mina, I contend that a price of 6 drachmae per mina is the only price that can account for the position of other numerical values in the text. Moreover, both Morelli and I interpret the weight number at col. i, l. 18 as the weight of three-quarters of the malabathron cargo, but while he reads the first two digits as 1,200 and assumes a price of 20 drachmae per mina, I read them as 1,800 and deduce a price of 12 drachmae per mina.Finally, I assume that the Hermapollons cargo included another commodity, evaluated at col. i, ll. 14-16, which might have been tortoise shell. In this paper I would like to focus on two other commodities exported on the Hermapollon: the sound ivory tusks and the schidai.As the meaning of the Greek term schidai in the papyrus is disputed, it makes better sense to analyze the two commodities in reverse order of their appearance in the document.Therefore, we shall start with the schidai and later consider the sound ivory.#p1Schidai, ivory of lower value. As we shall see, schidai represent less than 1% of the entire value of the Hermapollons cargo, and their weight was little more than half a ton.Yet a correct understanding of this entry will have a significant impact on the general interpretation of the text, and may shed some light both on the Cu0113ra kingdom to which the ancient Muziris belonged and on the ivory trade on the ancient Indian Ocean.#p2In the papyrological documents, the Greek term u03c3u03c7u03afu03b4u03b1u03b9 (schidai) occurs only on the verso of the Muziris papyrus col. ii, ll. 16 and 25. In that portion of the textu2014col. ii, ll. 16-25u2014the value of three-quarters of the schidai brought back by the Hermapollon is calculated.The evaluation follows the complex pattern by which the three-quarters of sound ivory is assessed at col. ii, ll. 4-15.From the weight number representing the three-quarters (13 weight talents and 9.75 minae), a small parcel (22.75 minae), which is said to be taken in addition by the arabarchs4 for the tetartologia, is removed. The rest (12 weight talents and 47 minae) is converted twice, first into Roman pounds at the ratio of 1 Egyptian talent to 95 Roman pounds, and then back into Egyptian talents at the ratio of 97.5 Roman pounds : 1 Egyptian talent.The resulting weight number (12 weight talents and 27 minae), at the price of 70 drachmae per mina, leads to a value of 8 money talents and 4,290 drachmae.Then the 22.75 minae that had been taken in addition by the arabarchs for the tetartologia are multiplied for the same price of 70 drachmae per mina: the result is 1,592.5 drachmae. By adding the two subtotals, a value of 8 money talents and 5,882.5 drachmae is obtained.#p3As Rathbone first understood and Morelli now confirms, 13 weight talents and 9.75 minae are just three-quarters of the schidai exported on the Hermapollon.The entire quantity was the weight number recorded at col. i, l. 10, that is, 17 weight talents and 33 minae, from which one quarter (4 weight talents and 23.25 minae) was removed.#p4Since the talent referred to here is equivalent to 95 Roman pounds, the schidai weighed around 538.5 kgs. But what exactly is a schida?Drawing on Hesychius entry <u03c3u03c7u03afu03b4u03b1>u0387 u03c3u03c7u03afu03b4u03bfu03c2 u03c3u03b9u03bdu03b4u03ccu03bdu03bfu03c2, u03c0u1fc6u03b3u03bcu03b1 (schida: division of a garment, fabric),5 Harrauer and Sijpesteijn, the first editors of the papyrus, understood the term as referring to a detached piece of a larger whole u03c3u03b9u03bdu03b4u03ceu03bd, a bale of cloth.6 Although neither u03c3u03c7u03afu03b4u03b1u03b9 nor u03c3u03b9u03bdu03b4u03ccu03bdu03b5u03c2 (cloths, garments) are mentioned in the Periplus Maris Erythraei as Limyrike commodities,7 Harrauer and Sijpesteijn pointed out that the Periplus Maris Erythraei does mention u03c3u03b9u03bdu03b4u03ccu03bdu03b5u03c2 among the exports from the Ganges emporion,8 and that Gangetic nard, another typical Ganges commodity9 imported by the Hermapollon,10 also appears among the commodities available in the Limyrike emporia.11 The implicit suggestion was that both Gangetic nard and excellent Gangetic garments were exported from the Ganges emporion to Muziris and from there re-exported to Egypt.#p5Harrauer and Sijpesteijn considered the possibility that in Vindob. G 40822 verso col. ii, ll. 16; 25 u03c3u03c7u03b9u03b4u1ff6u03bd could be a misspelling for u03c3u03c7u03b9u03b6u1ff6u03bd,12 but they rejected the idea that it could have meant Holzscheit.13 They also rejected a connection with Hesychius lemma u03c3u03c7u03afu03b4u03b9u03b1u0387 u1f60u03bcu03ccu03bbu03b9u03bdu03b1, on the grounds that raw Flax (u1f60u03bcu03ccu03bbu03b9u03bdu03b1), a typical Egyptian product, is unlikely to appear among the imports from India.14#p6The interpretations of Harrauer and Sijpesteijn, basically accepted or unquestioned by subsequent scholars,15 were challenged by Rathbone. Considering u03c3u03c7u03afu03b4u03b1 as only a variant of u03c3u03c7u03afu03b6u03b1 (piece of wood cut off, lath, splinter), Rathbone suggested that the schidai were fragments of elephant tusks and thus distinct from the sound ivory (u1f10u03bbu03adu03c6u03b1u03c2 u1f51u03b3u03b9u03aeu03c2) mentioned at col. ii, l. 4 of the same text, which were entire tusks.16 Rathbone buttressed his interpretation observing 1) that the u03bcu1f73u03bd at col. ii, l. 4 and a u03b4u1f73 to be read at col. ii, l. 1617 structured the phrase so as to contrast the sound ivory and the schidai;18 and 2) that the value of the unspecified ivory (u1f10u03bbu03adu03c6u03b1u03c2), lost with the lacuna at col. ii, l. 26, must have merged the value of the sound ivory with that of the schidai. To me, Rathbones argument seems decisive on this point: if schidai were not ivory, the u03bcu1f73u03bd at col. ii, l. 4, would be a strange u03bcu1f73u03bd solitarium; and if schidai were not ivory, then we could not explainu2014except as a clerical erroru2014why the clerk records again the value of an unspecified ivory, after having already calculated the value of the schidai.Reasonable as it seemed at the time, the interpretation of the first editors does not accord as well with the context as does Rathbones reading.#p7Fragments or imperfect tusks? That said, the sense of the contrast between sound ivory and schidai still remains to be properly understood.The difference of price between sound ivory (100 drachmae per mina) and schidai (70 drachmae per mina) makes it clear that schidai were ivory of secondary quality.However, was their quality secondary because they were accidental fragments rather than sawn pieces of ivory, as Rathbone assumed? The question is far from trifling, not least because it is pivotal for determining the nature of the arabarchs share.#p8According to Rathbone, the evaluation preserved in the papyrus concerns only three-quarters of the Hermapollons cargo because one-quarter of the commodities would have been removed to pay the quarter-tax in kind.Consistently, the rationale of the share taken in addition by the arabarchs for the quarter-tax is seen as a way to simplify the practical division of sound ivory and schidai, two commodities from which an exact weight was not easy to extract.19 In other words, since it was impossible for the arabarchs to take exactly 25% of the ivory weights without sawing the tusks or the fragments (and thereby damaging the commodity), they took a little more than 25%: 11.75 minae (around 6 kgs), in the case of sound ivory; as much as 22.75 minae (around 11.6 kgs), in the case of the schidai.#p9The contradiction inherent in Rathbones argument was understood by Morelli, who follows Rathbone in assuming that the quarter-tax was paid in kind and that the function of the shares taken in addition by the arabarchs was to ease the payment in kind of the quarter-tax of commodities such as ivory tusks and schidai.20 Precisely for that reason, however, Morelli is reluctant to accept Rathbones conclusion that schidai were accidental fragments of tusks. His implicit reasoning is clear: if the 22.75 minae (= 11.6 kgs) taken in addition by the arabarchs are only a fraction of the weight of the smallest schida of the lot, the Greek term cannot refer to tusk fragments, but must refer rather to entire tusks that were imperfect in some wayu2014spoiled or cracked or only slightly broken.In other words, the schidai were in fact whole tusks, but not sound.21#p10There is very little doubt that the entry of sound ivory (u1f10u03bbu03adu03c6u03b1u03c2 u1f51u03b3u03b9u03aeu03c2) refers to entire tusks: at col. ii, ll. 12 and 13 the same commodity is mentioned as u1f40u03b4u03ccu03bdu03c4u03b5u03c2, teeth, and at col. i, l. 5 the figure 167 must be precisely the number of the tusks, as Morelli recognized.22 It is equally unquestionable that the adjective sound (u1f51u03b3u03b9u03aeu03c2) implies an assessment of the quality of the tusks, determining which tusk is sound and which is not.23 Nonetheless, the assumption that just two terms, sound ivory and schidai, could cover the entire spectrum of possible ivory classifications is unwarranted, and the fact that in this document sound ivory and schidai are opposed to each other does not guarantee that any tusk deemed not sound is by default a schida, or that a schida, as such, cannot be sound. In my view, the undeniable connection of u03c3u03c7u03afu03b4u03b1 with the verb u03c3u03c7u03afu03b6u03c9 (split, divide, cut out, tear) and the parallelism with u03c3u03c7u03afu03b6u03b1 and u03c3u03c7u03afu03b4u03b1u03be (piece of wood cut off) strongly favor Rathbones translation as fragments.24 The fact that the arabarchs took in addition as much as 22.75 minae should not bias our understanding of the Greek term. Nor should we assume that those fragments were necessarily unsound or accidental.Indeed, many of them were made on purpose and taken from perfectly sound tusks.#p11The schidai of the Muziris papyrus can hardly be identified with what elsewhere is called u03c0u03b5u03c1u03b9u03c0u03c1u03afu03c3u03bcu03b1u03c4u03b1 or u03c0u03b1u03c1u03b1u03c0u03c1u03afu03c3u03bcu03b1u03c4u03b1,25 namely, waste from the ivory carvers shops: the difference between the price of the tusks (100 drachmae per mina) and that of the schidai (70 drachmae per mina) is too small to address the gap in value between entire tusks and small scraps.26#p12In order to justify his translation of the term schidai, Rathbone recalled a passage by Pliny the Elder, in which the elephants are said to deliberately break their tusks in order to escape from hunters: u2018They themselves [sc. the elephants] know that the only thing in them that makes desirable plunder is in their weapons [u2026] and when surrounded by a party of hunters they post those with the smallest tusks in front, so that it may be thought not worth while to fight them, and afterwards when exhausted they break their tusks by dashing them against a tree, and ransom themselves at the price of the desired booty (transl. by Rackham).27#p13This passage requires two clarifications. The first is that it is part of a section comprising several other mirabilia testifying to the quasi-human affective and cognitive capacities of the elephant28u2014a rather popular topic in Western classical literature.29 The second is that it attributes to elephants a tactic comparable to that ascribed to beavers, when they are chased down by hunters.Just like elephants, beavers u2018ransom themselves with that part of their body on account of which they are chiefly sought for.30 Whatever the truth behind it, we do not need to rely on this tale to explain the ivory fragments exported from Muziris. As a matter of fact, another more prosaic explanation is at hand. I propose, in fact, to identify the schidai as those fragments that are regularly trimmed from the tusks of captive elephants.#p14Tusk trimming is a standard practice in Kerala today,31 but it was also common in ancient India, as is shown in some Sanskrit classical texts.Regular trimming of elephant tusks is mentioned in the Arthau015bu0101stra, in the lines that end the section dedicated to the duties of the hastyadhyaku1e63a, the superintendent of the elephants:#p15danta-mu016bla-paru012bu1e47u0101ha-dvi-guu1e47au1e43 projjhya kalpayet /abde dvy-ardhe nadu012b-ju0101nu0101u1e43 pau00f1ca-abde parvata-okasu0101m//Leaving the double length of the circumference of the tusk at the root, he should cut [sc. the rest], every two years and a half in the case of those [sc. elephants] from river-banks, every five years in the case of those from mountainous regions.32Approximately the same rules are mentioned in Varu0101hamihiras Bu1e5bhat Sau1e43hitu0101:#p16dantasya mu016blaparidhiu1e43 dviru0101yatau1e43 prohya kalpayeccheu1e63am/ adhikamanu016bpacaru0101u1e47u0101u1e43 nyu016bnau1e43 giricu0101riu1e47u0101u1e43 kiu00f1cit//Having left the double length of the circumference of the tooth at its root, cut the rest; more (often) in those elephants that live in the humid places, a little less often in those that live in the mountain.33If we turn to Greek authors, the sawing of Indian elephant tusks is also referenced, although only as a practice limited to the few war elephants with unusually big tusk. the Indian elephants are not provided with large tusks, but should they have such, they saw them off, that their weight may not encumber them in war.34The practice of leaving u2018the double length of the circumference of the tooth at its roots addresses the need to avoid cutting into the living pulp of the tusk.35 The fact that elephants living in the mountains may get their tusks trimmed less often than those living by the riverbanks has been taken as a proof of a slower growth rate of tusks of the mountain elephants.36Schidai and the arabarchs share If the above interpretation of the term u03c3u03c7u03afu03b4u03b1 is correct, then there are consequences to be drawn related to the fiscal procedures implied in the Muziris papyrus. If the schidai mentioned in the text do refer to the remnants of ivory regularly trimmed away from tusks either every two and a half or every five years, then it follows that a schida normally weighed much less than an entire tusk, since the trimming has to leave u2018the double length of the circumference of the tooth at its roots. Therefore, the 22.75 minae (around 11.6 kgs) of schidai taken in addition by the arabarchs, far from being only a fraction of a schida, will equal several schidai. In conclusion, whatever was taken in addition was not randomly seized because it was impossible to do otherwise, but must have been rationally determined and deliberately taken. As a matter of fact, it seems that the shares of sound ivory and schidai taken by the arabarchs were arithmetically defined.The quota of sound ivory (11.75 minae) results from charging 1 mina for every 10 weight talents (1/600, u1f11u03beu03b1u03bau03bfu03c3u03b9u03bfu03c3u03c4u03ae) of the total amount (105 weight talents and 13 minae, rounded up to 110 weight talents), plus the fraction of mina of the three-quarters (.75). Similarly, the quota of the u03c3u03c7u03afu03b4u03b1u03b9 (22.75 minae) results from charging 120 drachmae for every weight talent (1/50, u03c0u03b5u03bdu03c4u03b7u03bau03bfu03c3u03c4u03ae) of the total amount (17 weight talents and 33 minae, rounded up to 18 weight talents, which makes 21.6 minae, rounded up to 22), plus the fraction of mina of the three-quarters (.75).If this explanation is correct, it follows that the share taken in addition by the arabarchs was nothing but a surcharge. Therefore, either the tax collector was able to levy in kind a quarter-tax plus surcharge based on weight and arithmetically determinedu2014no matter the commodityu2014or else the calculations of the Muziris papyrus verso imply a payment of the total dues in the form of money.Ivory and pepper values As mentioned, in the Muziris papyrus the schidai have a lower value (70 drachmae per mina) than the entire tusks of sound ivory (100 drachmae per mina).37 Both schidai and complete tusks in turn have values considerably higher than pepper.38 The contrast with the Price Edict, in which ivory and pepper have maximum prices of 150 and 800 denarii respectively,39 is evident. Since the values assumed by the Muziris papyrus and the maximum prices fixed by the Price Edict are meant to remain unaffected by the short-term supply-and-demand dynamics in any particular place in the Roman empire, the overturning of the hierarchy between the values of these two commodities was not due to episodic reasons.Indeed, such a radical change is likely to have been the result of complex factors that cannot be fully explored here. Nonetheless, it may be worth pointing out that the low valuation of pepper in the Muziris papyrus is also dependent on the direct voyages to South India of ships like the Hermapollon.The cessation of that relatively economical pattern of trade must have contributed to the higher prices of pepper in late antiquity.40 The contrasting dynamics of ivory values may in part be illuminated by Plinys claim that in his time India, where only some of the male elephants have tusks,41 was the major supplier of ivory.42 If Pliny is to be trusted, then neither the excellent Adulis ivory nor the abundant, if inferior, Rhapta ivory,43 nor any other East African ivory,44 were major Mediterranean imports in the mid-first century CE. The potential of the African continent, where both male and female elephants have tusks, was thus only marginally exploited.By late antiquity, however, the volume of African ivory exported had likely substantially increased,45 as suggested by the emphasis in the Expositio totius mundi et gentium on the countless number of elephants of India minor (=East Africa)46 and, less ambiguously, Cosmas Indicopleustes remarks about the population of Aithiopias elephants and the scope of the export of their ivory.47 One final observation may be made on this subject: Cosmas Indicopleustes also noted that the African elephants had bigger tusks than the Indian elephants.48 He was probably referring to African savanna elephants (Loxodonta Africana Africana), which tend to develop longer and thicker tusks than either the Asian elephant (Elephas maximus) or the even smaller African forest elephant (Loxodonta Africana cyclotis).49 It has to be emphasized, though, that Cosmas information cannot be taken as an indication that, in the first centuries of the Christian era, the traded African ivory comprised tusks that were on average bigger than those of the traded Asian ivory. Aside from the varying growth potential of different species, the average weight of the traded tusks would have depended on the selection strategies of hunters and merchants; hence the average weight per tusk of commercial lots of Asian ivory could have been higher than that of some African commercial lots.Therefore, it is not impossibleu2014indeed, it is arguable, as we shall seeu2014that the maximum price for ivory in the Price Edict was also influenced by the import of large quantities of African tusks of rather low average weight. Schidai and royal elephants While several of the commodities imported by the Roman ships from the Limyrike emporia were not home products of Malabar,50 the ivory exported by the Hermapollon, both the entire tusks and the trimmings, was most probably a regional product.The availability of ivory at Muziris was facilitated by the fact that the Cu0113ra kings who controlled Muziris also controlled inland forests rich in wild elephants; it is not coincidental that Cu0113ra coinsu2014also found at the site of Pattanam, most likely included in the Muziris area51u2014bear an elephant on their obverse. coinscoins Figure 9. Cu0113ra coins from Pattanam (Courtesy Cherian) The abundance of elephants in the Cu0113ra forests was the inspiration for the simile the poet Kunrukatu0323pu0101liyu0101tanu0101r employed to address the Cu0113ra king Cu0113ramu0101n Karuvu016bru0113riya Olu0323vu0101tu0323ku014dp Peruu00f1cu0113ral Irumporai: erumai au1e49u1e49a karuu1e45kal iu1e6dai tu014du1e5fu,u2223 u0101u1e49iu1e5f parakkum yu0101u1e49aiya, muu1e49piu1e49,u2223ku0101u1e49aka nu0101u1e6dau1e49ai Are you the king of the forests where elephants spread to graze like cows amidst buffalo-like rocks?52 The conspicuous presence of elephants in the Muziris region is also reflected in the Peutinger Table, which has the caption u2018in this place elephants are born,53 near what could be the Western Ghats (Mons Lymodus). Figure 10.Tabula Peutingeriana portion of Seg. XI as reproduced by Miller in 1887/8.In ancient India, captive male elephants with big tusks54 are a prerogative of the highest political authorities, and essential to their military strength.According to Megasthenes, only the king has the right to own horses and elephants,55 and in the Arthau015bu0101stras words the u2018kings victory is mainly a matter of elephants.56 In the theory laid down by the Tolku0101ppiyam, the possession of war elephants57 is a distinctive feature of the aracar.58 It is likely that the term, a Tamilization of Skt. ru0101jan-,59 is meant to be inclusive of both vu0113ntar, kings of the highest rank, and vu0113lu0323ir, somewhat high dignitaries or more or less dependent chieftains.60 At any rate, in Cau1e45kam literature many vu0113lu0323ir are said to have (or to donate) captive elephants.61 On the other hand, it is reasonable to assume that the regional pre-eminence of the mu016bvu0113ntaru2014the three major powers of the Cu0113rar, Pu0101nu0323tu0323iyar, and Colaru2014was backed by the ownership of a higher number of war elephants. It will suffice here to quote a few lines in praise of the Cu0113ra king Celvakkau1e6duu1e45ku014dv u0100u1e3biyu0101tau1e49: You free the poets from poverty with the tribute that you receive from the inimical mau1e49u1e49ar!62 The many male elephants perfect in action, who with their large rugged trunks and lifting tusks were stationed near the guarded forest of the vu0113ntu (kingdom of a vu0113ntan, a u2018king of the highest rank), with their big necks with flower-like spots and fragrant cheeks smeared with dust, they moved dispersed here and there and destroyed the ramparts of the enemy.63 The 538.5 kgs of schidai shipped out by the Hermapollon were trimmings taken from captive elephants. As the tusks had to be trimmed leaving u2018the double length of the circumference of the tusk at the root, a schida could hardly weigh more than one-third of an entire tusk.More precisely, since the tusks of the captive elephants had to be trimmed every two and a half or every five years, the average weight of the schidai imported by the Hermapollon should have been between 1 and 7 kgs.64 An export of 538.5 kgs of schidai, which must have numbered between 75 and 540 pieces,65 could hardly have been achieved without the contribution of the trimmings from the large elephant contingent of the Cu0113ra king, who controlled both the most famous of the Limyrike emporia and the forests where wild elephants abounded. If the quantity exported by the Hermapollon did not represent an exceptional peak, but was the routine annual export from Muziris or even less than that, then the Muziris export of schidai had to be sustained by a population of at least 380 captive adult male elephants.66 This number is not far from the 500 or 600 elephants that Cosmas Indicopleustes attributes to several kings of the west coast of Indiau2014among them, the king of Male.67 Tusks, hunters and bandits Aside from the tusks acquired from elephants that died in captivity, those exported from Muziris were largely from wild tuskers, killed by forest dwellers for their meat and their ivory: The hunter from the forest with mighty hands like iron, concealed behind a blooming Maru0101am tree, shoots choicest arrows, at the mighty chest of a tusker of speckled forehead, and plucks out the white tusks that with might destroy the foes; he plants them, in his hut thatched with grass [u2026] The man from the mountain eats meat cooked on the flame of sandalwood, partying with relations, taking pleasure from toddy (transl. Dhakshinamurthy, with modifications).68 Cau1e45kam literature offers references to ivory trade undertaken by elephant hunters who are said to make their living by selling tusks.Quite interestingly, some of them are located in the western part of the Kolli hills, where u014cri, a minor chieftain to some extent dependent upon the Cu0113ra kings,69 rules: [u2026]the western [side of] mount Kolli,/ [belonging to] u014cri with strong bow,/ where [people] eat by selling the tooth of the swift-eyed elephant/ when they are hungry in small homes (transl. Wilden).70 Another poem from Cau1e45kam literature records a chief of Ilu0323aiyar,71 who keeps an elephant tusk in his home.Left with no money because his robbery business is stagnant, he trades his white tusk to satisfy his desire for alcohol. [u2026]the chief of the strong bow and lawless life Ilu0323aiyar, who rob the trading caravan that moves along roads lined by dry bamboo, when he is exhausted by the sun, he visits the house of broad shouldered women with tattoos on their bellies where the toddy is sold. Unable to pay for it, he pats the small head of the running son and points out the white tusk of the forest elephant in musth [u2026].72 The twofold activity of the Ilu0323aiyaru2014bandits at the expense of the travelling traders, as well as hunters of wild elephants in the forestsu2014puts them on or beyond the fringe of the Cu0113ra kings control and protection.Nonetheless, they too fuelled Muziris trade.Tusk comparisons The tusks imported by the Hermapollon must have been carefully selected. They were not only sound, as attested by the text, they were also rather large, as their average weight shows.At col. ii, l. 13, Morelli rightly rejects the editors reading u03bau03b1u1f76 u03c4u03b5u03c4u03b1u03c1u03c4u03bfu03bbu03bfu03b3u03bfu03c5u03bcu03adu03bdu03c9u03bd.Calling for a comparison with the 2,000 three-cubit-long tusks paraded by Aemilius Paulus in his triumph of 167 BCE,73 he ingeniously reads u03b4u03b9u03c0u1f75u0323u03c7u0323u03b5u0323u03c9u0323u03bdu0323 u1f45u0323u03bbu03c9u03bd, entire, two-cubit-long tusks.Apart from the ending -u03bbu03c9u03bd, I can neither confirm Morellis reading nor suggest any alternative. I can however emphasize that the total weight of the tusks imported by the Hermapollon shows by itself that those 167 tusks were a selected lot, just as the reading u03b4u03b9u03c0u1f75u0323u03c7u0323u03b5u0323u03c9u0323u03bdu0323 u1f45u0323u03bbu03c9u03bd would imply. As a matter of fact, 167 tusks weighing 105 talents and 13 minae (= 3,228.5 kgs) have a rather high average weight of 37.8 minae (= 19.332 kgs) per tusk.74 It is not that great a stretch from the average weight of the two tusks sold to Apollos temple in Delos by Herakleides of Tyre (46.3125 minae per tusk)75 or the thirty-four tusks donated by Ptolemy Auletes to the temple of Didyma (42.94 minae per tusk),76 especially since the talent(s) implied by these inscriptions must have been lighter than the one used by the quarter-tax administration to weigh the Hermapollons cargo.77 However, those few tusks bought by or donated to a temple were likely of exceptional quality. A commercial lot such as the Hermapollon cargo is thus more appropriately compared with other commercial lots. Following this perspective, documents from the early sixteenth century may provide more useful evidence: In 1506, Pero Ferreira Fogau00e7a, capitu00e3o of Kilwa takes notice of a zambuco carrying 570 tusks weighing 92 quintaes, 2 arrobas, 31 arrates (= 5,448.95 kgs): the average weight is 9.56 kgs per tusk.78 January 18th 1507, Nuno Vaz Pereira, capitu00e3o of Sofala, orders delivery of 264 tusks and two pieces weighing 73 quintaes, 1 arroba, 20 arates (= 4,312.39 kgs): counting the two pieces as tusks, the average weight is 16.21 kgs per tusk.79 December 20th 1514, u00c1lvaro de Bouro reports a sale of an ivory stock in Lisbon.80 The document details not only the number of tusks and their total weight, but also the number of tusks contained in each of the thirteen lots of 6 quintaes (= 352.512 kgs), plus one lot of 4 quintaes and 24 arrateis (= 246.024 kgs) in which the stock has been divided and sold. Since the total weight of the 385 tusks was 82 quintaes and 24 arrateis (= 4,828.68 kgs), the average weight per tusk was 12.542 kgs.However, the different lots have very different average weights: they range from 20.736 kgs to 4.641 kgs per tusk.Table 1.Average weight per tusk of the lot DPMAC III, n.104 WeighttTuskstAverage weight 6 quintaes ( = 352.512 kgs)t17t20.736 kgs 6 quintaes ( = 352.512 kgs)t17t20.736 kgs 6 quintaes ( = 352.512 kgs)t19t18.553 kgs 6 quintaes ( = 352.512 kgs)t20t17.625 kgs 6 quintaes ( = 352.512 kgs)t21t16.786 kgs 6 quintaes ( = 352.512 kgs)t22t16.023 kgs 6 quintaes ( = 352.512 kgs)t22t16.023 kgs 6 quintaes ( = 352.512 kgs)t22t16.023 kgs 6 quintaes ( = 352.512 kgs)t26t13.558 kgs 6 quintaes ( = 352.512 kgs)t26t13.558 kgs 6 quintaes ( = 352.512 kgs)t28t12.589 kgs 6 quintaes ( = 352.512 kgs)t38t9.276 kgs 6 quintaes ( = 352.512 kgs)t54t6.528 kgs 4 quintaes 24 arrateis ( = 246.024 kgs)t53t4.641 kgs Totalt 82 quintaes 24 arrateis (= 4,828.68 kgs)t385t12.542 kgs February 13th 1515, Francesco Corbinelli, feitor in Goa, acknowledges receipt of 193 big and small tusks weighing 39 quintaes and 3 arrobas (= 2,335.39 kgs) from Lourenu00e7o Moreno, feitor in Cochin: the average weight is 12.1 kgs per tusk.81 August 27th 1517, Pero Coresma, appointed feitor of Cochin, acknowledges receipt in Sofala of 233 big and small tusks weighing 61 quyntaes, 3 arrobas, 28 arrateis (= 3,640.788 kgs): the average weight is 15.62 kgs per tusk. 82 May 25th 1518, Pedro Jacome dies in Sofala leaving eight dentes weighing duas arrobas menos quatros arrates (= 27 kgs): the average weight is 3.37 kgs.83 July 15th 1518, Joham Afonso da Cunha allcaide mor and feitor of Mozambique receives 349 big and small tusks weighing 92 quintaes (= 5,405.18 kgs): the average weight is 15.48 kgs.84 Figure 11.Average weights per tusk of seven sixteenth century lots and Hermapollons cargo (in kgs) With the possible exception of the ivory sent to Goa by Lourenu00e7o Moreno in 1515,85 all of these ivory lots are of certain African origin. It is therefore clear that the distinction made between big and small tusks in some of these documents cannot correspond with the contrast between tusks and schidai, which characterizes the Hermapollon cargo, if the schidai are, as I suggest, captive elephant tusk trimmings.In his Informau00e7u00e3o para el-rei written from Goa in 1530, Jordu00e3o de Freitas distinguishes between three types of ivory: 1) the good, big, sound, and clean one (bom grande su00e3o e linpo), whose value in Sofala was between thirty and forty maticais per bahar; 2) the small one (pequeno), whose tusks weigh between one and one-half farau00e7ola (= between 11.75 and 5.87 kgs) each, and whose value was half the price of the first type; 3) the even smaller one (mays meyudo), whose value in Sofala was ten to twelve maticais.86 The small size of the second and third types in de Freitas categorization and the low average weight of the listed African ivory lots can hardly be explained by just assuming that all of those tusks belonged to forest elephants (Loxodonta Africana cyclotis). Such an assumption would be inconsistent with the present geographical distribution of that species, and it would still require one to emphasize the inattention to tusk size during the elephant hunts, since tusks lighter than 5.87 kgs must have belonged to very young animals, no matter the species.Apparently, African hunters were only marginally motivated by ivory traders or influenced by the different commercial values assigned to tusks of different size. The low average weight of those lotsu2014all the more remarkable since the tusks must have belonged mainly to savanna elephantsu2014shows that in Africa elephants must have been killed for reasons other than the ivory trade.The ivory of the Elephant-eaters The relatively low average weight of the sixteenth-century African tusks87 suggests a clue for interpreting a remark by the author of the Periplus Maris Erythraei about the ivory exported from Rhapta. In this very last emporium of Azania, a great amount of ivory is said to be available.Its quality, however, was held to be inferior to that exported from the much closer Adulis.88 The composition of the sixteenth-century ivory lots from Sofala suggests that the Rhapta export was inferior to the Adulis one, not because it was from a different species or because their tusks were always less sound than the Adulis ones, but because it resulted from a different kind of trade and perhaps a differently motivated hunt. The fine Adulis ivory came from faraway regions beyond the Nile, it was conveyed to Axum, then to Koloe and finally to Adulis.89 On its way to the Red Sea, the ivory was traded by foreign merchants, who wanted to be paid in Roman money;90 it was shipped to Egypt by merchants from Roman Egypt.Such a commercial circuit necessarily required a deliberate selection of tusks based on their quality, which had to be of the Adulis standard.91 Figure 12. Availability of ivory according to the Periplus Maris Erythraei (small circles u2018little ivory, medium circles u2018ivory, big circle u2018great amount of ivory).Base map courtesy Ancient World Mapping Center and published under Creative Commons Attribution-Non Commercial license.In contrast, the Rhapta trade had a completely different style.Ivory was imported by small Muza ships, manned by crews linked by intermarriages with the Rhapta people.92 Together with spears, axes, knives, awls, and glass stones, they would bring large quantities of grain and wine to be used in nearby places u2018not for trade, but because of extravagance, for the entertainment of the barbarians.93 It is therefore likely that the Rhapta ivory was inferior to the Adulis ivory, because it included considerable quantities of pequeno and mays miudo marfimu2014small and even smaller tusks. Once it arrived at Muza, the inferior but plentiful ivory from Rhapta was most likely sent to Barygaza,94 just as in the sixteenth century enormous amounts of ivoryu2014Garcia da Orta quantifies them in 6,000 quintais (more than 350 tons) per year95u2014were sent to India from the East Africa coast between Sofala and Malindi.As mentioned above, the very small tusks included in the ivory lots show that African elephants were not killed for their ivory alone. The Greek perception of the particular human-elephant relationship in East Africa is reflected in the term Elephantophagoi96 (Elephant-eaters), elaborated when the exploration of the African world south of Egypt inspired an ethnological taxonomy based on dietary habits.Along the lines of the much older Ichthyophagoi and of the new entry Chelonophagoi (re)discovered in Carmania by Alexanders army,97 Rhizophagoi, Hylophagoi, Spermatophagoi, Akridophagoi, Struthophagoi, Agriophagoi, Moschophagoi, and Elephantophagoi were identified. Greek ethnographic accounts ignored the fact that elephant meat was to some extent eaten in ancient South India as well.Moreover, the Greek writings did not take into account the idea that African societies may have killed elephants not only for their meat but also to prevent them from crop raiding: in their opinion, fondness for elephant meat was the key factor.In a story repeated by Agatharchides, the Elephantophagoi refused to stop killing elephants and eating their meat despite Ptolemys urging and the promise of splendid rewards.98 They replied that they would not change their way of life, not even for all the kingdom of Egypt. The task of providing the Ptolemaic army with an Indian-style elephant division99 thus had to accommodate the cultural traditions of Africa.The story may be fictional, but the perception that in Africa the human-elephant relations were different from India was accurate: the contrast between the African ivory carried by the Portuguese ships and the Indian ivory shipped out by the Hermapollon supports this distinction. The extant portion of the verso side of the Muziris papyrus (PVindob G 40822 v = SB XVIII 13617 v) contains the monetary evaluation of three-quarters of an Indian cargo loaded on the ship Hermapollon.Among the commodities are 167 elephant tusks weighing 3,228.5 kgs and schidai weighing 538.5 kgs.It is argued that schidai are fragments of tusks trimmed away from captive elephants. A comparison with commercial ivory lots of the early sixteenth century shows the selected quality of the tusks loaded on the Hermapollon.#abstractSubjects: India--Relations--Rome, Ivory industry, Economic history--to 500. IntroductionThe texts on the Papyrus Vindobonensis G 40822,1 now widely known as the Muziris papyrus, will be remembered as among the most significant pieces of evidence related to Indo-Roman trade published in the twentieth century, and the more we understand them, the more important they become.The extant portion of the text on the verso contains the monetary evaluation of three-quarters of the South Indian cargo loaded on the ship Hermapollon (probably at Muziris, mentioned in the text on the recto), and two recent papers, one by Federico Morelli and the other by me, have proposed an almost complete reconstruction of the evaluated commodities. Both papers emphasized, albeit in very different measures, the predominant share of pepper and malabathron in the cargo, the two main exports from the Limyrike emporia.2 Both Morelli and I came to recognize that the 771 money talents and 4,632 drachmae recorded at col. i, ll. 25-263 are the value of (almost) three-quarters of the pepper cargo, but while Morelli suggests that that value resulted from a price of 24 drachmae per mina, I contend that a price of 6 drachmae per mina is the only price that can account for the position of other numerical values in the text. Moreover, both Morelli and I interpret the weight number at col. i, l. 18 as the weight of three-quarters of the malabathron cargo, but while he reads the first two digits as 1,200 and assumes a price of 20 drachmae per mina, I read them as 1,800 and deduce a price of 12 drachmae per mina.Finally, I assume that the Hermapollons cargo included another commodity, evaluated at col. i, ll. 14-16, which might have been tortoise shell. In this paper I would like to focus on two other commodities exported on the Hermapollon: the sound ivory tusks and the schidai.As the meaning of the Greek term schidai in the papyrus is disputed, it makes better sense to analyze the two commodities in reverse order of their appearance in the document.Therefore, we shall start with the schidai and later consider the sound ivory.#p1Schidai, ivory of lower value. As we shall see, schidai represent less than 1% of the entire value of the Hermapollons cargo, and their weight was little more than half a ton.Yet a correct understanding of this entry will have a significant impact on the general interpretation of the text, and may shed some light both on the Cu0113ra kingdom to which the ancient Muziris belonged and on the ivory trade on the ancient Indian Ocean.#p2In the papyrological documents, the Greek term u03c3u03c7u03afu03b4u03b1u03b9 (schidai) occurs only on the verso of the Muziris papyrus col. ii, ll. 16 and 25. In that portion of the textu2014col. ii, ll. 16-25u2014the value of three-quarters of the schidai brought back by the Hermapollon is calculated.The evaluation follows the complex pattern by which the three-quarters of sound ivory is assessed at col. ii, ll. 4-15.From the weight number representing the three-quarters (13 weight talents and 9.75 minae), a small parcel (22.75 minae), which is said to be taken in addition by the arabarchs4 for the tetartologia, is removed. The rest (12 weight talents and 47 minae) is converted twice, first into Roman pounds at the ratio of 1 Egyptian talent to 95 Roman pounds, and then back into Egyptian talents at the ratio of 97.5 Roman pounds : 1 Egyptian talent.The resulting weight number (12 weight talents and 27 minae), at the price of 70 drachmae per mina, leads to a value of 8 money talents and 4,290 drachmae.Then the 22.75 minae that had been taken in addition by the arabarchs for the tetartologia are multiplied for the same price of 70 drachmae per mina: the result is 1,592.5 drachmae. By adding the two subtotals, a value of 8 money talents and 5,882.5 drachmae is obtained.#p3As Rathbone first understood and Morelli now confirms, 13 weight talents and 9.75 minae are just three-quarters of the schidai exported on the Hermapollon.The entire quantity was the weight number recorded at col. i, l. 10, that is, 17 weight talents and 33 minae, from which one quarter (4 weight talents and 23.25 minae) was removed.#p4Since the talent referred to here is equivalent to 95 Roman pounds, the schidai weighed around 538.5 kgs. But what exactly is a schida?Drawing on Hesychius entry <u03c3u03c7u03afu03b4u03b1>u0387 u03c3u03c7u03afu03b4u03bfu03c2 u03c3u03b9u03bdu03b4u03ccu03bdu03bfu03c2, u03c0u1fc6u03b3u03bcu03b1 (schida: division of a garment, fabric),5 Harrauer and Sijpesteijn, the first editors of the papyrus, understood the term as referring to a detached piece of a larger whole u03c3u03b9u03bdu03b4u03ceu03bd, a bale of cloth.6 Although neither u03c3u03c7u03afu03b4u03b1u03b9 nor u03c3u03b9u03bdu03b4u03ccu03bdu03b5u03c2 (cloths, garments) are mentioned in the Periplus Maris Erythraei as Limyrike commodities,7 Harrauer and Sijpesteijn pointed out that the Periplus Maris Erythraei does mention u03c3u03b9u03bdu03b4u03ccu03bdu03b5u03c2 among the exports from the Ganges emporion,8 and that Gangetic nard, another typical Ganges commodity9 imported by the Hermapollon,10 also appears among the commodities available in the Limyrike emporia.11 The implicit suggestion was that both Gangetic nard and excellent Gangetic garments were exported from the Ganges emporion to Muziris and from there re-exported to Egypt.#p5Harrauer and Sijpesteijn considered the possibility that in Vindob. G 40822 verso col. ii, ll. 16; 25 u03c3u03c7u03b9u03b4u1ff6u03bd could be a misspelling for u03c3u03c7u03b9u03b6u1ff6u03bd,12 but they rejected the idea that it could have meant Holzscheit.13 They also rejected a connection with Hesychius lemma u03c3u03c7u03afu03b4u03b9u03b1u0387 u1f60u03bcu03ccu03bbu03b9u03bdu03b1, on the grounds that raw Flax (u1f60u03bcu03ccu03bbu03b9u03bdu03b1), a typical Egyptian product, is unlikely to appear among the imports from India.14#p6The interpretations of Harrauer and Sijpesteijn, basically accepted or unquestioned by subsequent scholars,15 were challenged by Rathbone. Considering u03c3u03c7u03afu03b4u03b1 as only a variant of u03c3u03c7u03afu03b6u03b1 (piece of wood cut off, lath, splinter), Rathbone suggested that the schidai were fragments of elephant tusks and thus distinct from the sound ivory (u1f10u03bbu03adu03c6u03b1u03c2 u1f51u03b3u03b9u03aeu03c2) mentioned at col. ii, l. 4 of the same text, which were entire tusks.16 Rathbone buttressed his interpretation observing 1) that the u03bcu1f73u03bd at col. ii, l. 4 and a u03b4u1f73 to be read at col. ii, l. 1617 structured the phrase so as to contrast the sound ivory and the schidai;18 and 2) that the value of the unspecified ivory (u1f10u03bbu03adu03c6u03b1u03c2), lost with the lacuna at col. ii, l. 26, must have merged the value of the sound ivory with that of the schidai. To me, Rathbones argument seems decisive on this point: if schidai were not ivory, the u03bcu1f73u03bd at col. ii, l. 4, would be a strange u03bcu1f73u03bd solitarium; and if schidai were not ivory, then we could not explainu2014except as a clerical erroru2014why the clerk records again the value of an unspecified ivory, after having already calculated the value of the schidai.Reasonable as it seemed at the time, the interpretation of the first editors does not accord as well with the context as does Rathbones reading.#p7Fragments or imperfect tusks? That said, the sense of the contrast between sound ivory and schidai still remains to be properly understood.The difference of price between sound ivory (100 drachmae per mina) and schidai (70 drachmae per mina) makes it clear that schidai were ivory of secondary quality.However, was their quality secondary because they were accidental fragments rather than sawn pieces of ivory, as Rathbone assumed? The question is far from trifling, not least because it is pivotal for determining the nature of the arabarchs share.#p8According to Rathbone, the evaluation preserved in the papyrus concerns only three-quarters of the Hermapollons cargo because one-quarter of the commodities would have been removed to pay the quarter-tax in kind.Consistently, the rationale of the share taken in addition by the arabarchs for the quarter-tax is seen as a way to simplify the practical division of sound ivory and schidai, two commodities from which an exact weight was not easy to extract.19 In other words, since it was impossible for the arabarchs to take exactly 25% of the ivory weights without sawing the tusks or the fragments (and thereby damaging the commodity), they took a little more than 25%: 11.75 minae (around 6 kgs), in the case of sound ivory; as much as 22.75 minae (around 11.6 kgs), in the case of the schidai.#p9The contradiction inherent in Rathbones argument was understood by Morelli, who follows Rathbone in assuming that the quarter-tax was paid in kind and that the function of the shares taken in addition by the arabarchs was to ease the payment in kind of the quarter-tax of commodities such as ivory tusks and schidai.20 Precisely for that reason, however, Morelli is reluctant to accept Rathbones conclusion that schidai were accidental fragments of tusks. His implicit reasoning is clear: if the 22.75 minae (= 11.6 kgs) taken in addition by the arabarchs are only a fraction of the weight of the smallest schida of the lot, the Greek term cannot refer to tusk fragments, but must refer rather to entire tusks that were imperfect in some wayu2014spoiled or cracked or only slightly broken.In other words, the schidai were in fact whole tusks, but not sound.21#p10There is very little doubt that the entry of sound ivory (u1f10u03bbu03adu03c6u03b1u03c2 u1f51u03b3u03b9u03aeu03c2) refers to entire tusks: at col. ii, ll. 12 and 13 the same commodity is mentioned as u1f40u03b4u03ccu03bdu03c4u03b5u03c2, teeth, and at col. i, l. 5 the figure 167 must be precisely the number of the tusks, as Morelli recognized.22 It is equally unquestionable that the adjective sound (u1f51u03b3u03b9u03aeu03c2) implies an assessment of the quality of the tusks, determining which tusk is sound and which is not.23 Nonetheless, the assumption that just two terms, sound ivory and schidai, could cover the entire spectrum of possible ivory classifications is unwarranted, and the fact that in this document sound ivory and schidai are opposed to each other does not guarantee that any tusk deemed not sound is by default a schida, or that a schida, as such, cannot be sound. In my view, the undeniable connection of u03c3u03c7u03afu03b4u03b1 with the verb u03c3u03c7u03afu03b6u03c9 (split, divide, cut out, tear) and the parallelism with u03c3u03c7u03afu03b6u03b1 and u03c3u03c7u03afu03b4u03b1u03be (piece of wood cut off) strongly favor Rathbones translation as fragments.24 The fact that the arabarchs took in addition as much as 22.75 minae should not bias our understanding of the Greek term. Nor should we assume that those fragments were necessarily unsound or accidental.Indeed, many of them were made on purpose and taken from perfectly sound tusks.#p11The schidai of the Muziris papyrus can hardly be identified with what elsewhere is called u03c0u03b5u03c1u03b9u03c0u03c1u03afu03c3u03bcu03b1u03c4u03b1 or u03c0u03b1u03c1u03b1u03c0u03c1u03afu03c3u03bcu03b1u03c4u03b1,25 namely, waste from the ivory carvers shops: the difference between the price of the tusks (100 drachmae per mina) and that of the schidai (70 drachmae per mina) is too small to address the gap in value between entire tusks and small scraps.26#p12In order to justify his translation of the term schidai, Rathbone recalled a passage by Pliny the Elder, in which the elephants are said to deliberately break their tusks in order to escape from hunters: u2018They themselves [sc. the elephants] know that the only thing in them that makes desirable plunder is in their weapons [u2026] and when surrounded by a party of hunters they post those with the smallest tusks in front, so that it may be thought not worth while to fight them, and afterwards when exhausted they break their tusks by dashing them against a tree, and ransom themselves at the price of the desired booty (transl. by Rackham).27#p13This passage requires two clarifications. The first is that it is part of a section comprising several other mirabilia testifying to the quasi-human affective and cognitive capacities of the elephant28u2014a rather popular topic in Western classical literature.29 The second is that it attributes to elephants a tactic comparable to that ascribed to beavers, when they are chased down by hunters.Just like elephants, beavers u2018ransom themselves with that part of their body on account of which they are chiefly sought for.30 Whatever the truth behind it, we do not need to rely on this tale to explain the ivory fragments exported from Muziris. As a matter of fact, another more prosaic explanation is at hand. I propose, in fact, to identify the schidai as those fragments that are regularly trimmed from the tusks of captive elephants.#p14Tusk trimming is a standard practice in Kerala today,31 but it was also common in ancient India, as is shown in some Sanskrit classical texts.Regular trimming of elephant tusks is mentioned in the Arthau015bu0101stra, in the lines that end the section dedicated to the duties of the hastyadhyaku1e63a, the superintendent of the elephants:#p15danta-mu016bla-paru012bu1e47u0101ha-dvi-guu1e47au1e43 projjhya kalpayet /abde dvy-ardhe nadu012b-ju0101nu0101u1e43 pau00f1ca-abde parvata-okasu0101m//Leaving the double length of the circumference of the tusk at the root, he should cut [sc. the rest], every two years and a half in the case of those [sc. elephants] from river-banks, every five years in the case of those from mountainous regions.32Approximately the same rules are mentioned in Varu0101hamihiras Bu1e5bhat Sau1e43hitu0101:#p16dantasya mu016blaparidhiu1e43 dviru0101yatau1e43 prohya kalpayeccheu1e63am/ adhikamanu016bpacaru0101u1e47u0101u1e43 nyu016bnau1e43 giricu0101riu1e47u0101u1e43 kiu00f1cit//Having left the double length of the circumference of the tooth at its root, cut the rest; more (often) in those elephants that live in the humid places, a little less often in those that live in the mountain.33If we turn to Greek authors, the sawing of Indian elephant tusks is also referenced, although only as a practice limited to the few war elephants with unusually big tusk. the Indian elephants are not provided with large tusks, but should they have such, they saw them off, that their weight may not encumber them in war.34The practice of leaving u2018the double length of the circumference of the tooth at its roots addresses the need to avoid cutting into the living pulp of the tusk.35 The fact that elephants living in the mountains may get their tusks trimmed less often than those living by the riverbanks has been taken as a proof of a slower growth rate of tusks of the mountain elephants.36Schidai and the arabarchs share If the above interpretation of the term u03c3u03c7u03afu03b4u03b1 is correct, then there are consequences to be drawn related to the fiscal procedures implied in the Muziris papyrus. If the schidai mentioned in the text do refer to the remnants of ivory regularly trimmed away from tusks either every two and a half or every five years, then it follows that a schida normally weighed much less than an entire tusk, since the trimming has to leave u2018the double length of the circumference of the tooth at its roots. Therefore, the 22.75 minae (around 11.6 kgs) of schidai taken in addition by the arabarchs, far from being only a fraction of a schida, will equal several schidai. In conclusion, whatever was taken in addition was not randomly seized because it was impossible to do otherwise, but must have been rationally determined and deliberately taken. As a matter of fact, it seems that the shares of sound ivory and schidai taken by the arabarchs were arithmetically defined.The quota of sound ivory (11.75 minae) results from charging 1 mina for every 10 weight talents (1/600, u1f11u03beu03b1u03bau03bfu03c3u03b9u03bfu03c3u03c4u03ae) of the total amount (105 weight talents and 13 minae, rounded up to 110 weight talents), plus the fraction of mina of the three-quarters (.75). Similarly, the quota of the u03c3u03c7u03afu03b4u03b1u03b9 (22.75 minae) results from charging 120 drachmae for every weight talent (1/50, u03c0u03b5u03bdu03c4u03b7u03bau03bfu03c3u03c4u03ae) of the total amount (17 weight talents and 33 minae, rounded up to 18 weight talents, which makes 21.6 minae, rounded up to 22), plus the fraction of mina of the three-quarters (.75).If this explanation is correct, it follows that the share taken in addition by the arabarchs was nothing but a surcharge. Therefore, either the tax collector was able to levy in kind a quarter-tax plus surcharge based on weight and arithmetically determinedu2014no matter the commodityu2014or else the calculations of the Muziris papyrus verso imply a payment of the total dues in the form of money.Ivory and pepper values As mentioned, in the Muziris papyrus the schidai have a lower value (70 drachmae per mina) than the entire tusks of sound ivory (100 drachmae per mina).37 Both schidai and complete tusks in turn have values considerably higher than pepper.38 The contrast with the Price Edict, in which ivory and pepper have maximum prices of 150 and 800 denarii respectively,39 is evident. Since the values assumed by the Muziris papyrus and the maximum prices fixed by the Price Edict are meant to remain unaffected by the short-term supply-and-demand dynamics in any particular place in the Roman empire, the overturning of the hierarchy between the values of these two commodities was not due to episodic reasons.Indeed, such a radical change is likely to have been the result of complex factors that cannot be fully explored here. Nonetheless, it may be worth pointing out that the low valuation of pepper in the Muziris papyrus is also dependent on the direct voyages to South India of ships like the Hermapollon.The cessation of that relatively economical pattern of trade must have contributed to the higher prices of pepper in late antiquity.40 The contrasting dynamics of ivory values may in part be illuminated by Plinys claim that in his time India, where only some of the male elephants have tusks,41 was the major supplier of ivory.42 If Pliny is to be trusted, then neither the excellent Adulis ivory nor the abundant, if inferior, Rhapta ivory,43 nor any other East African ivory,44 were major Mediterranean imports in the mid-first century CE. The potential of the African continent, where both male and female elephants have tusks, was thus only marginally exploited.By late antiquity, however, the volume of African ivory exported had likely substantially increased,45 as suggested by the emphasis in the Expositio totius mundi et gentium on the countless number of elephants of India minor (=East Africa)46 and, less ambiguously, Cosmas Indicopleustes remarks about the population of Aithiopias elephants and the scope of the export of their ivory.47 One final observation may be made on this subject: Cosmas Indicopleustes also noted that the African elephants had bigger tusks than the Indian elephants.48 He was probably referring to African savanna elephants (Loxodonta Africana Africana), which tend to develop longer and thicker tusks than either the Asian elephant (Elephas maximus) or the even smaller African forest elephant (Loxodonta Africana cyclotis).49 It has to be emphasized, though, that Cosmas information cannot be taken as an indication that, in the first centuries of the Christian era, the traded African ivory comprised tusks that were on average bigger than those of the traded Asian ivory. Aside from the varying growth potential of different species, the average weight of the traded tusks would have depended on the selection strategies of hunters and merchants; hence the average weight per tusk of commercial lots of Asian ivory could have been higher than that of some African commercial lots.Therefore, it is not impossibleu2014indeed, it is arguable, as we shall seeu2014that the maximum price for ivory in the Price Edict was also influenced by the import of large quantities of African tusks of rather low average weight. Schidai and royal elephants While several of the commodities imported by the Roman ships from the Limyrike emporia were not home products of Malabar,50 the ivory exported by the Hermapollon, both the entire tusks and the trimmings, was most probably a regional product.The availability of ivory at Muziris was facilitated by the fact that the Cu0113ra kings who controlled Muziris also controlled inland forests rich in wild elephants; it is not coincidental that Cu0113ra coinsu2014also found at the site of Pattanam, most likely included in the Muziris area51u2014bear an elephant on their obverse. coinscoins Figure 9. Cu0113ra coins from Pattanam (Courtesy Cherian) The abundance of elephants in the Cu0113ra forests was the inspiration for the simile the poet Kunrukatu0323pu0101liyu0101tanu0101r employed to address the Cu0113ra king Cu0113ramu0101n Karuvu016bru0113riya Olu0323vu0101tu0323ku014dp Peruu00f1cu0113ral Irumporai: erumai au1e49u1e49a karuu1e45kal iu1e6dai tu014du1e5fu,u2223 u0101u1e49iu1e5f parakkum yu0101u1e49aiya, muu1e49piu1e49,u2223ku0101u1e49aka nu0101u1e6dau1e49ai Are you the king of the forests where elephants spread to graze like cows amidst buffalo-like rocks?52 The conspicuous presence of elephants in the Muziris region is also reflected in the Peutinger Table, which has the caption u2018in this place elephants are born,53 near what could be the Western Ghats (Mons Lymodus). Figure 10.Tabula Peutingeriana portion of Seg. XI as reproduced by Miller in 1887/8.In ancient India, captive male elephants with big tusks54 are a prerogative of the highest political authorities, and essential to their military strength.According to Megasthenes, only the king has the right to own horses and elephants,55 and in the Arthau015bu0101stras words the u2018kings victory is mainly a matter of elephants.56 In the theory laid down by the Tolku0101ppiyam, the possession of war elephants57 is a distinctive feature of the aracar.58 It is likely that the term, a Tamilization of Skt. ru0101jan-,59 is meant to be inclusive of both vu0113ntar, kings of the highest rank, and vu0113lu0323ir, somewhat high dignitaries or more or less dependent chieftains.60 At any rate, in Cau1e45kam literature many vu0113lu0323ir are said to have (or to donate) captive elephants.61 On the other hand, it is reasonable to assume that the regional pre-eminence of the mu016bvu0113ntaru2014the three major powers of the Cu0113rar, Pu0101nu0323tu0323iyar, and Colaru2014was backed by the ownership of a higher number of war elephants. It will suffice here to quote a few lines in praise of the Cu0113ra king Celvakkau1e6duu1e45ku014dv u0100u1e3biyu0101tau1e49: You free the poets from poverty with the tribute that you receive from the inimical mau1e49u1e49ar!62 The many male elephants perfect in action, who with their large rugged trunks and lifting tusks were stationed near the guarded forest of the vu0113ntu (kingdom of a vu0113ntan, a u2018king of the highest rank), with their big necks with flower-like spots and fragrant cheeks smeared with dust, they moved dispersed here and there and destroyed the ramparts of the enemy.63 The 538.5 kgs of schidai shipped out by the Hermapollon were trimmings taken from captive elephants. As the tusks had to be trimmed leaving u2018the double length of the circumference of the tusk at the root, a schida could hardly weigh more than one-third of an entire tusk.More precisely, since the tusks of the captive elephants had to be trimmed every two and a half or every five years, the average weight of the schidai imported by the Hermapollon should have been between 1 and 7 kgs.64 An export of 538.5 kgs of schidai, which must have numbered between 75 and 540 pieces,65 could hardly have been achieved without the contribution of the trimmings from the large elephant contingent of the Cu0113ra king, who controlled both the most famous of the Limyrike emporia and the forests where wild elephants abounded. If the quantity exported by the Hermapollon did not represent an exceptional peak, but was the routine annual export from Muziris or even less than that, then the Muziris export of schidai had to be sustained by a population of at least 380 captive adult male elephants.66 This number is not far from the 500 or 600 elephants that Cosmas Indicopleustes attributes to several kings of the west coast of Indiau2014among them, the king of Male.67 Tusks, hunters and bandits Aside from the tusks acquired from elephants that died in captivity, those exported from Muziris were largely from wild tuskers, killed by forest dwellers for their meat and their ivory: The hunter from the forest with mighty hands like iron, concealed behind a blooming Maru0101am tree, shoots choicest arrows, at the mighty chest of a tusker of speckled forehead, and plucks out the white tusks that with might destroy the foes; he plants them, in his hut thatched with grass [u2026] The man from the mountain eats meat cooked on the flame of sandalwood, partying with relations, taking pleasure from toddy (transl. Dhakshinamurthy, with modifications).68 Cau1e45kam literature offers references to ivory trade undertaken by elephant hunters who are said to make their living by selling tusks.Quite interestingly, some of them are located in the western part of the Kolli hills, where u014cri, a minor chieftain to some extent dependent upon the Cu0113ra kings,69 rules: [u2026]the western [side of] mount Kolli,/ [belonging to] u014cri with strong bow,/ where [people] eat by selling the tooth of the swift-eyed elephant/ when they are hungry in small homes (transl. Wilden).70 Another poem from Cau1e45kam literature records a chief of Ilu0323aiyar,71 who keeps an elephant tusk in his home.Left with no money because his robbery business is stagnant, he trades his white tusk to satisfy his desire for alcohol. [u2026]the chief of the strong bow and lawless life Ilu0323aiyar, who rob the trading caravan that moves along roads lined by dry bamboo, when he is exhausted by the sun, he visits the house of broad shouldered women with tattoos on their bellies where the toddy is sold. Unable to pay for it, he pats the small head of the running son and points out the white tusk of the forest elephant in musth [u2026].72 The twofold activity of the Ilu0323aiyaru2014bandits at the expense of the travelling traders, as well as hunters of wild elephants in the forestsu2014puts them on or beyond the fringe of the Cu0113ra kings control and protection.Nonetheless, they too fuelled Muziris trade.Tusk comparisons The tusks imported by the Hermapollon must have been carefully selected. They were not only sound, as attested by the text, they were also rather large, as their average weight shows.At col. ii, l. 13, Morelli rightly rejects the editors reading u03bau03b1u1f76 u03c4u03b5u03c4u03b1u03c1u03c4u03bfu03bbu03bfu03b3u03bfu03c5u03bcu03adu03bdu03c9u03bd.Calling for a comparison with the 2,000 three-cubit-long tusks paraded by Aemilius Paulus in his triumph of 167 BCE,73 he ingeniously reads u03b4u03b9u03c0u1f75u0323u03c7u0323u03b5u0323u03c9u0323u03bdu0323 u1f45u0323u03bbu03c9u03bd, entire, two-cubit-long tusks.Apart from the ending -u03bbu03c9u03bd, I can neither confirm Morellis reading nor suggest any alternative. I can however emphasize that the total weight of the tusks imported by the Hermapollon shows by itself that those 167 tusks were a selected lot, just as the reading u03b4u03b9u03c0u1f75u0323u03c7u0323u03b5u0323u03c9u0323u03bdu0323 u1f45u0323u03bbu03c9u03bd would imply. As a matter of fact, 167 tusks weighing 105 talents and 13 minae (= 3,228.5 kgs) have a rather high average weight of 37.8 minae (= 19.332 kgs) per tusk.74 It is not that great a stretch from the average weight of the two tusks sold to Apollos temple in Delos by Herakleides of Tyre (46.3125 minae per tusk)75 or the thirty-four tusks donated by Ptolemy Auletes to the temple of Didyma (42.94 minae per tusk),76 especially since the talent(s) implied by these inscriptions must have been lighter than the one used by the quarter-tax administration to weigh the Hermapollons cargo.77 However, those few tusks bought by or donated to a temple were likely of exceptional quality. A commercial lot such as the Hermapollon cargo is thus more appropriately compared with other commercial lots. Following this perspective, documents from the early sixteenth century may provide more useful evidence: In 1506, Pero Ferreira Fogau00e7a, capitu00e3o of Kilwa takes notice of a zambuco carrying 570 tusks weighing 92 quintaes, 2 arrobas, 31 arrates (= 5,448.95 kgs): the average weight is 9.56 kgs per tusk.78 January 18th 1507, Nuno Vaz Pereira, capitu00e3o of Sofala, orders delivery of 264 tusks and two pieces weighing 73 quintaes, 1 arroba, 20 arates (= 4,312.39 kgs): counting the two pieces as tusks, the average weight is 16.21 kgs per tusk.79 December 20th 1514, u00c1lvaro de Bouro reports a sale of an ivory stock in Lisbon.80 The document details not only the number of tusks and their total weight, but also the number of tusks contained in each of the thirteen lots of 6 quintaes (= 352.512 kgs), plus one lot of 4 quintaes and 24 arrateis (= 246.024 kgs) in which the stock has been divided and sold. Since the total weight of the 385 tusks was 82 quintaes and 24 arrateis (= 4,828.68 kgs), the average weight per tusk was 12.542 kgs.However, the different lots have very different average weights: they range from 20.736 kgs to 4.641 kgs per tusk.Table 1.Average weight per tusk of the lot DPMAC III, n.104 WeighttTuskstAverage weight 6 quintaes ( = 352.512 kgs)t17t20.736 kgs 6 quintaes ( = 352.512 kgs)t17t20.736 kgs 6 quintaes ( = 352.512 kgs)t19t18.553 kgs 6 quintaes ( = 352.512 kgs)t20t17.625 kgs 6 quintaes ( = 352.512 kgs)t21t16.786 kgs 6 quintaes ( = 352.512 kgs)t22t16.023 kgs 6 quintaes ( = 352.512 kgs)t22t16.023 kgs 6 quintaes ( = 352.512 kgs)t22t16.023 kgs 6 quintaes ( = 352.512 kgs)t26t13.558 kgs 6 quintaes ( = 352.512 kgs)t26t13.558 kgs 6 quintaes ( = 352.512 kgs)t28t12.589 kgs 6 quintaes ( = 352.512 kgs)t38t9.276 kgs 6 quintaes ( = 352.512 kgs)t54t6.528 kgs 4 quintaes 24 arrateis ( = 246.024 kgs)t53t4.641 kgs Totalt 82 quintaes 24 arrateis (= 4,828.68 kgs)t385t12.542 kgs February 13th 1515, Francesco Corbinelli, feitor in Goa, acknowledges receipt of 193 big and small tusks weighing 39 quintaes and 3 arrobas (= 2,335.39 kgs) from Lourenu00e7o Moreno, feitor in Cochin: the average weight is 12.1 kgs per tusk.81 August 27th 1517, Pero Coresma, appointed feitor of Cochin, acknowledges receipt in Sofala of 233 big and small tusks weighing 61 quyntaes, 3 arrobas, 28 arrateis (= 3,640.788 kgs): the average weight is 15.62 kgs per tusk. 82 May 25th 1518, Pedro Jacome dies in Sofala leaving eight dentes weighing duas arrobas menos quatros arrates (= 27 kgs): the average weight is 3.37 kgs.83 July 15th 1518, Joham Afonso da Cunha allcaide mor and feitor of Mozambique receives 349 big and small tusks weighing 92 quintaes (= 5,405.18 kgs): the average weight is 15.48 kgs.84 Figure 11.Average weights per tusk of seven sixteenth century lots and Hermapollons cargo (in kgs) With the possible exception of the ivory sent to Goa by Lourenu00e7o Moreno in 1515,85 all of these ivory lots are of certain African origin. It is therefore clear that the distinction made between big and small tusks in some of these documents cannot correspond with the contrast between tusks and schidai, which characterizes the Hermapollon cargo, if the schidai are, as I suggest, captive elephant tusk trimmings.In his Informau00e7u00e3o para el-rei written from Goa in 1530, Jordu00e3o de Freitas distinguishes between three types of ivory: 1) the good, big, sound, and clean one (bom grande su00e3o e linpo), whose value in Sofala was between thirty and forty maticais per bahar; 2) the small one (pequeno), whose tusks weigh between one and one-half farau00e7ola (= between 11.75 and 5.87 kgs) each, and whose value was half the price of the first type; 3) the even smaller one (mays meyudo), whose value in Sofala was ten to twelve maticais.86 The small size of the second and third types in de Freitas categorization and the low average weight of the listed African ivory lots can hardly be explained by just assuming that all of those tusks belonged to forest elephants (Loxodonta Africana cyclotis). Such an assumption would be inconsistent with the present geographical distribution of that species, and it would still require one to emphasize the inattention to tusk size during the elephant hunts, since tusks lighter than 5.87 kgs must have belonged to very young animals, no matter the species.Apparently, African hunters were only marginally motivated by ivory traders or influenced by the different commercial values assigned to tusks of different size. The low average weight of those lotsu2014all the more remarkable since the tusks must have belonged mainly to savanna elephantsu2014shows that in Africa elephants must have been killed for reasons other than the ivory trade.The ivory of the Elephant-eaters The relatively low average weight of the sixteenth-century African tusks87 suggests a clue for interpreting a remark by the author of the Periplus Maris Erythraei about the ivory exported from Rhapta. In this very last emporium of Azania, a great amount of ivory is said to be available.Its quality, however, was held to be inferior to that exported from the much closer Adulis.88 The composition of the sixteenth-century ivory lots from Sofala suggests that the Rhapta export was inferior to the Adulis one, not because it was from a different species or because their tusks were always less sound than the Adulis ones, but because it resulted from a different kind of trade and perhaps a differently motivated hunt. The fine Adulis ivory came from faraway regions beyond the Nile, it was conveyed to Axum, then to Koloe and finally to Adulis.89 On its way to the Red Sea, the ivory was traded by foreign merchants, who wanted to be paid in Roman money;90 it was shipped to Egypt by merchants from Roman Egypt.Such a commercial circuit necessarily required a deliberate selection of tusks based on their quality, which had to be of the Adulis standard.91 Figure 12. Availability of ivory according to the Periplus Maris Erythraei (small circles u2018little ivory, medium circles u2018ivory, big circle u2018great amount of ivory).Base map courtesy Ancient World Mapping Center and published under Creative Commons Attribution-Non Commercial license.In contrast, the Rhapta trade had a completely different style.Ivory was imported by small Muza ships, manned by crews linked by intermarriages with the Rhapta people.92 Together with spears, axes, knives, awls, and glass stones, they would bring large quantities of grain and wine to be used in nearby places u2018not for trade, but because of extravagance, for the entertainment of the barbarians.93 It is therefore likely that the Rhapta ivory was inferior to the Adulis ivory, because it included considerable quantities of pequeno and mays miudo marfimu2014small and even smaller tusks. Once it arrived at Muza, the inferior but plentiful ivory from Rhapta was most likely sent to Barygaza,94 just as in the sixteenth century enormous amounts of ivoryu2014Garcia da Orta quantifies them in 6,000 quintais (more than 350 tons) per year95u2014were sent to India from the East Africa coast between Sofala and Malindi.As mentioned above, the very small tusks included in the ivory lots show that African elephants were not killed for their ivory alone. The Greek perception of the particular human-elephant relationship in East Africa is reflected in the term Elephantophagoi96 (Elephant-eaters), elaborated when the exploration of the African world south of Egypt inspired an ethnological taxonomy based on dietary habits.Along the lines of the much older Ichthyophagoi and of the new entry Chelonophagoi (re)discovered in Carmania by Alexanders army,97 Rhizophagoi, Hylophagoi, Spermatophagoi, Akridophagoi, Struthophagoi, Agriophagoi, Moschophagoi, and Elephantophagoi were identified. Greek ethnographic accounts ignored the fact that elephant meat was to some extent eaten in ancient South India as well.Moreover, the Greek writings did not take into account the idea that African societies may have killed elephants not only for their meat but also to prevent them from crop raiding: in their opinion, fondness for elephant meat was the key factor.In a story repeated by Agatharchides, the Elephantophagoi refused to stop killing elephants and eating their meat despite Ptolemys urging and the promise of splendid rewards.98 They replied that they would not change their way of life, not even for all the kingdom of Egypt. The task of providing the Ptolemaic army with an Indian-style elephant division99 thus had to accommodate the cultural traditions of Africa.The story may be fictional, but the perception that in Africa the human-elephant relations were different from India was accurate: the contrast between the African ivory carried by the Portuguese ships and the Indian ivory shipped out by the Hermapollon supports this distinction."
}