{
  "articleId": "isaw_paper20_6",
  "text": "ARTICLE_ID: isaw_paper20_6\nThe Opportunity As a type of evidence for the ancient world, coinage is unique.Coins are monetary objects, and thus a key element in modern attempts to reconstruct the workings of the ancient economy.For example, through the process of die-study it is possible to determine with some degree of accuracy how many dies were used to strike a given coinage.This provides us with a way to quantify ancient monetary production. Since coins can also be attributed to particular rulers or cities with some degree of certainty, this makes it possible to ascertain the monetary output of different cities, kingdoms and empires, and to compare them with one another.There now exists a substantial body of scholarship devoted to the estimation of size of production, but comparatively little as yet to its broad analysis or representation in interactive media such as timelines or maps.2Coins are also archaeological objects in that they have findspots. Coins within archaeological contexts have much to tell excavators about the contexts they are digging, but also more broadly about the monetary profile of the site they are excavating compared to others of similar or different types; from multiple sites a regional history may emerge (see, e.g., Reece, 1982).But findspots also give coins a trajectory.If we know where a coin was made and where it was found, we have evidence for movement, connectivity, and economic circulation (see Map 1).Map 1: Distribution of Roman denarii (blue: mints, red: hoards, green: individual finds).Few archaeological objects from antiquity can be mapped from source to deposition with such certainty as coins, and yet again we are only beginning to exploit the possibilities of this evidence in analytical and representational tools. Moreover, with the advent of the metal detector, individual coin finds and their recording are no longer confined to excavation material.The Portable Antiquities Scheme (PAS) in the United Kingdom, for example, now has recorded findspots for some 412,000 coins (Pett 2014; see Map 2).The PAS has led to new works of synthesis (e.g., Leins, 2012; Walton, 2012).Other similar databases have seen online publication in recent years. Finds databases for Roman coins found outside the Roman Empire exist for both Germany and Poland.The University of Oxford is creating a large-scale database of Coin Hoards of the Roman Empire (CHRE), to join with the American Numismatic Society-led initiatives Coin Hoards of the Roman Republic (CHRR) and the Inventory of Greek Coin Hoards (IGCH) to paint a broader picture of coin hoarding spanning a millennium from Archaic Greece to the end of the Roman Empire.3 These projects are at varying stages of integration into the wider numismatic research ecosystem. Only when it becomes possible to compare data sets across multiple modern source countries will we be able to write the larger monetary history of ancient imperial spaces.Map 2.Coin finds in the UK PAS database (https:finds.org.ukdatabasesearchmapobjecttypeCOIN): colors derived from density of finds by location.Unlike most other forms of archaeological evidence, coins are official objects: their designs and inscriptions can tell us about the intentions of their issuers and, perhaps, the preconceptions of their users (See e.g., Fig. 1). The iconographic and epigraphic repertoire of ancient coinage is a huge, and substantially un-mined resource for examining areas from local religion to imperial economic policy; from individual political ambition to communal statements of identity.And there is scope here, as recent work has shown (Kemmers, 2006; von Kaenel and Kemmers, 2009), to marry the evidence from findspots to that of the iconography of the objects, and thereby expose patterns of administration invisible from other sources.Fig. 1. Reverse of a denarius of Augustus depicting a Cippus inscribed: S(enatus) P(opulus)Q(ue) R(omanus) IMP(eratori) CAE(sari) QVOD V(iae) M(unitae) S(unt) EX EA P(ecunia) Q(uae) I(ussu) S(enatus) AD A(erarium) D(elata) E(st).(ANS 1944.100.38334, American Numismatic Society, accessed October 26, 2020, http:numismatics.orgcollection1944.100.38334.)Image used under CC0 license.Finally, there is the sheer quantity of material that survives. As we have already noted, after 20 years of recording, the PAS contains information on 412,000 coins, and the rate of discovery, and thus growth of material is not yet showing signs of abatement.This is just one country.Initiatives exist to record individual finds as well as hoards in numerous other European countries, most recently, the Netherlands with the enactment of the Portable Antiquities of the Netherlands (PAN).4 Moreover, the collections of Museumsu2014both local and nationalu2014raise the numbers of coins available for study literally into the millions (Callatau00ff 1997b). To these sources we must add also those coins that appear in commerce every year, most of which are publicized online through various auction houses (e.g., Fig. 2).Fig. 2.The first of more than 100,000 results for a search for 'denarius' in the Coinarchives Pro subscription website (http:pro.coinarchives.comaresults.php?search=denarius&firmid=&s=0&upcoming=0&results=100)Numismatic material thus presents an exciting set of opportunities to address questions unanswerable through other source material, and to do so with substantial quantities of data, a significant amount of which is already available online in a variety of forms.The ProblemsHowever, two of the the principal barriers to the exploitation of this data lie in its sheer volume and its location in a variety of institutional and non-institutional settings. Many, many coins are described online, but they are described in different languages, are hosted in different systems and in different formats, according to different standards, and with different aims (compare Figs. 3a-3d).Fig. 3a.Tetradrachm in the name of Alexander the Great, mint of Memphis.Bode Museum, Berlin, online catalogue (IKMK). (Mu00fcnzkabinett der Staatlichen Museen zu Berlin, 18202968.The Berlin Mu00fcnzkabinett Online Catalogue, http:ikmk.smb.museum, accessed October 26, 2020.)Fig. 3b. Tetradrachm in the name of Alexander the Great, mint of Memphis. ANS, New York, online catalogue (MANTIS). (ANS 1944.100.35623, American Numismatic Society, accessed October 26, 2020, http:numismatics.orgcollection1944.100.35623.)Fig. 3c.Tetradrachm in the name of Alexander the Great, mint of Memphis.Bibliothu00e8que Nationale, Paris, online catalogue (Gallica). (FRBNF41746253, Source: gallica.bnf.fr Bibliothu00e8que nationale de France, accessed October 26, 2020, https:gallica.bnf.frark:12148btv1b11316767c.)Fig. 3d. Tetradrachm in the name of Alexander the Great, mint of Memphis.Freeman & Sear, sold 4.i.2011. (Coinarchives Pro) http:pro.coinarchives.comalotviewer.php?LotID=391000&AucID=707&Lot=32. [Open record: https:www.coinarchives.comaopenlink.php?l=391000|707|32|f708f6b4416813e8a51c49e0f071d73d]To add to the complexity, numismatics has its own way of describing numismatic objects, necessitated by and tailored to features specific to coinage. Coins, for example, have two sides, both of which must be described.They are both pictorial and textual.Physical characteristics such as material, weight, diameter, and the relationship of the heads to tails (obverse to reverse) directions (axis) can be recorded.Coins have denominational systems that vary with time and place, and those times and places may require systems of chronology and geography that vary from standard, modern formats (e.g., 1543-1532 BC, first quarter of the second century, Byzantium, Constantinople.) There is also a vast array of information about individuals involved in the production of coinage whose names and titles may vary over time, and find no easy analogue in any other discipline: Augustus, Octavian, Tresvir, moneyer, die-engraver. In a further twist, it is often necessary to record not just the details of an individual coin, but also its relationship to others: the context of its circumstances of discovery, a taxonomic arrangement, a commercial transaction, or its current physical disposition.Solutions: Creating a Linked DisciplineCoinage is thus a rich source for the study of the ancient world, and the study of Roman Imperial coinage in particular is well established in the print medium. Roman numismatists have, over the past century, divided their discipline into four discrete areas of study.The basic structure of Imperial coinage has been the focus of a type corpus known as Roman Imperial Coinage (RIC), printed in 10 volumes, providing a basic description of each of the 40,000+ recorded varieties of the coinage.It is the standard reference work for all who catalogue and publish Roman coins in any context. These contexts may be divided into three separate types, which have formed the subject of the other three areas of focus of numismatic study: collections, hoards, and individual finds.Roman coins exist in the hundreds of thousands in the major public collections across the world.Hoards (coins buried together in antiquity) are found today in astonishing numbers across the former territory of the Empire. Single finds are similarly common, both within archaeologically excavated contexts, where their scientific value is enhanced, or as chance or metal-detector finds.As Fig. 4 describes, all four of these areas of study are fundamentally interlinked since collections may contain hoards and single finds, and any coin from any context must be described by RIC type for it to be properly published and usable in historical synthesis.Fig. 4. The linked nature of Numismatic Study.In a very obvious sense, Roman numismatics was a prime candidate for the introduction of a Linked Data approach to the entire range of publications required by the discipline.In 2011 the American Numismatic Society began, in collaboration with a number of strategic partners, the process of developing the necessary infrastructure for the creation of linked Roman numismatic data. These technological principles have been expanded to include a significant portion of Hellenistic numismatics at the date of this publication, and collaborators in England, France, and Spain are working on pre-Roman Gallic and Iberian coinage.5Vocabulary and OntologyA key element of this infrastructure are the stable URIs required to describe numismatic concepts.As noted above, there are elements of coin-description peculiar to numismatics that require a tailored approach to the creation of a discipline-specific vocabulary. Here we were able to harness a project (http:nomisma.org) established by Sebastian Heath and Andrew Meadows in 2010 to provide stable digital representations of numismatic concepts in the form of http URIs that also provide access to reusable information about those concepts, along with links to other resources.This allows us to build a graph of Roman coin data that is linked within Roman numismatics by the use of discipline-specific terms such as denominations (e.g., http:nomisma.orgiddenarius) or mints (http:nomisma.orgidlugdunum), but also allows us to join the broader graph of ancient world data through the use of common identifiers such as Pleiades URIs (e.g., https:pleiades.stoa.orgplaces167717) for ancient places and the Getty Art & Architecture Thesaurus (AAT) for other categories of concepts (e.g., denominations such as denarius: http:vocab.getty.eduaat300037266). By this simple decision we were able to ensure, in theory at least, the integration of numismatic data within the field of Roman numismatics, but also the permeation of numismatic material into other fields of study.The launch In July 2013 of a revised Nomisma.org system, based on Apache Fuseki,6 with a SPARQL endpoint and improved APIs, has allowed us to integrate Nomisma IDs fully into a number of numismatic projects.By forming a concordance between Nomisma.org-defined concepts and URIs in external information systems, it is possible to integrate numismatic data into the broader ancient world Linked Open Data cloud. For example, a coin minted in Lugdunum, as defined in Nomisma, is by extension produced in its Pleiades equivalent.The underlying machine-readable data in Nomisma facilitate the direct publication of the American Numismatic Society's Greco-Roman materials to Pelagios (via the Peripleo web application) through the ANS digital collection, MANTIS (http:numismatics.orgsearch).Similarly, a Nomisma API, built on an underlying SPARQL query, enables content from Nomisma's partners (both small and large institutions) to make their materials available in Pelagios. This is an especially valuable feature for partners who simply lack the technical personnel or expertise to build these data exports directly into their own database systems.Of the nearly 200,000 Greek and Roman coins available in the Nomisma.org SPARQL endpoint, more than 134,000 are available to Pelagios through this API.Today, more than 5,000 intellectual concepts have been defined by Nomisma.org across a growing number of periods, cultures and categories. While Greco-Roman concepts were the first focus of the project, it has grown to include partial coverage of Islamic numismatics and Medieval and early Modern European concepts.Categories of terms range from materials and denominations to geographic identifiers, like mints and regions, to personal, corporate, or dynastic entities responsible for the minting of coinage.Nomisma is overseen by a steering committee, and the responsibility for creating and maintaining IDs has fallen to discipline-specific working groups, such as for Roman, Greek, and Medieval numismatics.Nomisma underwent another significant architectural overhaul in 2014, including a migration of data into a more standards-compliant model following modern Semantic Web specifications. This process included the introduction of the Nomisma ontology, developed by Karsten Tolle, a computer scientist at the University of Frankfurt, in collaboration with numismatists and developers on the Nomisma steering committee.7 The Nomisma ontology is not designed around closed-world principles in linked data.Numismatic data should not be exclusively confined to the properties and classes defined within the ontology. Rather, concepts in Nomisma are modeled primarily in the Simple Knowledge Organization System (SKOS), an ontology designed for the expression of taxonomies and internal and external linkages between terms.The Nomisma ontology as it applies to concepts further refines our application of SKOS by defining specific classes of information.The mint of Rome is designated by the URI http:nomisma.orgontology#Mint (shorted to nmo:Mint). A denarius is an nmo:Denomination. The thesaurus uses properties and classes from numerous ontologies, from Dublin Core Terms for titles and bibliographic references to the WGS84 geographic ontology for geospatial coordinates.8 Rather than inventing a new property or class for every possible type of information, the ontology is intended to fill gaps in existing ontologies and facilitate the organization of numismatic information in a way that reflects how numismatists themselves classify and query objects. Therefore, properties in the ontology correspond to classes: a coin or coin type from Rome carries the property nmo:hasMint linking to http:nomisma.orgidrome, and nmo:hasDenomination linking to http:nomisma.orgiddenarius.A Type CorpusThe existence of a full print corpus of Roman Imperial Coinage (RIC) provided a ready-made framework for the creation of an online type corpus. A project was established in 2011 jointly by the ANS and New York University's Institute for the Study of the Ancient World (ISAW) to build an online adaptation of this resource on the principles of Linked Data. This project benefited from head-starts in two areas.First the resource for the creation of necessary URIs existed in the Nomisma.org project; second, the collection database of the ANS (http:numismatics.orgsearch) already contained the descriptive elements of approximately one-third of the c. 40,000 known types of Imperial coinage.From these two resources we were quickly able, with technical implementation by Gruber and data under the management of Dr. Gilles Bransbourg, to establish Online Coins of the Roman Empire (OCRE, http:numismatics.orgocre), a type corpus of Roman coinage.Initially launched in July 2012 and with the types from Augustus to Hadrian, the project was completed in 2017 (although errors continue to be fixed), following a three-year grant from the National Endowment for the Humanities (NEH).9As work progressed on the creation of type records within OCRE, we created the Nomisma.org URIs necessary for their description. The Linked Data approach we have taken to the creation of OCRE has a number of obvious payoffs.An attractive feature is that by providing alternative names for all Nomisma.org concepts in multiple languages, we have been able quickly and easily build a multilingual interface (compare Figs. 5a and 5b), derived from SKOS-defined preferred labels in RDF extracted real-time from Nomisma.org's APIs.To date 17 languages are supported, including English, German, and French (among the more common languages among our user-base), but also Bulgarian, Polish, and Arabic, which do see significant usage. The advantages to the Linked Data approach run deeper, too.Where the Roman Imperial Coinage type corpus can do nothing but describe the types themselves and illustrate a single representative example of a selected few types, OCRE has the power to link to multiple examples of a given type from multiple contexts.There are now 31 partners and 117,570 total specimens from an international range of museum and archaeological databases aggregated by Nomisma.org and made accessible through OCRE.Fig. 5a. OCRE browse page displayed in English. (Online Coins of the Roman Empire, accessed October 26, 2020, http:numismatics.orgocreresults.)Fig. 5b. OCRE browse page displayed in Greek. (Online Coins of the Roman Empire, accessed October 26, 2020, http:numismatics.orgocreresults?lang=el.)The evolution of OCRE, between enhancement of Nomisma's infrastructure and software development surrounding its publication platform, Numishare, opens the door to similar projects in the future.10 The American Numismatic Society and the broader numismatic community have published four subsequent Greek and Roman type corpora following the same technical principles. In early 2015, the ANS, in collaboration with colleagues at the British Museum, released Coinage of the Roman Republic Online (CRRO, http:numismatics.orgcrro).Later that year, PELLA (http:numismatics.orgpella), a type corpus of the coinage of Alexander the Great, was released.In late 2017, the first iteration of Seleucid Coins Online (SCO, http:numismatics.orgsco) publicly launched, and the final version of this and the first phase of Ptolemaic Coins Online (http:numismatics.orgpco) were published in November-December 2018. These latter three projects fall under the umbrella of Hellenistic Royal Coinages, a project funded by the NEH in 2017, and will conclude by 2020.Type Corpus to HoardsIn parallel with the development of OCRE, the ANS collaborated with Dr.Kris Lockyear of the University College London's Institute of Archaeology to create (with implementation by Gruber) an online database of Roman Republican coin hoards (CHRR, http:numismatics.orgchrr).11 This is based on Dr. Lockyear's personal research database (originally in MS Access; see Lockyear 2007), which is a substantially enlarged version of a print volume (Crawford 1969).Published in 2013 and consisting mainly of hoards of exclusively Roman Republican materials, approximately 10% of the hoards also contained early Augustan coin types (Lockyear and Gruber 2013).Initially CHRR drew on machine-readable data provided by OCRE's APIs for Augustan types and Nomisma.org to extract Republican coin type data to facilitate geographic and statistical analyses, but now it extracts data from CRRO's APIs for Republican data (with the Nomisma IDs having been deprecated following the publication of CRRO). Lockyear's cataloging burden is now significantly lowered since the responsibility for long-term maintenance of Roman Republican and Imperial coin type data falls into the domain of the editors of those online corpora.OCRE and CRROs' data APIs enable CHRR to extract machine-readable data in real-time in order to render HTML pages (see e.g., Fig. 6a), generate GeoJSON and KML for maps and timelines (the distribution of types within a hoard over time and space), and facilitate a wide variety of quantitative analyses. Similarly, the Linked Open Data for these hoards are ingested into the Nomisma.org SPARQL endpoint, enabling the mapping of the distribution of findspots for specific types directly within OCRE and CRRO (see e.g., Fig. 6b).Taking this one step further, these find-spot data apply to any distinct Nomisma-defined concept connected to published typologies.Map 1, above, displays the geographic distribution of denarii by means of physical specimens linked to denarius types defined in OCRE and CRRO and their individual findspots or by Roman Republican coin hoards with type URIs linked to nm:denarius. The distribution of hoards will be greatly enhanced once Coin Hoards of the Roman Empire is ready for publication as LOD.Fig. 6a. CRRO typological data deployed in the description of the contents of the Amnas (Romania) hoard. (Romania; AMN, Coin Hoards of the Roman Republic, accessed October 26, 2020, http:numismatics.orgchrridAMN.)Fig. 6b.Combined CHRR and PAS findspot data for RRC 2861. (RRC 2861, Coinage of the Roman Republic Online, accessed October 26, 2020, http:numismatics.orgcrroidrrc-286.1.)Type Corpus to CollectionsThere are also obvious benefits to establishing links from typological records published in OCRE and similar projects to individual specimens housed in public collections. The practice of assigning unique URIs to individual objects, now recommended by the International Council of Museums, and adopted by the majority of major collections, allows for stable connections to be built between those objects and typological records that describe them.So, for example, a coin type record can link to multiple instances of that coin type held in multiple collections or archaeological datasets (although in actuality, the link is from the specimen to type within the underlying LOD). Fig. 7, for example, shows the CRRO record for RRC 2861, with references to 102 specimens of the type from 12 different collections, from large national collections such as the ANS and British Museum to small ones such as Rutgers University and the Fralin Museum of Art at the University of Virginia, as well as numerous coins registered in the PAS.Fig 7. A selection of physical specimens identified as RRC 2861. (RRC 2861, Coinage of the Roman Republic Online, accessed October 26, 2020, http:numismatics.orgcrroidrrc-286.1.)Through the ingestion into the Nomisma SPARQL endpoint of the specific characteristics, such as the weight or die axis of each specimen, it is possible to create tools to analyze the characteristics of individual types or of coins issued in particular places or by specified emperors (see Fig. 8a). Analysis can also be carried out on the generic characteristics of types using a similar set of set of filters.See, for example, Fig. 8b, which compares the frequency of the depiction of deities on the coinages of Augustus and Nero. OCRE, CRRO, and other individual type corpora enable these statistical visualizations among types within their own series, but we are beginning to build user interfaces in Nomisma.org itself to enable analyses more broadly across all periods and cultures of coinage. For example, it is possible to visualize the change in average weight of denarii between the late Roman Republic and early Empire, a question that cannot be asked of data and user interfaces within OCRE or CRRO exclusively.Fig. 8a.The change in weight of denarius (blue) vs. antontinianus (red) from 30 to 300 derived from OCRE-linked coins.The gradual decline in weight (silver content) is apparent during the Crisis of the Third Century.Fig. 8b. OCRE-generated comparison of coin types of Augustus and Nero.Type Corpus to Coin FindsGiven the huge numbers of coins that are now being recorded by schemes across Europe, there is obviously huge potential to ingest the details of these coins into Nomisma.org for query and visualization in online type corpora. In this case it is not just the physical characteristics of the specimens concerned, but also their findspots which serve as the basis of enhanced analysis through mapping.Fortunately the price of admission to the Linked Data community for Roman numismatics is low.Existing projects, with, in some cases, well developed and longstanding databases of finds do not need to change their recording practices or software. So long as their data can be mapped to Nomisma and type corpus URIs when they are exposed to the Web, then the finds may enter the graph of numismatic data on the Web.The UK's Portable Antiquities Scheme has been using Nomisma URIs since at least 2011.The Antike Fundmu00fcnzen Europa and Finds of Roman Coins in Poland projects were integrated into the numismatic linked data cloud in 2015 and 2017, respectively.Moreover, the exchange of data is potentially a two-way street. These ANS-published type descriptions are fully and freely downloadable, and may serve to populate other databases, without the need for their creators to redo the work of cataloging that has already gone into the creation of the type record.Just as now few librarians catalogue books from scratch, so in the future there will be little need for the cataloguer of coins to generate new descriptions of coins long known.Linked Open Data Architecture, AppliedHow does Linked Data help in technical terms? The most efficient method for maintaining the relationships between coin types and their associated coins and hoards is with the use of an RDF database and SPARQL endpoint.Type corpora published in the Numishare platform (e.g., OCRE) directly query the endpoint to deliver some types of services.In other cases OCRE interacts with REST APIs offered by Nomisma (simple web service interfaces which conduct more complicated SPARQL queries in the background). The second, SPARQL-aware version of OCRE was released in October 2013.12 The RDF requires three components of data: first, RDF representations of coin types, second RDF descriptions of physical coins or coin hoards, and finally, the RDF data of concepts defined by Nomisma.org, which enables links to be made from typological attributes (e.g., http:nomisma.orgidar for silver coins or http:nomisma.orgidaugustus for those of Augustus) between types and coinshoards. The RDF model conforms to the numismatic ontology and Metadata Application Profile established by Nomisma.It is relatively simple, especially compared with CIDOC-CRM, and lowers the barrier for participation in these type corpus projects.To date, more than 30 organizations are contributing coin specimens, types, finds, andor hoard data to the Nomisma.org numismatic research ecosystem.We can see the relationship between ideal type descriptions and individual specimens more clearly by looking at an example. Additional hoard or findspot information may be added, as well as International Image Interoperability Framework (IIIF) service metadata (to be described in the section below).This simple model for translating numismatic metadata into Linked Open Data utilizes several Nomisma-defined ontology properties, but also implements Friend of a Friend (FOAF), Dublin Core Terms, and Vocabulary of Interlinked Datasets (VoID).14Note that the RDF description of this object in the Berlin collection does not explicitly denote its material (silver), denomination (denarius), or other typological attributes. Like a relational database, the Nomisma LOD graph enables queries by these attributes by the association between the coin and the coin type by means of the nmo:hasTypeSeriesItem property.Practically speaking, how does this affect OCRE?Rather than updating records in OCRE when the collections of new partners become available, the RDF database stands apart, making it easier to update Apache Fuseki with new collections and manage changes or deletions in collections already contained in the system. Therefore, when Nomisma gains a new partner, these coin data and associated findspots, images, and measurements become available immediately upon ingestion into the endpoint.Using SPARQL, OCRE (through the Numishare application code) can query Fuseki to display images of coins associated with particular types in record or search results pages. SPARQL query results can be serialized into KML and GeoJSON directly and displayed in maps, making it possible to make use of findspots from online coin hoard catalogs. Using mathematical functions inherent to SPARQL, average weights of coin types or specific typologies (e.g., denarii of Augustus) can be delivered to OCRE directly and rendered in the form of charts and graphs (Fig. 8a) by the Javascript library, Highcharts, which is capable of interpreting this data into HTML5 graphics.15Participating in the Numismatic Linked Open Data EcosystemThe Nomisma project has maintained a documentation section on its website with basic details on how to model basic specimen data into RDF16 While we have yet to write a formal Metadata Application Profile that details each class and property in the Nomisma data model and their specific semantic meanings, the basic principles for contributing to the numismatic LOD cloud are fairly straightforward:According to the basic principles of the Semantic Web and recommendations for museum objects from ICOM, each coin must be available at a distinct URI. Ideally, the URI should follow the Clean URL pattern: there should be no portions of the URL that are distinct to particular software platforms (like a '.php' or other programming-specific file extensions) or request parameters (variables passed in the URL following the '?' character).17 An example of a Clean URI is a coin in the ANS collection: http:numismatics.orgcollection1944.100.51606.The accession number forms part of the URI, and the collection namespace is stable regardless of software platform (there have been three frameworks used for the online collection since 2010).At present, we are only ingesting physical specimens related to published type corpora, and we only have the capacity to ingest specimens whose type attribution is clear and completely certain. Therefore, each coin contributed to Nomisma.org should have one nmo:hasTypeSeriesItem linking to a coin type URI in OCRE, PELLA, etc.There are some exceptions to this rule, as there is overlap between Hellenistic type catalogs.Early Seleucid coins struck in the name of Alexander the Great may appear in both PELLA and Seleucid Coinage Online, so it is possible to have more than one URI, but in different corpora.Every coin must have a human-readable title (although it can be automatically generated), but images, measurements, and findspots are optional.The Nomisma Data ModelThe How to Contribute Data page (http:nomisma.orgdocumentationcontribute) on Nomisma.org will contain the most up-to-date documentation on the Nomisma data models for contributing numismatic objects (coins, medals, tokens, etc.). Fig. 9 is an illustration of a typical model for a coin, although there are several additional properties that may optionally be applied. A full definition of the required and optional properties is as follows:Coin URI: encoded differently in various RDF serializations: XML, JSON-LD, Turtle, etc.Nomisma.Coin Hoards of the Roman Empire will be published into Nomisma eventually. [optional]Other measurement properties such as depth (thickness), minimum and maximum diameters, height, and width are defined in the Nomisma ontology, although at present no contributors have used these properties.ImagesPhotographs of coins are typically published on the web in one of two ways: 1) the obverse and reverse photographs are merged into a single digital image file or 2) the obverse and reverse images are separate digital files, each with distinct URLs. Many organizations publish their digital images at varying sizes or resolutions.It is most common for collections to publish thumbnail images as well as reference images that are intended to be viewed in the pages for individual object records (typically 400-600 pixels in a particular dimension).The following RDF metadata defines this dataset:<http:coins.lib.virginia.edu> rdf:type void:Dataset ; dcterms:description The Fralin Museum of Art at the University of Virginia numismatic collection contains about 600 coins of mainly Greco-Roman origin.This paper, a revision and enhancement of a work published in 2014 by the Institute for the Study of the Ancient World in its ISAW Papers series, illustrates a current State of the Field of digital numismatics. Since its original publication there have been numerous significant enhancements in the data models and ontologies, as well as the information architecture of the platform over the last four years.While the paper has focused on the implementation of Linked Open Data principles as applied to coin types, specimen collections, and findhoard databases (and how to contribute more specimens to these growing aggregations), it has not touched on some other areas of recent or future advancement. The ANS has sought to integrate its library and archival holdings more seamlessly into the numismatic research data ecosystem, the topic of a publication at Computer Applications in Archaeology 2016 and the Oxford-Paris Alexander conference in 2017 (Gruber 2016 and 2018).In the future, we will see the publication and network analysis of Greek monograms as part of the Hellenistic Royal Coinages project, and, relatedly, the application of IIIF methodologies for the annotation of images with the URIs for these monograms. Nomisma partners in Berlin and Sicily are working on new ways of iconographic classification through hierarchical concepts, moving away from the traditional text-based (and highly variant) mode of describing types.Colleagues in Frankfurt are beginning to experiment with machine learning and computer vision for identification and classification, made possible by rigorously curated, semantically structured numismatic Linked Open Data."
}