{
  "articleId": "isaw_paper18_5",
  "text": "ARTICLE_ID: isaw_paper18_5\nISAW Papers 18.5 (2020) Within the remit of “Cult Practices in Ancient Literatures,” this study investigates Egyptian ritual practices, which could be termed “magical,” described in Egyptian literature, as compared with those prescribed in magical texts. I interpret the theme here not so much in the Egyptological sense of Egyptian “cult,” i.e., rituals practiced in a temple or funerary context for the benefit of a deity/deities or a deceased individual, but in the sense of the rituals themselves, by using an approach that seeks to understand how the narrative presentation of these rituals – for the benefit of a living individual – informs how they were conceptualized as working. Thus, this study provides the first close treatment of the magical practices that are described in the Demotic tales known as Setne I and Setne II, as compared with those prescribed in the so-called Demotic and Greek magical papyri.1 That is to say, this study approaches the question as to how the narration and thereby conceptualization of magical practice is presented in tales very much about magical practice, texts, and their practitioners, as compared with the extant magical texts themselves, in a contemporaneous socio-cultural and temporal milieu that would have included the authors, redactors, and audiences of these tales, as well as the practitioners and primary clientele of magical texts. In the methodological introduction of the “Egyptian and Jewish Magic” Conference in Bonn of July 2015 by Rita Lucarelli and Gideon Bohak, it was stated that from the Egyptian perspective “there was no need for an emic term for ‘magic,’ ‘magician’ or ‘magical texts,’ since there was no need to condemn them.” This statement can be further refined to specify that there was often little need for an emic term because an opportunity also rarely surfaced in which to describe them. After all, a mundane comparison, such as a modern narrative featuring a character preparing and eating dinner, would not necessarily describe the process by which the character acquired all its constituent ingredients, prepared them, cooked them – and how this works in terms of chemistry, and the physiological and neurological outcome of becoming satiated –, but simply that he made dinner and as a consequence, ate. By extension of this metaphor, a narrative description of magical practice would not detail the contents of the magical texts, but – broadly speaking – simply the process and outcome. In addition, as is evident from the close philological treatment of the magical episodes in the tales of Setne I and II and the contemporary magical texts in Demotic below, there were distinct emic terms for “ritual power,” “practitioners of ritual power,” and “texts of ritual power,” because the tales provide extrinsic descriptions of, and the extant magical texts intrinsic instructions for, magical practice in the Egyptian language. Thus, these tales provide terminology and descriptions, i.e., the conceptualization and the conceptions themselves, of magical practice and practitioners not attested in the magical texts themselves. In what follows, I will first elucidate this premise (§1), before I treat the context of the “Setne Cycle” and so-called Demotic and Greek magical papyri (PDM and PGM) in the Roman Period, i.e., the “temple priestly milieu” (§2).2 In the subsequent sections of this study, I will discuss the narration, description, and thus conceptualization of “literary” practitioners (§3); the lexical conceptualization of magical practices in Setne I and II as compared with in Demotic magical texts (§4); and the lexical conceptualization of the manuscripts, texts, and “textual authority” behind magical practice as presented in those sources (§5). The final section will provide a summary of the resulting implications of this discussion (§6). § 1 Premise Because every student of Demotic will have read the tales known as Setne I and Setne II at least in part, it is possible that few have gone on to study these tales in their own right;3 or perhaps because these tales have been known for more than a century, and therefore they have already filtered into the wider Egyptological discourse of “Ancient Egyptian literature,” it may be that a close study of elements of their textual content has only been undertaken to a limited degree.4 A similar absence is evident – excepting the case studies made by Ritner in his formative treatment of the “Mechanics of Ancient Egyptian Magical Practice” and Dieleman’s study of a decade ago – in the treatment of magical texts written in Demotic in the area of “Ancient Egyptian magic.”5 The accumulated weight of these two seminal discussions has produced both the means and momentum for growing interest in magical texts, whether written in hieratic, Demotic, Greek, or Old Coptic, for their own sake. Against such a background, the concept behind this study arose from the realization that the tales of Setne I and Setne II, as secondary evidence for magical practice, texts, and their practitioners, could be treated alongside the primary evidence for magical practice, i.e., extant magical texts, as a way of investigating how magical practice, texts, and their practitioners were conceptualized. A further aim is to discover how magical practice was narrated, and thereby described, in the milieu in which it was also practiced.6 When coupled with descriptions of magical practice, and of where their efficacy stemmed from, and who was able to practice magical texts, this would reveal how magical practice was conceptualized in both “literary” presentations, e.g., in Setne I and II, and “literal” attestations, e.g., in extant magical texts. Furthermore, while Setne I and II have been seen as being part of a literary cycle that circulated – along with other tales – between the Late Period and the Roman Period, the extant copies of Setne I and II date from the late Ptolemaic and Roman Period, a time frame in which scholarly consensus understands literacy in traditional Egyptian scripts to have been increasingly restricted to the temple priestly milieu. That is to say, the temporal frame of the Roman Period predicates that the primary redactors and audiences of theses Demotic tales, as well as the sole practitioners and primary clientele of Demotic magical texts, would have been individuals within the temple priestly milieu.7 Hence, in the context of literacy in traditional Egyptian scripts during this late period, one can treat magical practice, texts, and their practitioners as narrated and conceptualized by individuals who were also the redactors, transmitters, and practitioners of extant magical texts. The tales of Setne I and II, however, as with almost any tale, contain both literary and fantastical elaborations, and therefore, when treated alongside extant magical texts, it is evident that the majority of the magical practices which are narrated, and therefore whose outcomes are described, in these tales do not reflect those practicable by contemporary “literal” practitioners. They were, as such, “literary” and therefore perhaps considered either “fictitious fantasies,” or maybe even “historical fictions,” i.e., “legends,” that were beyond the scope of practitioners who constituted part of the audience of Demotic literature in the Roman Period. Thus, this study will not attempt to understand magical practice, texts, and their practitioners exclusively in the context of this literary sphere, but as a way in which to understand how the narration, and therefore description, of these phenomena reveals the emic terminology, and therefore typology, of “literal” practices, texts, and their practitioners. Hence, this study is not a descriptive summary of the content of Setne I and II and in which of their episodes similarities with, or parallels to, other literary tales or magical texts from Egyptian textual culture can be identified; rather, it proceeds from a close philological reading of both the tales and magical texts, in order to produce a direct analysis of the emic categorization and conceptualization of magical practice, texts, and their practitioners.8 §2 The Context of the “Setne Cycle” and the so-called PDM and PGM in the Roman Period: The Temple Priestly Milieu By the Roman Period, with Greek serving as the lingua franca of Egypt, the use of Demotic in the production of documentary texts, in broad but not absolute terms, had obsolesced, resulting in Demotic following its predecessor hieratic and becoming increasingly restricted in its use to the temple priestly milieu, to the institutions to which the education of the traditional scripts for rendering the Egyptian language in a written form was limited.9 Therefore, as the only Demotic literates, individuals trained within and associated with the temple priestly milieu were the only potential redactors, performers/reade rs, and audiences of Demotic literature, as well as the only redactors, practitioners, and the primary clientele for magical texts written in any and all stages of the Egyptian language. Hence, we see a situation in which the temple priestly milieu redacted and/or composed both narrative tales about (“literary”) magical practitioners as well as magical texts of which they were the (“literal”) magical practitioners.10 §2.1 The “Setne Cycle” Although Tait has expressed caution towards anything but a minimalist approach to the interconnectedness of our evidence regarding the tales attesting to a character named “Setne/Setme,”11 the majority of Egyptologists who have studied Setne I and/or II freely refer to a “Setne Cycle.”12 Regardless of whether the tales interconnect, and if so, in what way, it is clear that a number of them featured similar characters that are attested from the Late to Roman Period, and therefore must be part of an extended literary tradition, of which Setne I and Setne II (so-called exclusively due to the order in which they were edited and published) are but the best known and most completely preserved examples.13 Several more tales are known involving the anti-hero referred to as Setne/Setme (an epithet itself deriving from the setem-priest, stm also sm) of Egyptian tradition, who, in Setne I, is identified with Khaemwaset, the fourth son of R amses II (1279–1213 bce).14 Although brief summaries of the relevant episodes in Setne I and II are given below, the detail in which the passages relating to magical practices are treated leads me to advise that readers first familiarize themselves with their content through one of the published translations (cited for each tale below). Setne I is primarily attested by Cairo 3064615 (TM 55857), a manuscript likely from the region around Thebes and whose date is equally ambiguous, although it is considered to be Ptolemaic.16 The title of the tale, however, has been preserved; and the episode that concerns this study constitutes the first section of the preserved episodes, the beginning of which has been lost.17 The narrative frame to this episode concerns the anti-hero Setne, who hears from an old priest18 about a “papyrus (bookroll)” (ḏmꜥ),19 which Thoth, the god of writing and knowledge, wrote with his own hand20 and which contains two unparalleled texts. Setne sets out to the tomb of Naneferkaptah (a deceased son of Pharaoh and custodian of the papyrus), where he meets the transfigured spirit of Ihweret (Naneferkaptah’s wife), who tells Setne about the woes they suffered as a result of her husband’s desire to learn the texts in the papyrus and to possess it himself. Ignoring her warning, Setne takes the papyrus from Naneferkaptah and Ihweret, resulting in a number of strange happenings that concern the final episodes of the tale before the papyrus is returned to the tomb from which it was taken. Setne II is attested by BM EA 1082221 (TM 48854), a manuscript perhaps from Crocodilopolis near Gebelein, and acquired in Aswan,22 which has been dated to the 1st century ce.23 As with the manuscript that preserves Setne I, the end of this manuscript is preserved, but, in this case, no title was inscribed.24 The tales preserved again concern the anti-hero “Setme” (hereafter, Setne), who, after an episode regarding his adventures in the Underworld with his son, Siusire, is summoned by Pharaoh to oppose a “Kushite ‘sorcerer’” (ꜣte n igš), who has arrived at court with a challenge to read a rolled and “sealed” (tbꜥ) “letter” (wḫe). It is not Setne, but his son Siusire, a “boy” (h̭m-ẖl) who was “immature” (sbḳ), having supposedly not yet “mastered himself” (mḥ r-ḥr=k) – who, as a Wunderkind, successfully read the rolled and sealed letter, which described a story of Kushite “sorcerers” and an Egyptian “‘magician’” (ḥr-tb). The narrative then continues as a story within a story, before it is revealed that the boy Siusire is in fact the reincarnation of the Egyptian magician in that story. He then proceeds to duel with the Kushite “sorcerer” and his mother, winning, and thus restoring order by redeeming Pharaoh and thereby Egypt.25 Fragments of other tales relating to a character called “Setne,” as well as to other characters that can be linked to those either in Setne I or II, are also known. Cairo 30758 (TM 55860), likely from Gebelein and dated by its editor to the first half of the Ptolemaic period, involves an unnamed Setne and a character called Ptahhotep;26 while Cairo 30692 (TM 55858),27 of the same date and provenance, also features similar diagnostic elements.28 Dem. Saq. 1 (TM 56123),29 dated by its editors to the beginning of the Ptolemaic period, features an unnamed Setne and one Ptahhotep “the Setne”, the twist being that because the former is represented as in mourning, he cannot therefore be a character with the same “central role” as Setne Khaemwaset in Setne I and II.30 Carlsberg 207 (TM 56084), from Tebtunis and dating to the Roman Period, is written on the back of an agricultural account in Greek, features an unnamed Setne “playing a similarly central role” as the son of Pharaoh, but not necessarily being Khaemwaset.31 Marburg Inv. 38 (TM 115825) is a papyrus from cartonnage; the Greek documentary text on the recto dates the text to the middle of the Ptolemaic period, making it earlier than the attestations of both Setne I and II.32 Finally, predating all of these examples is CVI AB (TM 89516),33 an Aramaic papyrus fragment in the British Library apparently from Saqqara34 and dated to the third quarter of 5th century bce.35 This tale narrates the escapades of Horus-son-of-the-wolf (ḥr-pa-pꜣ-wnš), who has been identified with Horus-son-of-Paneshe from Setne II.36 In addition to this manuscript, Zauzich noted the existence of 15 Demotic fragments, in at least three different hands, in the papyrus collection in Berlin, which preserve glimpses into the escapades of one Horus-son-of-the-wolf. These are part of a parallel set of cycles about the Re priests from Heliopolis rather than the high priests from Memphis, whose protagonists had to contend with similar adversaries – not least the “ruler” (kwr) of Meroe. Other elements, such as the so-called Book of Thoth and production of ritual paraphernalia from wax also feature in these fragments. These Demotic attestations, alongside the Aramaic version, demonstrate that “Demotic literature” did not belong only to the temple priestly milieu of the Roman Period – the context of this study – but also to an “international audience,” since it is attested in the “lingua franca of a cosmopolitan empire that stretched from India to Nubia,” i.e., Aramaic.37 §2.2 The so-called Demotic (PDM) and Greek magical papyri (PGM) Rendered in both Egyptian and Greek (the former of which is written in either Demotic, hieratic, or Old Coptic scripts), the Graeco-Egyptian magical papyri are a bilingual corpus of magical texts featuring spells in each language and composite recipes in both.38 During the temporal frame in which the Graeco-Egyptian magical papyri are principally attested, i.e., from the 2nd to 4th centuries ce, there was a relatively fluid tradition of translating magical texts to and from Egyptian and Greek, as well as also within the language stages of Egyptian. The manuscripts in which these texts are preserved include everything from amulets or loose leaves of papyrus, or even an ostracon (“activated texts” for the benefit or to the detriment of a named individual), to compilations of loose leaves of papyri, papyrus bookrolls, and codices, which can feature dozens of magical texts of various practices, from cursing to erotic spells, divinations to exorcisms. An important caveat, however, is that this corpus is a scholastic construct, whose heuristic value is questionable; and therefore, while the tradition in which the magical texts from the Roman Period extant in Demotic are part of this phenomenon, the context of their production, transmission, and practice is instead bound to those papyri which have been attributed to the so-called “Theban Magical Library.”39 This archive included three of the four so-called Demotic magical papyri; London-Leiden “PDM xiv” (BM EA 10700 + Leiden I 384 verso = TM 55955), Leiden I 384 verso “PDM xii” (TM 55954), and Louvre E 3229 “PDM Suppl.” (TM 64218), the fourth being BM EA 10588 “PDM lxi” (TM 55956).40 Assuming that the episodes featuring magical practices in Setne I did not disappear after the Ptolemaic Period (the date of the extant manuscript) and that the so-called “Demotic magical papyri” (dating to the second half of the 2nd century or early 3rd century ce) are the successors of a tradition that ended with the obsolescence of traditional Egyptian scripts, this study will undertake a comparison of the magical practices in the primary and secondary sources for magical practice, texts, and their practitioners, in the Roman Period. In this period, as noted above, the consensus among Demotists is that no individuals outside of the temple priestly milieu would have had the knowledge, whether in language, script, or magical and religious content, to produce and practice such ritual texts – even while there is, of course, also no conceivable context for the redaction and transmission of Demotic literature other than a milieu of Egyptophone Demotic literates. §3 Narration and Conceptualization of Magical Practitioners As an approach to the question of whether the magical practitioners in Setne I and II are at all representative of the practitioners that would have existed in the contemporary milieu of the audiences of these tales, this section will treat the identities of the characters, their titles, the discrepancies between the two tales, and the broader observations that can be drawn from these identifications, in order to establish whether these tales lionize earthly (“literal”) or legendary (“literary”) practitioners.41 §3.1 Literary vs. Literal Practitioners in Setne I It is important to begin by highlighting that Naneferkaptah and Ihweret, both of whom practice magic in Setne I, were children of Pharaoh Merenptah (Mr-nb-ptḥ) (Cairo 30646 4/6).42 By comparison, Setne Khaemwaset (Ḫꜥ-m-wsr(.t)) (5/4; 5/7) has a “foster-brother” (sn n mn-iri.t) Inaros, who is the son of Pharaoh Ramses II (Wsr-mꜣꜥ.t-rꜥ : 5/4; 5/7), Merenptah’s historical father and predecessor, while Setne himself only refers to his father as Ptah in a classically supplicatory way (4/31). Hence, whether conceived of by the contemporary audience as historical, pseudo-historical, or legendary characters, the protagonists in Setne I are all royal, i.e., not simply priests in service. In Setne II, Setne, perhaps Khaemwaset (BM EA 10822, 2/33), is the son of Pharaoh Ramses II (ws(r)-mꜣꜥ.t-rꜥ), while Setne’s son Siusire is revealed to be the reincarnation of an ancient “‘magician’” (ḥr-tb)43 Hor-son-of-Paneshe (Ḥr-pa-pꜣ-nše), who can enchant/traverse the earth and the Underworld at will: “he [became superior] (i.e., in knowledge) to the scribe who was set [to] give instruction to him. The [child Siusire] became […] of saying religious secrets(?) with the scribes of the House of Life (nꜣ ⌈sẖꜣ.w⌉ ⌈pr-⌉ꜥnḫ)” (1/12), i.e., a very learned and well-read individual, given that “it happened that there was no [scribe who was superior(?)] to him in Memphis in pronouncing writings which ‘take-pledge’.” (sẖꜣ nty ṯꜣy⌈-ꜣwṱ⌉: 2/27).44 In addition, Siusire had the ability to read the texts written upon sealed scrolls without unrolling them, even without the aid of any magical practice (3/19–22), i.e., he had some inherent ability that – if learned – was not specified as having been such in that tale. As for Siusire’s manifestation as Hor-son-of-Paneshe, “there is no other fine and wise scribe like Hor-son-of-Paneshe,” while “another will not exist after him ever again” (7/6–7). On balance, the protagonists of Setne II are either royal, or royal and divine, due to Siusire’s status as the reincarnation of a transfigured deceased.45 By comparison, the protagonists in both Setne I and II are also given titles and epithets. The former (“title”) here designates terms that would also have been used to apply to worldly, i.e. “literal” rather than “literary,” individuals, and the latter (“epithets”) are terms that have not been attested for worldly individuals. In Setne I, the epithet “fine scribe” (sẖꜣ nfr) 46 is applied to Naneferkaptah likely twice,47 as well as to Setne once (4/27–28). By comparison, Setne is referred to once as a “wise man” (rmṯ-rḫ: 4/37)48 – a worldly designation –, and it is only Naneferkaptah who is described once as a sẖꜣ nfr rmṯ-rḫ (4/21; usually rendered a “fine scribe and wise man,” but perhaps better understood here as meaning a “wise and fine scribe”)49 and twice as a “very wise and fine scribe” (sẖꜣ nfr rmṯ-rḫ m-šs: 4/3, 4/24). Thus, Setne is the only character to be referred to with a designation also used of individuals in the worldly sphere,50 whereas Naneferkaptah’s are exclusive to the literary and divine sphere.51 §3.2 Literary vs. Literal Practitioners in Setne II By comparison, in Setne II, the titles given to the practitioners are notably different. First and foremost, although “wise and fine scribe” (sẖꜣ nfr rmṯ-rḫ) is used once to refer to Hor-son-of-Paneshe (7/6–7), it is also used generically five times to refer to a hypothetical practitioner who is required in order to defeat the adversarial Kushite “sorcerer,” so that the “shame/humiliation” of Egypt will not be taken to Nubia ([2/31], 2/32; 3/2, 3/14; 6/36). What is more, the term “very wise man” (rmṯ-rḫ m-šs) is used to refer to the very same Hor-son-of-Paneshe (5/3), yet he is otherwise never referred to by a worldly designation.52 The significantly different lexicon employed in Setne II, however, also relates to the fact that Hor-son-of-Paneshe is given the title of “magician” (ḥr-tb) on several occasions (5/3, 5/10, 5/17, 5/18; 6/14), while his adversary – the reincarnation of his adversary Hor-son-of-the-Nubian-woman – whom he faces when incarnated as Siusire, is referred to throughout as the “Kushite ‘sorcerer’” (ꜣte n igš: 2/29; 3/2, 3/13, 3/25, 3/26, 3/29–30, 3/32; 4/3, 4/9; 6/13, 6/15, 6/21). §3.3 Literary vs Literal Practitioners in Setne I and II As highlighted in the premise above (§1), emic terms for “magical practitioner/practitioner of magic” are used throughout the episodes featuring magical practice in Setne II and they present strong, and fundamental, insights into the conceptualization of magical practice by the author(s), redactor(s), and audience of Setne II. Unlike his adversary, Hor-son-of-Paneshe, was described as “the one who practices ritual power” (pꜣ nty iri ḥyḳ: 5/36; 6/7, 6/11), “the one who will practice ritual power” (pꜣ nty-iw=f (r) iri ḥyḳ: 6/13), “the one who practices written ritual power” (pꜣ nty iri ḥyḳ sẖꜣ: 6/6), and “the scribe of the house of life who practices ritual power” (pꜣ sẖ pr-ꜥnḫ nty iri ḥyḳ: 6/8). These designations for “magical practitioner” must have prompted a conceptualization of an individual who is able to access, manipulate, and thereby use “ritual power” (ḥyḳ) in order to bring about the desired outcomes for which the ritual was practiced. The fact that this was only a possibility for an Egyptian “magician” (ḥr-tb) rather than a “Kushite ‘sorcerer’” (ꜣte n igš) has much to do with the semantic distinctions differentiated unambiguously in Setne II between how “ritual power” (ḥyḳ) could or was permitted to be manipulated. The implications of this distinction will be discussed in full below (§4). The differences in the terminology used to describe the literary practitioners of magic in Setne I and II can be understood first and foremost by nature of the narratives in which they feature. Emphasis on the “magical practitioner” in Setne II relates to the fact that this narrative, in comparison to Setne I, has to describe that the Egyptian was practicing ritual power in order to predicate the outcome that was then described in the narrative, or that a Kushite ‘sorcerer’ has to describe what the Egyptian “magician” does in order to make him a viable threat and thereby a target. An implication of this distinction is that the titles or epithets of “fine scribe” (sẖꜣ nfr), “(exceedingly) wise man” (rmṯ-rḫ (m-šs)), or “(exceedingly) fine and wise scribe” (sẖꜣ nfr rmṯ-rḫ (m-šs)) were not designations that described their own functions, i.e., what they were able to do. Instead, a description of what individuals with such titles or epithets could do was essential for the conceptualization of the magical practices, whose outcomes – but not whose processes or practices – were described in the narrative. To extend the metaphor introduced above (§1), the next conceptual step suggested by the various orthographies for “the one who practices ritual power” (pꜣ nty iri ḥyḳ) would be equivalent to a character in that narrative being identified with a title or epithet that was ambiguous enough to suggest an education in, or access to, the knowledge required for the use of cookery books (with the caveat that cooking could only be undertaken by literates – itself being “applied philology”). When the product of preparing and cooking dinner was to be described in the narrative, but without featuring any description of the process, the character might instead be referred to as “the one who cooks.” Through this metaphor we are able to access the conceptualization of a “magical practitioner” from the perspective of an Egyptian audience, as well as inform our understanding of the semantic range, and therefore value, of the titles and epithets employed. As a result, the question which should now be asked is whether the audience of Setne I and II – while perhaps referring to each other as “wise men” (*rmṯ-rḫ.w), but likely not as “fine scribes” (*sẖꜣ-nfr.w) –, would have conceived of themselves as “magical practitioners” (*nꜣ nty iri ḥyk) with the same or similar abilities as the characters in Setne I and II.53 Hence, while this section has served to classify certain differences between the emic terminology used to refer to “literary” practitioners, and how this terminology may or may not have been applied in the worldly sphere of “literal” practitioners, only following a treatment of the lexemes used to describe the mechanics of their magical practices, and the texts and media upon which those texts were written, can a full understanding of this Egyptian terminology, and emic typologies, be elucidated. §4 The Lexical Conceptualization of the Mechanics of Magical Practice in Setne I, Setne II, and Demotic magical texts (PDM) One could argue that there is a stark difference between the “causality-attribution/-assumption” that must have occurred when the desired outcome of a practiced ritual correlated with an event whereby the desi red outcome of that ritual actually occurred, and most of the ritual practices and outcomes narrated in Setne I and II.54 A full treatment of the outcomes of the magical practices narrated, and therefore described, in Setne I and II as compared with those attested in, and therefore prescribed by, Demotic magical texts was undertaken for this study, but can only be summarized here. The aim of that study was to differentiate between magical practices whose outcomes could have conceivably occurred in the lived experience of the contemporary audience, or even been the result of a practice undertaken by “literal” practitioners, and those which are simply beyond the lived experience of any human, and were reserved to the sphere “literary” practitioners. That is to say, there are magical practices described in the Setne I and II which are not prescribed in Demotic magical texts, a dichotomy which is also evident in Blackman’s early anthropological study of magical practices witnessed by, and magical practices narrated to, her as summarized in her chapter on “Magicians and Magic” (2000: 183–200). Needless to say, the literary tropes and literary license used by the authors and redactors of Setne I and II were predominant when compared with the narration of practices that might otherwise be found among extant magical texts. Therefore, of greater value when trying to ascertain how magical practices were conceptualized in the “literal” sphere as attested in magical texts, and “literary” sphere as narrated in Setne I and II, is a treatment of the terminology, and therefore typology, of these magical practices, and how they were described and practiced – and thereby conceptualized – in their authors’ and audiences’ own language. While this study aims to build upon the seminal work of Ritner on the mechanics of magical practice, it should first be stressed that Ritner’s work has gone further than any other in treating the individual emic terminology used by ancient Egyptians both in literary texts that describe, and magical texts which instruct, magical practice.55 Therefore, the intention here is to focus in on the terminology used in Demotic, and highlight the disparities not only between Setne I and II, but also between the “literary” description of magical practice and how this is similar or dissimilar to the instruction of magical practice in the “literal” examples of extant magical texts. §4.1 The Lexical Conceptualization of the Mechanics of Magical Practice in Setne I Within the aforementioned “papyrus which Thoth wrote with his own hand” were “two written formulae” (hp 2 n sẖꜣ: Cairo 30646, 3/12). With the first, Naneferkaptah was able to “enchant/traverse” (pẖr) the sky, the earth, the Underworld, the mountains, and the seas, as well as find out what the birds of the sky, the fish in the midst, and the beasts of the desert, say. After reciting the second, Naneferkaptah is described as seeing Pre/Ra appear in the sky with his Ennead, the rising of the moon, and the stars in their forms, as well as seeing the fish in the midst, which had 21 divine-cubits of water upon them – the old priest specifying that this is whether he is in the West or still in his form upon the earth. The Egyptian term hep (hp) has been discussed on multiple occasions because of its broad semantic range, yet predominant judicial connotations in certain contexts.56 A consensus that has emerged from this discussion is that “customary law” can be understood in the sense of the upholding of expectation, whether in the pure “judicial” sphere, or in terms of cultural and social norms. Hence, and not so dissimilar from Ritner’s understanding of a hp n sẖꜣ as a “customary written pattern,” which derives from “customary patterns” of “activity,” the unparalleled efficacy of the two “written” hepu (hp.w) is the fact that they are evidently implied to have been written down – “canonized” – by Thoth himself, who has thereby “laid down” as formulae for the way in which all of the outcomes referred to in Setne I can be achieved. Through the ritual practices provided in the “papyrus which Thoth wrote with his own hand” the hepu (hp.w) were made tangible and therefore accessible and perhaps even comprehensible to a literate, for a “written hep/hep of/in writing” (hp n sẖꜣ) could be “recited” (ꜥš) and also copied and therefore transmitted again in written or oral form – thus serving as a formula for ritual practice. This is exactly what Naneferkaptah did, for it was the priest who first made him aware of Thoth’s hand-written papyrus and then suggested that Naneferkaptah would be able to recite/read (ꜥš) the hepu (hp.w) upon it (3/12–13, 3/14). This introduction early in the episode demonstrates both how practitioners were described as being able to access and therefore practice a “written” (sẖꜣ) hep (hp), which also reveals how the ancient Egyptians conceptualized a hep (hp), as well as practice magical texts more broadly, i.e., through their recitation. Accordingly, Naneferkaptah proceeds to “recite text(s)” (ꜥš sẖꜣ),57 which he does to overcome the guardians of the papyrus and thus acquire it, as well as to retrieve the bodies of his son, wife, and himself.58 However, when he is practicing the texts from Thoth’s hand-written papyrus explicitly, Naneferkaptah is described as “reciting” (ꜥš) a “written formula” (hp n sẖꜣ), which his wife Ihweret was also able to do.59 With the outcome of the latter practice being that both Naneferkaptah and Ihweret could “enchant/traverse” (pẖr) the sky, the earth, the Underworld, the mountains, and the seas,60 here it should be stressed that because the verb pẖr describes the outcome of a ritual practice, it does not – unlike ꜥš (“recite”) or iri (“practice”) – concern the process through which the practice was conceptualized as being brought about. §4.2 The Lexical Conceptualization of the Mechanics of Magical Practice in Setne II By comparison, the terminology used in Setne II, while not being dissimilar, is more extensive than in Setne I – likely by nature of the agency of “ritual power” (ḥyḳ) used throughout. Interestingly, given that it appears to be the only description of ritual practice that survives into Coptic, to “practice ritual power” (iri ḥyḳ) is not attested in Setne I, yet it is used to describe the very act of accessing and manipulating ritual power throughout Setne II.61 Fundamentally, this is a ritual mechanic used only by Egyptians, with Hor-son-of-Paneshe practicing both ritual power (5/31; 6/8) – as does Siusire (7/3) – and “written ritual power” (ḥyḳ sẖꜣ: 5/8). In one case, it is asked of Hor-son-of-the-Nubian-woman by his own mother whether he intends to go to Egypt in order to “practice ritual power” (iri ḥyḳ: 6/1) there, but – importantly – he is never actually described in the narrative as doing so in these terms, which are used to refer to ritual practice exclusively in an Egyptian context. However, both the Kushite “sorcerer” (6/13, 6/15–16) and Hor-son-of-the-Nubian-woman (6/17, 6/21, 6/30) are described as “performing (a) deed of written ritual power” (iri sp n ḥyḳ sẖꜣ), which is also undertaken by Hor-son-of-Paneshe (7/4). The lexical difference in this, however, is that it pre-empts a description of the outcome of the ritual practice, rather than the process itself, e.g., “practicing ritual power.” By nature of the fact that the practitioners, whether Egyptian or Kushite, perform “(a) deed(s)” of “written ritual power,” they are not themselves undergoing a process but producing an outcome. Hence, while only Hor-son-of-Paneshe is described as “practicing (a) written formula” (iri hp n sẖꜣ: 6/14–15), Hor-son-of-the-Nubian-woman is described as being able to “practice (a) written deed” (iri sp n sẖꜣ: 4/14–15; 6/32). Perhaps the distinction here is not coincidental but meaningful, in that while the “written formula” (hp n sẖꜣ) that features in Setne I cannot have had the same resonance in Setne II, given the “paradigmatic” nature of a “written formula” (hp n sẖꜣ), it is not something that would have been accessible and manipulatable by a Kushite.62 Hence, while to manipulate ritual power in its raw form is an exclusively Egyptian trait in Setne II, a “deed of written ritual power” is conceptualized as practicable by both Egyptian “magicians” and Kushite “sorcerers” alike, because it pre-empts the outcome of the practice itself, a distinction which is all the more relevant when the considerations below are treated. As attested in Setne I, the “recitation” (ꜥš) of “text(s)” (sẖꜣ) is prominent in Setne II, but only as used by Hor-son-of-Paneshe exclusively (5/5; 6/16, 6/22, 6/23, 6/27).63 Indeed, if it were not for the reference to the Kushite “sorcerer” or Hor-son-of-the-Nubian-woman “practicing” (iri) “deeds of written ritual power” (sp n ḥyḳ sẖꜣ), and of course the fact that it was the “sorcerer” who arrived at Pharaoh’s Court with a sealed letter in the first instance, one would be left wondering whether the Kushite’s “ritual power” (ḥyḳ n(-nꜣ) igš) was indeed literate at all. Certainly, in Setne II neither the “sorcerer” nor Hor-son-of-the-Nubian-woman are described as “reciting texts” or “reciting a written formula,” which is attributed once to Hor-son-of-Paneshe also (6/19–20).64 Unlike in Setne I, however, the reciting of texts is not described as fundamental to each and every ritual practice undertaken in Setne II; instead “ritual power” was accessed and manipulated at much greater liberty by – or due to the superior acquired learning of – Hor-son-of-Paneshe. In contrast to in Setne I, when Inaros is described as “giving the amulets” (⌈ty⌉=f ⌈nꜣ⌉ sꜣ.w r ẖe.ṱ Stne: 4/33) to his foster-brother Setne, in order that Setne might leap up from the ground into which he had been hammered by Naneferkaptah during their game of Senet, in Setne II, it is not the act of giving which is described, but the outcome of an amulet (sꜣ). Thus, the extended semantic range of “protecting” (iri sꜣ), which the “bookroll of magic” (mḏy n ḥyḳ) can achieve, is described by Thoth in Hor-son-of-Paneshe’s dream as being suitable for the protection of Pharaoh against the ritual power of the Kushites (5/14). The semantic range of the term sꜣ is then brought full circle by nature of the narrative, in which Hor-son-of-Paneshe is described as acting in accordance with everything he was told in his dream, travelling to Pharaoh, and making for him “an amulet of written ritual power” ([iri]=f n=f sꜣ [n nꜣ] ḥyḳ n-nꜣ sẖꜣ: 5/15). Hence, in Setne II both the outcome and the process of the ritual practice of “protecting” (iri sꜣ) through “amulets” (sꜣ.w) is described, as a result of which the lexical conceptualization of this assumed or attributed relationship of cause and effect can be discerned. Preceding this episode, the ritual practice of producing (mḥ, “filling”) amulets is described, in which Hor-son-of-Paneshe, having “recited (a) text(s)” (ꜥš=f n=f sẖꜣ), “filled an amulet” (mḥ=f n=f sꜣ) to protect Pharaoh from harm (5/5, 5/17).65 The secondary, yet nonetheless active, agency of hik, “ritual power” (ḥyḳ), is attested through the fact that it can “fly” (fy),66 both up to Egypt and down to Nubia, and “return” (sty),67 which the “ritual power of the Kushites” did when it was repelled by the protective practices undertaken by Hor-son-of-Paneshe. This active role which hik (ḥyḳ) is described as undertaking in Setne II echoes in part the way in which hik is manipulated by the Kushites, who – as noted above – do not “practice” (iri) hik, but “cast” (ḥwy) it.68 All three Kushite “sorcerers” featured in the episode within the sealed letter recited by Siusire before Pharaoh’s Court are described as threatening to “cast” their “ritual power up to Egypt”.69 In addition, Hor-son-of-the-Nubian-woman has the unique ability to “practice” (iri) and “cast” (ḫꜣꜥ) “signs” (tbꜥ.w) between himself and his mother, so that he will be able to summon her to him in times of peril (6/3, 6/5, 6/24–25). Hence, while the Kushites in Setne II are described as using entirely unique ritual practices, perhaps something that would have been conceptualized as “foreign” or “exotic,” fundamentally they interact within the same ritual sphere as the Egyptians. In some cases, for a similar outcome – although through different ritual processes – the Kushite can access and manipulate hik (ḥyḳ) – for there is no Kushite equivalent.70 §4.3 The Lexical Conceptualization of the Mechanics of Magical Practice in Setne I and II On balance, it is important to note that certain disparities between Setne I and II may not simply be due to the change in how ritual practices were described in literature during the century or more that separates the two extant manuscripts, nor to any type of inconsistency in how access to, and manipulation of, ritual power was conceptualized; instead, the different focuses of the episodes within the tales relate, in part, to their different protagonists. While there are a small number of semantic differences between Setne I and II with respect to which type of text was recited or practiced, the most significant difference is the absence of hik (ḥyḳ) in Setne 71 Likely a product of both the abstract outcomes of the magical practices “practiced” (iri) by the Egyptians and “cast” (ḥwy) by the Kushites, as well as the narrated duel between Hor-son-of-Paneshe and Hor-son-of-the-Nubian-woman in Setne II, hik (ḥyḳ), having been accessed and then manipulated – albeit through different ritual methodologies –, acted as a secondary agent. Hik (ḥyḳ) was able to produce outcomes without describing chains of cause and effect running between the practitioner who initiated the ritual practice, and the target of that ritual practice. Thus, the implication of this distinction provides significant contributions to our understanding of how hik (ḥyḳ) could have been conceptualized in the latest milieu in which it was understood. In addition, it provides insights that are essentially absent from the primary sources for magical practice and yet tell us how ritual power was conceptualized as being the agentive link, i.e., the manifestation of the “causality-attribution/-assumption,” between the “cause” of the ritual practice and the “effect” of the outcome which was ascribed to the practiced ritual. Hik (ḥyḳ), “ritual power”, was the causal process between cause and effect. §4.4 The Lexical Conceptualization of the Mechanics of Magical Practice in the PDM In order to complete a reconstruction from both secondary and primary sources of how the mechanics of magical practice were conceptualized as working, i.e., linking cause and effect, from the emic perspective, a comparison must now be made between how they were described in Setne I and II and how they were prescribed to the practitioners of actual magical texts. Foremost among the mechanics of ritual practice, as attested in Setne I and II, is to “recite” (ꜥš) texts. Whether as an instruction to the practitioner,72 his client, or the boy medium utilized in certain divinations, or being utilized as a reference to what the practitioner declares he will recite,73 or as a specification of what has to be recited by the practitioner,74 the act of “reciting” is by far the most fundamental among attested mechanics. In addition, a “recitation” (ꜥš), or – more idiomatically – an “utterance/invocation”, i.e., “that which is to be recited,” plays a considerable role in a large number of magical practices, often in direct combination with the verb “to recite” itself;75 that is to say, a practitioner is instructed to “recite” (ꜥš) an “invocation” (ꜥš),76 although he can also be instructed to “say” (ḏd) an “invocation” (ꜥš).77 Given that in almost every case the “recitation” (ꜥš) that is to be “recited” (ꜥš) is specified in such composite recipes which include among their ritual instructions (e.g., invocations by name, for task, aretalogical statements, historiolae, and mythical allusions), this “recitation,” although oral in function, is actually written in form. Hence, one also finds that both “(a) text” (sẖꜣ)78 is, and “(the/these) texts” (nꜣ/nꜣy sẖꜣ.w)79 are, “recited.”80 With respect to the titles given to individual spells or sections within composite recipes, when more specific titles for the ritual practices are not given, e.g., a “petitioning-god” (pḥ-nṯr) or “vessel/lamp divination” (šn hne/ẖbs), the term “spell” (rꜣ) – better known from afterlife texts such as the Book of the Dead – is used,81 being yet another term that is oral in function but written in form.82 Instructing the practitioner to “say” (ḏd)83 things during the ritual provided the sub-level of direction from the level of the “recitation” (ꜥš) or “text(s)” (sẖꜣ(.w)) that were the sources of the invocations within. The PDM do not instruct the “practice” (iri) of “texts” (sẖꜣ.w) either, because this term is a description of one element of magical practice. Even though this process can be compared with the direct manipulation of “ritual power” (ḥyḳ), the “practicing” of “texts” is a process that precedes it, and by which the practitioner gains access to the “ritual power” (ḥyḳ) inherent in the efficacious textual content of the source text. Crucially, and as noted above, “ritual power” (ḥyḳ) does not feature at all in the PDM.84 The Demotic magical texts themselves, while providing practitioners with access to and instructions for the manipulation of “ritual power” (ḥyḳ), do not describe the attributed or assumed causation process between the “cause” of the ritual practice, and the “effect” of the outcome of the ritual practice – the “literary” describes while the “literal” instructs. Instead, the Demotic magical texts present the practitioner with the mechanics by which to instigate the “cause” for which the “effect,” i.e., the outcome, is specified. Thus, “ritual power” (ḥyḳ) is conceptualized in a similar vein as to how it is described by and for the benefit of the audience of Setne II, and would be considered the agentive link in the causal process. §5 The Lexical Conceptualization of the “Textual Authority” behind Magical Practice In my study on the bilingual composite recipes of PGM IV, in which I sought to treat not only the practitioner-client relationship with respect to magical practice, but also present a framework in which to ground hypotheses into the “priestly,” “potential,” and “contemporary” practitioners of those magical texts, I reached the conclusion that only a thesis which regarded magical texts to have been conceptualized as being imbued with efficacy that was accessed and manipulated through ritual practice could account for the dissemination of those, and thereby presumably other, magical texts and their practice across spatial and temporal frames.85 This was intended to stand in contrast to the thesis of “ritual specialism,” which imbues the practitioner himself with a socio-cultural prestige. While that thesis highlights what was perhaps considered the by-product of becoming a practitioner, it could not have been the premise behind how magical practice deriving from texts was conceptualized as being efficacious. That is to say, magical texts themselves held efficacy and “textual authority,” and a practitioner required specialized, rare, and sought-after knowledge, i.e., literacy in stages of the Egyptian language and its various scripts, in order to be able to access these texts. Only by accessing these texts could the “ritual power” they contained be manipulated in order to bring about the desired outcomes for which they were practiced. At that time, having only treated this in broad terms, and having drawn upon the notable appraisal of Demotic literature featuring magical practice and its practitioners by Dieleman,86 it is here that this thesis of “textual authority” can be developed in full with respect to the secondary sources of Setne I and II, in which the sources of ritual efficacy were described, and magical texts in Demotic, themselves the primary sources which prescribed the manipulation of ritual power through their efficacious textual content. §5.1 “Textual Authority” in Setne I and II This study has already demonstrated that the source of the magical practices which were described as practiced by the practitioners in Setne I and II were, with few exceptions, described and therefore conceptualized as stemming from written sources.87 The paramount written source in both Setne I and II is a, but never the, “papyrus which Thoth wrote with his own hand,”88 a manuscript often referred to as the Book of Thoth.89 Distinct from the “written formulae” (hp n sẖꜣ) that are written upon it in Setne I,90 and the content which protected Thoth against his enemies and will therefore protect Pharaoh against the “ritual power” (ḥyḳ) of the Kushites in Setne II,91 the “papyrus which Thoth wrote with his own hand” in both tales is referred to as a ḏmꜥ/ḏꜥm or a “papyrus”, i.e., a tangible medium – with the specification in Setne II that it is not just any papyrus but a mḏꜣ.t/mḏy or a “bookroll.” As such, when the “written formula(e)” (hp n sẖꜣ) are practiced in Setne I,92 or when the ritual to protect Pharaoh from the “ritual power” (ḥyḳ) of the Kushites is used in Setne II,93 this papyrus is the source. As has been touched upon above, there was a significant lexical, and thereby semantic and conceptual, difference between reference to a tangible textual medium, i.e. a “papyrus” (ḏmꜥ/ḏꜥm) or “bookroll” (mḏꜣ.t/mḏy), and the transmittable and “redactable” “text(s)” (sẖꜣ(.w)) which were inscribed upon them. Therefore, when, as discussed above (§4), a text was recited (ꜥš sẖꜣ), whether in the “literary” sphere of Setne I and II, or the “literal” sphere of the PDM, a source manuscript is implied (when not explicitly specified) in the former case, and extant in the latter by the very fact of their preservation. This is perhaps why in the “literary” sphere a “text” (sẖꜣ) but not a “recitation” (ꜥš) – which only appears in the “literal” sphere – can be “recited” (ꜥš), since, for the audience, the reference to an explicit textual source has to be included: the source of the “textual authority” for the practice is described in the “literary” but prescribed in the “literal” sphere. The key element was, as demonstrated by references to the reproduction of a text not in spoken but in written form, i.e., writing a text (*sẖꜣ sẖꜣ) in the PDM, that interaction with the textual content and its utilization through recitation or written reproduction was essential to the practice, whose efficacy would bring about the desired outcome. §5.2 “Textual Authority” in the PDM This implication is borne out by a study of the way in which the lexical conceptualization of the “textual authority” behind the efficacious magical practices in the “literary” sphere, i.e., described in Setne I and II, compares with the “literal” sources of “textual authority” themselves, i.e., the PDM. The corroborating evidence begins, after the explanation of one exception,94 with the fact that a “bookroll” (mḏꜣ.t/mḏy) is not referred to in the PDM because the PDM, i.e., the four papyri that make up the analytical category, are themselves “bookrolls.” A “papyrus” (ḏmꜥ), by comparison, appears in London-Leiden and Leiden I 384, where it is used as a medium upon which to inscribe texts or figures,95 as with a “document” (bkt) is in Leiden I 384,96 but also to refer to other papyri which are themselves sources of magical texts.97 In addition, the term “another papyrus” (ky-ḏmꜥ)98 is used within composite recipes to indicate that a variant found in another Vorlage to the main source of the redacted extant text is about to be cited.99 This implies not only that multiple sources were often used in the compilation of an extant composite recipe, but also that these Vorlagen were conceptualized as “papyri” (ḏmꜥ.w), which carried alternative “texts” (sẖꜣ.w) to be drawn from. §5.3 The “papyrus which Thoth wrote with his own hand” – the paradigm of “textual authority” Given these corroboratory correlations, the final aspect of “textual authority” to be considered, as manifested in Setne I and II, and relevant for the implications of efficacy inherent in the magical texts of the PDM, is the nature of the so-called Book of Thoth, i.e., the “papyrus which Thoth wrote with his own hand.” Importantly, not least given the discussion earlier in this section, it is not a “text” (sẖꜣ) that Thoth wrote with his own hand, but a “papyrus” (ḏmꜥ). As a result, it is clear that reference is being made not to a particular text,100 but to one particular medium. This medium could have housed multiple “texts,” which also be copied and recopied from that medium,101 and many copies of that text, or those texts, could have been in circulation at once. As a point of departure, it should be noted that the reason the manuscripts in Setne I and II to be treated in this section have thus far each been referred to as “the papyrus which Thoth wrote with his own hand” is in order to stress the importance of using emic terms where they appear, not only to elucidate their interpretation, but also to avoid erroneous conflations between manuscripts that could be described as similar, but are not the same. The clearest example of this is an emic term in the Egyptian language that refers to a “bookroll of Thoth” (mḏꜣ.t n.t Ḏḥwty); yet this is not the same or even similar to the composition published by Jasnow and Zauzich with the title the “Ancient Egyptian Book of Thoth”102 – regardless of what Thoth’s role may or may not have been in the latter composition.103 In fact, texts which Thoth wrote are attested in various places in Egyptian textual culture, from temple walls104 to afterlife texts105. §5.3.1 The “papyrus which Thoth wrote with his own hand” in Setne I The narrative of Setne I relates that Naneferkaptah loved “walking up to the necropolis of Memphis reading the texts which were in the temples of the Pharaohs and the stelae of the scribes of the House of Life” (3/9) and during a festival/procession he is described as “reading the texts which were upon the shrines of the gods.” When a “priest” (wꜥb) accosts him, laughing, he states: “[If it happens that you] desire to read the text; Come to me and I will have you taken to the place in which this papyrus (pꜣy ḏmꜥ) is; Thoth being the one who wrote it with his own hand (iw Ḏḥwty pꜣ i-iri. sẖꜣ=f n-tr.ṱ=f ḥꜥ=f) when he came down following the other gods” (3/12). As discussed above, “two written formulae (hp 2 n sẖꜣ) are (written) upon it” (3/12). Naneferkaptah then has to pay the old priest in order to discover that “the aforementioned papyrus (pꜣ ḏmꜥ n rn=f) is in the middle of the sea of Coptos” (3/17). Not only that, it is in a tebet (tbe.t), either a “chest,” “coffin,” or even “shrine,” of iron, within another tebet of copper/bronze, which is inside one of wood, inside another of ivory and ebony, inside one further of silver, and inside one of gold, in which the book is housed (3/17–19). This tebet is in turn surrounded by six miles of “snakes” (ḥf), “scorpions” (wḫe.t), and “reptiles” (ḏfte.t), as well as “an eternal snake” (wꜥ ḥf ḏ.t). Having overcome all these trials and tribulations, Naneferkaptah recited “a written formula from it” (wꜥ hp n sẖꜣ n-im=f: 3/35) and as a result he could practice the two spells mentioned to him by the priest (3/36–37). Perhaps the most overlooked aspect of this episode is the subsequent event, during which, following Naneferkaptah’s return to his wife, Ihweret declares, “Let me see this book because of which we have suffered greatly. He gave the book to my hand and I recited a written formula from it” (3/40). Once she had recited from it, Ihweret was able to undertake the two ritual practices already cited (3/40–4/2). Hence, due to Ihweret’s literacy, there is unambiguous evidence, at least in the “literary” sphere, for a female practitioner.106 However, she also declares: “As I cannot write, I was speaking in comparison to Naneferkaptah (iw bw- iri=y sẖꜣ wn-nꜣ.w iw=y ḏd r Nꜣ-nfr-kꜣ-ptḥ), my older brother who is an exceedingly fine and wise scribe” (4/3). Given that she is literate, this must mean that she could not practice them as effectively as Naneferkaptah. As in Setne II, Naneferkaptah then proceeds to copy the entire book: “He had brought before him a piece of new papyrus (wꜥ.t šꜥṱ.t n ḏmꜥ mꜣy), wrote everything which was upon the papyrus (pꜣ ḏmꜥ) before him entirely, burned it in fi[re], dissolved it in water, realized that it was dissolved, and drank it.” Thus “he learned (rḫ) what was in it” (4/3–4). Immediately following this event, however, “Thoth found out (gm) everything that had happened to Naneferkaptah because of the papyrus (pꜣ ḏmꜥ: 4/5–6)” and thus complained before Pre/Ra, saying, “Learn my case and my judgement with Naneferkaptah … He went to my storehouse(?), robbed it, and took my chest/coffin/shrine bearing my ‘document of justice’(?)” (4–6/7). Subsequently, Pre/Ra deems that Naneferkaptah “is yours together with every person belonging to him (i.e., his wife and son)” (4/7), and therefore his punishment was that “a divine power” (wꜥ nḫṱ n nṯr) was sent from the sky, after which the death of his son, wife, and himself is narrated. §5.3.2 The “papyrus which Thoth wrote with his own hand” in Setne II Hor-son-of-Paneshe, an “extremely wise man” (5/3), having taken a bookroll and amulets to Pharaoh in order to recite magical texts and provide him with phylacteries in order “to not [let] the spells of the Kushites [have power] over him” (5/5–6), headed to Hermopolis. Having entered the temple there and performed burnt-offerings and libations to Thoth, he invoked Thoth for a method through which he might prevent the Kushites from taking “the shame/humiliation of Egypt to the land of Nubia” (5/7–9). During a period of incubation, in which he was greeted by “the secret form of the great god Thoth” (pꜣ sšṱ n pꜣ nṯr ꜥꜣ Ḏḥwty: 5/10–11), Hor-son-of-Paneshe was instructed by Thoth thus: “Go into the library/archive of (the) [temple] of Hermopolis. [You will] find a naos/chest (“dark-place”) that is closed and sealed. Open it. You will find [a chest] in the aforementioned naos/chest in which there is a papyrus roll; the one which I wrote with my own hand.”107 The instruction with the most important implication for this study is that Thoth clarified that Hor-son-of-Paneshe should “bring it up, take its copy (h̭ꜥyṱ=st), and leave it against in its place” (5/13). Hor-son-of-Paneshe proceeded to do as he was instructed and returned to Pharaoh in order to protect him and prevent “the shame/humiliation of Egypt” being taken to Nubia. Thus, in addition to the fact that in Setne I Naneferkaptah did not have permission to locate and access the textual content of the “papyrus which Thoth wrote with his own hand,” but sought it out of curiosity rather than – like Hor-son-of-Paneshe – necessity,108 the difference in Setne II is that Thoth’s instructions make it clear that access to the papyrus he authored was not proscribed to humans, but that removing it from the temple certainly was – hence his instruction that Hor-son-of-Paneshe would have to copy it. This episode highlights an important factor that has been overlooked in treatments of the so-called Book of Thoth in Setne I and II thus far, namely that, as can be demonstrated both with reference to Setne II and to the “literal” temple and afterlife texts which Thoth is supposed to have authored (see nn100–102), both “literary” and “literal” scribes, and therefore practitioners, were, in fact, privy to these papyri/texts. Thus, the connotations stemming from the episode in Setne I, that the content of the “papyrus which Thoth wrote” should not have been read, recited, and copied without Thoth’s permission – hence his divine retribution – have thus far been conflated in treatments with that of Setne II. As will be seen, however, the divine custody of papyri/texts written by Thoth is also attested in extant magical texts, with the resulting implication that Thoth’s authorship, and human access to it, would have been in the consciousness of “literal” practitioners. §5.3.3 The “papyri of Thoth” in the PDM and Coptic magical texts The last inscribed spell in the extensive London-Leiden is on verso 33/1–9 (PDM xiv. 1219–1227), with the desired outcome being to cure illness. The spell opens with a historiola in which Horus, after doing something which is not preserved, went up to the plateau at midday in Akhet while mounted on a white horse, with a black horse before him. He is described as having “the papyri of Thoth on him, with those of the Great-of-Five under his chest” (nꜣ ḏmꜥ [n Ḏḥwty ḥr-ꜣ].ṱ=f | nꜣe pꜣ wr-tiw ẖn ḳne=f: verso 33/1–2). Upon the plateau he found “all the gods sitting at the place of judgement,” who asked him why he would not eat. Horus then asks why it is he has become sick in his head and in his body, why a fever has struck him and why the south wind has touched him, by enquiring, “Does Isis [stop] conjuring? Does Nephthys stop curing?” (33/3–5). With the invocation itself being to the 365 gods “until they remove/conjure the fever from the head of the son of Isis, from the head of NN, whom NN bore,” the ritual instruction is to recite this over oil and anoint the hands, body, and feet of the client (33/6–9). Thus, it is clear from this spell that even though Horus was the custodian of (copies of) the texts that were authored by Thoth, they evidently were not conceptualized as containing ritual texts with the function of relieving his illness. By comparison, a Coptic-Greek bilingual parchment codex of the 4th/5th century ce, Michigan Ms. Copt. 136 (TM 92874), 5/1–6/5 (lines 60–84) contains a spell to “bring to birth those who are pregnant” and “to close-up those who miscarry,” as well as “to cause every egg to be fertile.”109 As in London-Leiden, the opening of the spell is an historiola, yet it is not narrated in the third person but in the first, with Amun describing: “That I am going is with the south-wind northwards between reed and rush. I am going (to) Abydos between these two mountains of these two hills. That I am mounted is on (a) white-horse, (a) black-horse before me, while the books of Thoth (ϫⲱⲱⲙⲉ ⲛ̅ⲑⲟⲟⲩⲧ) were with me, those of the Great-of-Five (ⲛⲁⲡⲟⲣϯⲟⲩ) in my hands” (5/9–10). By analogy with the pregnancy and labor of Isis, Amun is told by Thoth to hurry to her, though – once again – the “books” (ϫⲱⲱⲙⲉ)/papyri (ḏmꜥ.w) of Thoth play no particular role in catalyzing the desired outcome of the spell. Thus, in both cases, Horus in the former and Amun in the latter, the media upon which texts attributed to Thoth were inscribed were held by divine custodians, and were referred to in the historiolae as being embedded within composite recipes that also featured invocations for task and ritual instructions that brought about the desired outcome of the practice, without playing a direct role in catalyzing the practice itself. Thus, while Thoth’s authorship would have been encountered by “literal” practitioners in their magical texts, their context, although not “literary,” was “mythological” in nature – perhaps set in an ancient past during which the gods ruled Egypt. Therefore, while “literal” practitioners could well have been more than familiar with texts ascribed to Thoth, it is not in the sphere of magical texts but in those of temple and afterlife texts in which they would have had access to the actual content of any such texts, meaning that they were once again outclassed by their “literary,” and to an extent therefore “legendary,” counterparts. §5.3.4 Text attributed to Thoth in Setne I, II, and magical texts It has been seen that although Naneferkaptah was not, unlike Hor-son-of-Paneshe, invited by Thoth to acquire the “textual authority” contained within a composition of his (for Naneferkaptah’s aim was to do so out of hubris110 and to satisfy his own curiosity,111 while Hor-son-of-Paneshe’s was to protect Pharaoh from the Kushites and therefore prevent “the shame/humiliation of Egypt” being taken to Nubia), there is an important nuance to be stressed. This is that Hor-son-of-Paneshe was welcome to take a “copy” of the “papyrus which Thoth wrote,” thereby returning the “original/Vorlage” to the temple library/archive, where it would be available to anyone who had, or in future would be granted, authority to access it.112 Thus, while Setne’s public113 and profane use of the contents of the papyrus which he stole was enough to bring divine retribution upon him, it must also have been a serious transgression for Naneferkaptah to have become the sole custodian of this papyrus. It cannot simply be the case that because Hor-son-of-Paneshe was granted the authority by Thoth to access the papyrus that he was therefore allowed to practice the texts within it, because Thoth emphatically states that the original must be returned to the place from which he took it, and further that Hor-son-of-Paneshe was only permitted to take “its copy” and not, therefore, the “original/master copy.”114 Hence, Hor-son-of-Paneshe was not advantaged over any other practitioner, whether human or divine, because he was not the sole custodian of that papyrus which Thoth wrote, whereas – by comparison – Naneferkaptah became so, as were Horus and Amun in the aforementioned magical texts. Of course, as has been demonstrated, there is no single “Book of Thoth”, i.e., “the Book of Thoth” never existed, and therefore multiple connotations must have been of relevance to the audience(s) of Setne I and/or II. The most important implication for this study from the example of the “papyrus which Thoth wrote,” whether that in Setne I or in Setne II, however, is that the efficacy of the text was paramount – even superior to that of a learned scribe and thereby practitioner such as Naneferkaptah or the semi-divine example set by Hor-son-of-Paneshe. Thus, each manuscript contained “textual authority” that was too efficacious to be allowed to be the sole intellectual property of any one practitioner – whatever their intentions. As a result, each papyrus was, or each of the papyri were, held in Thoth’s custody in Setne I and II, and in Horus’s and Amun’s in the aforementioned magical texts. §6 Literary and Literal Practices, Texts, and their Practitioners On balance, this study has demonstrated that in order to construct an emic framework through which to typologize, and thereby understand, how magical practices, texts, and their practitioners were conceptualized, both secondary and primary sources for these phenomena must be considered alongside, and in light of, each other. In §3 it became clear that the differentiation between human titles (e.g., rmṯ-rḫ) and literary and divine epithets (e.g., sẖꜣ nfr) set the “literary” practitioners of Setne I and II apart from their “literal” counterparts – although they may have been united by their superordinate identity as “practitioners of ritual power” (*nꜣ nty iri ḥyk). By comparison, in §4 the lexical conceptualization of magical practices in Setne I and II, as compared with in Demotic magical texts highlighted similarities and discrepancies between the “literary” description of magical practice, e.g., the “recitation” (ꜥš) of “(a) text(s)” (sẖꜣ(.w)) compared to the “practice” (iri) of “ritual power” (ḥyḳ). Consequently, it was argued that hik (ḥyḳ) could have been conceptualized as the agentive link in the causal process (the manifestation of the “causality-attribution/-assumption”) which connected the “literary” description with the “literal” instruction of magical practices. Thus, in §5 the lexical conceptualization of manuscripts, texts, and the latter’s “textual authority” was identified, stemming from the lexical, and thereby semantic and conceptual, distinction between descriptions of tangible textual media, e.g., a “papyrus” (ḏmꜥ/ḏꜥm) or a “bookroll” (mḏꜣ.t/mḏy) and the transmittable “text(s)” (sẖꜣ(.w)) which were inscribed upon them. Hence, in the “literal” sphere, “texts” (sẖꜣ.w) were not referred to because they were what was being read, and thus what was prescribing the “recitation(s)” (ꜥš(.w)) that are found labelled as such within the PDM. The interaction with a text which was part and parcel of magical practice in the “literal” sphere was thus described in the “literary” sphere, because this was the mechanism through which magical practice was conceptualized as being undertaken. It is no wonder, therefore, that the efficacy of such practices was conceptualized as being contained within these texts themselves, as was demonstrated with respect to the “papyrus which Thoth wrote,” and thereby that some manuscripts contained “textual authority” that was too efficacious to be allowed to be the sole intellectual property of any one practitioner, whether “literary” or “literal.”"
}