{
  "articleId": "isaw_paper6",
  "text": "ARTICLE_ID: isaw_paper6\nthis study examines recent archaeological evidence for the Quartier du Stade on Delos, which was newly formed after 167 CE.Analysis of the changes in the houses and the overall urban development of this neighborhood contribute to revealing the forces that shaped the city of Delos in this period, such as economy, politics, and ideology.Subjects: Delos Island (Greece), Economic history--To 500.Table of ContentsIntroductionReligious and economic network of DelosDemographic and urban growthQuartier du StadeHouses IC and IDHouse ICHouse IDDomestic economy or integrated commerce? Houses IC and ID in the context of the Quartier du StadeConclusionNotesBibliographyIntroductionDelos, home of the sanctuary of Apollo since the archaic period, underwent a period of rapid economic development after 167 BCE, when the Romans put the island under Athenian dominion and turned it into a commercial base between the East and the West.Due to its advantageous geographical position, Delos had attracted traders from Greece, Macedonia, and the Hellenistic East as well as dealers from Rome since the third century BCE. In between 167 BCE and the sacks of 88 and 69 BCE, the island, though primarily addressing the regional market of the Cyclades, became an intermediary step in Romes commercial relations with the Hellenistic east.1 The accelerated urbanization, attested by the formation of new neighborhoods and the maelstrom of redevelopment in the existing urban and port areas of the island, as seen in the massive constructions of docksides, warehouses and markets, was the result of this economic development and the unprecedented demographic growth that it generated.2 My study focuses on one of the newly-formed neighborhoods of Delos in this period, the Quartier du Stade. By analyzing the changes in the houses and the overall urban development of this neighborhood, my aim is to examine the relations between the forces that shaped the city of Delos in this period, such as economy, politics, ideology, and the major urban components, for example, architecture, landscape, infrastructure.In doing so I hope to address alternative ways of approaching the city in the ancient world. In this paper I outline the parameters of this research by addressing the religious and economic network of Delos and its subsequent appropriation in the late Hellenistic period, and present the preliminary results of my fieldwork on the Quartier du Stade in 2009 and 2010.#p0Although numerous archaeological excavations have probed the city of Delos for over a century and recent comprehensive studies have adjusted our understanding of Delian architecture,3 the nature and history of urbanism on Delos remains a surprisingly understudied topic. Only preliminary thoughts have been expressed on the urbanization of Delos,4 while the only comprehensive study on the urban growth of the island (Papageorgiou-Venetas 1981) has been rightly criticized for misapplying modern urban planning principles and quantitative methods.5 Rather than providing an architectural history of the buildings or a catalogue raisonnu00e9e-style publication of one class of material culture, my project sets the larger goal of using the Quartier du Stade as a case study of rapid urbanisation.#p1Drawing on current developments and debates in the fields of Hellenistic economy,6 and contemporary urban studies,7 the project will address the relations between the forces that shaped urban growth and major components of the city texture on late Hellenistic Delos. Although this project focuses on a specific case study of urban growth, its ultimate goal is to offer an alternative way for approaching the urbanism of ancient cities.By examining the agents, relationships and consequences of the accelerated development of the late Hellenistic city of Delos this project will identify a model of urban growth that to date has been overlooked in the study of ancient cities that have focused on the idealized concepts of the Hellenistic and Roman urban environments, such as monumentality and town planning. The rapid urbanisation of Delos may be compared to far more accelerated developments of the growing commercial centres in Asia and the Gulf Region today.Historical paradigms of this model of informal urban growth will further the understanding of the ties between economic and urban developments today.#p2Religious and economic network of DelosDelos was an important cult center from early on whose activity was inextricably linked to its economic role. Due to its advantageous geographical position in the center of the Aegean world, Delos commanded a huge cult network that intertwined religious with economic and political activities from the archaic period onwards.This network was primarily for the islanders but at times it was used to stake claims for the Ionian peoples, that is, one of three major linguistic/cultural groups of Hellenes.Communities competing for political power and leadership exploited the cult network of Delos over time: Ionians, Athenians, the successors of Alexander and finally Romans.8#p3There are three key moments in the history of Delos that are relevant for my discussion of the urban growth on Delos: the first Athenian dominion, the period of independence and the second Athenian dominion. In 478 BCE, at a time of insecurity after the Persian Wars, the Athenians created a maritime confederacy with Delos as its seat and by the end of the fifth century BCE they resumed the administration of the sanctuary.9 During this period, in 426 BCE, the Athenians purified the island; they removed tombs of all who had died on the island and issued a proclamation that in future none should be born or die on the sacred island; pregnant women and dying persons must be ferried across to Rheneia.10 This important moment marked the character of the urban settlement on Delos and its subsequent growth. With no tombs to mark the limits of the city, Delos on the one hand evades traditional categories of the ancient city and on the other presents a unique opportunity to reexamine the factors that shape the ancient city.#p4Delos gained its independence in the early Hellenistic period, when the successors of Alexander distributed the provinces of Alexanders empire.In between 315 and 313 BCE Antigonos Monophthalmos created the koinon of the Nesiotes, first confederacy of the islanders proper (versus the Ionians), and set Delos as its seat. The euergetism of the Antigonids modified the physiognomy of the sanctuary in this period; for instance the Portico of Philip V, king of Macedon, towards 210 BCE (GD 3), the South Portico, towards 250 BCE (GD 4), and the Portico of Antigonos Gonatas, king of Macedon, 250-225 BCE (GD 29).11 Furthermore, due to the increasing role of Delos as a commercial center of the Cyclades in this period, a multitude of cults is attested on the island: for instance, the cults of Egyptian gods (e.g., Serapeion A [GD 91], and Serapeion C [GD 100]) and the cults of the Syrian Gods (GD 98, Sanctuary of Syrian Gods).12#p5But the prosperity of the Delian commerce began with the decision of the Roman Senate to make it a duty free port in 167 BCE under Athenian suzerainty. The senate guaranteed duty-free status to the port of Delos (through a grant of u1f00u03c4u1f73u03bbu03b5u03b9u03b1) prohibiting the Athenians from levying import and export duties on any of the trade passing through the harbor.This decision was taken at the end of the Third Macedonian War, in a series of conflicts fought by Rome in order to gain control of the Mediterranean basin.The Senate wished to destroy the commerce of Rhodes u2013 the major power in the Aegean. Indeed Rhodes experienced massive trade shrinkage at the end of the second century BCE.13 The growing commercial importance of the island of Delos was not only a consequence of the grant of ateleia in 167 BCE, but also of other equally important developments such as the Roman destruction of Carthage and Corinth, the rapid collapse of the Seleucid empire in the latter half of the century and the creation of the Roman province of Asia in 129 BCE.14 Strabo, a Greek geographer writing at the very beginning of the first century CE, says that the merchants (u03bfu1f31 u1f14u03bcu03c0u03bfu03c1u03bfu03b9) changed their place of business from Corinth to Delos following the destruction of the former in 146 BCE for two reasons: they were attracted first by u03c4u1fc6u03c2 u1f00u03c4u03b5u03bbu03b5u1f77u03b1u03c2 u03c4u03bfu1fe6 u1f31u03b5u03c1u03bfu1fe6 and second by the good location of the harbor, as it is on the sea-route from Italy and Greece to Asia (Str. 10.5.4). Because Delos was a shrine, it had become an international town; because it was an international town, it became a place of commerce.15#p6According to the literary sources (Strabo, Pliny, Pausanias and Lucilius), slaves and luxury goods from the Middle East were traded through Delos.Pausanias (3.23.3-6) described Delos at this time as the trading station of all Greece.Pliny (HN 34.9) reported that the mercatus in Delo was concelebrante toto orbe, more specifically after the development of the Roman shipping lane to Asia (so after 133 BCE). The contemporary poet Lucilius referred to the mighty port of Puteoli as a lesser Delos (Paulus, ex Fest. 88.4: u2018Minorem Delum Puteolos esse dixeruntu2026unde Lucilius-- inde Dicarchitum populos Delumque minorem [=Lucil.118]).Strabo described Delos as the location of a trans-Mediterranean slave trade to the agricultural estates, mines, shops and households of the Roman West (Str. 14.5.2).16 However, no physical remains have ever been identified on the island to confirm the importance of the slave trade.17 Luxury items, such as perfumes, spices, unguents, incense, gems, statues, metals, dyes, glass, tapestries, textiles and linens u2013 all originating in the Middle and Far East u2013 were credited to the commerce of Delos including highly prized Delian bronze statues (Plin. HN 34.9):18 sculptor ateliers, for instance the boutiques on the south side of Agora of Italians (GD 52), fabrication of auloi, for instance the boutique at the Monument du granit (GD 54).19 Pliny reports that Delos became a production centre for the perfume trade, a point reinforced by the number of unguentarii who are recorded amongst Roman-Italian families on Delos whose professions are recorded in epigraphic or literary evidence from Italy.20 Since the raw materials for this manufacture had to be imported from further east, Plinys evidence confirms the importance of oriental luxuries as a component of Delian trade. Archaeological evidence also points to the existence of perfume, purple dye, glass jewelry, sculpture and terracotta figurines production on Delos (purple-dye production: GD 79.1, GD 80.1 and at the bay of Fourni; perfumeries: GD 79, GD 66, GD 50, GD 120, GD 118; sculpture ateliers: shops 103 and 106 at SW corner of the Agora of the Italians [GD 52]; glass production: shops to the west of the Maison des Stucs [GD 87], south of the Samothrakeion [GD 93] and in the area of the Aphrodision [88]; coroplastic workshops: shop at the south side of Agora of the Italians [GD 52], Quartier du Thu00e9u00e2tre, Insula VI, Maison B).21#p7Demographic and urban growthFrom a population of about 1,500 to 2,000 in the period of the independence, it gained an estimated amount of roughly 15,000, during the period of the second Athenian dominion. It has been suggested that the island reached a population of 20,000 to 30,000 residents at its peak.22 However there is no firm evidence u2013 inscriptions give evidence for 1,200 citizens and a population of about 6,000 at the beginning of the first century BCE.During this period the island is characterized by its cosmopolitan character.The majority of the new residents of the island were from the eastern Mediterranean and the Italian peninsula.23 While some eastern merchants at Delos came from cities as close as western and southern Asia Minor, the majority came from places further abroad, including Antioch, Berytus, Tyre, Sidon, Alexandria, and from more exotic points still further east, such as Gadara, Heliopolis, Arabian Nabataea, Gerra on the Persian gulf and in one instance from as far away as Minaei in south Yemen.24 The largest ethnic contingent of the island was, however, Roman-Italian.25#p8But whereas the occupation is so diverse the architecture is quite uniform, attesting to what has been termed an architectural koine. Contrary to later tendencies to Romanize settlements, what we see on the island is a total adaptation of the local building techniques with a religious/ethnic flavor attested in inscriptions, paintings and sculptures.26 Recent studies have pointed that the contact of Roman with local cultures resulted in a plurality of hybrid cultural expressions, which defy the generalization that the term Romanization implies.27 Here foreigners adopted the local architectural language and arranged their houses and religious club associations around a courtyard, while details in the decoration, such as statues and wall paintings, as well as inscriptions indicate their distinct identity. The House of Cleopatra (GD 119) that is occupied by an Athenian couple (Dioskourides and Cleopatra of the Myrrhinoutta demos u2013 ID 1987) is not different from the House of the Trident (GD 118) that is occupied by a Syrian (indicated by protomes of the bulls of Hadad and the lions of Astargatis in the Rhodian peristyle of the house) or the House of the Dolphins (GD 111) that is constructed by a Phoenician (signature of the vestibule mosaic of the Tanit symbol). Equally homogenous in their architecture are the religious association of the Poseidoniastes from Berytos (GD 57) and the 25 houses with religious wall paintings in relation to the Roman cult of the Lares Compitales.28 Only in a few cases (House of Diadoumenos, House of the Dolphins, and House of the Trident) the spatial arrangements of the house remind visual strategies of self-representation familiar from the slightly later houses in Campania. In these houses the alignment of the entrance corridor, whose floor featured an impressive emblema, with the peristyle and the fau00e7ade of the oecus maior created a visual impact on the houses interior to a passer-by, which owners could employ to enhance their personal status.The majority of the houses, however, follow the more traditional layout of the Greek house of rooms around a courtyard accessed by an ante-room, pastas or colonnade, which in some cases was appropriated, for example, the angle of the vestibule allowed passers-by to see into a part of the house, in order to accommodate the owners wish of self-representation.29#p9The rapid urbanization of the island took place in this period.30 The small settlement of the period of independence, which clustered around the main sanctuary area with some smaller sanctuaries and cultural centers beyond, exploded during the period of the second Athenian dominion. The urbanization expanded from the area of the old sanctuary center outwards: - The new markets, the Agora of the Hermaistai or the Competaliastai (GD 2), the Agora of Theophrastos (GD 49) and the Agora of the Delians (GD 84), clustered at the borders of the sanctuary;31 - the main port facilities expanded to the south and big storage facilities and facilities equivalent to shopping malls were created next to them.32 u2013 the residential neighborhoods developed around the sanctuary center and where good natural ports were created to complement the activities of the main port, overloaded by the maritime traffic going through the island in this period.33 The character of the neighborhoods was mixed: residences mingled with manufacturing activities, shops and storage facilities and were next to some locus of cultural activity, such as the gymnasia. #p13The main residential neighborhoods that have been identified to date have been divided in two kinds, the so-called old and new neighborhoods.34 The term old neighborhood is used for neighborhoods that developed in areas that were previously urbanized, for example, the Quartier du Thu00e9u00e2tre and the Quartier de lInopos, and the term new neighborhood is used for areas that were not previously urbanized, for example, the Quartier de Skardhana (or Quartier Nord) and the Quartier du Stade. These new neighborhoods took over the areas of the gardens (u03bau03aeu03c0u03bfu03b9) and the open farming areas of the island to the north, which were concentrated at the south of the island in this period.35 However, the full extension of the city is not well known as not all the areas of the island have been excavated.36#p14Quartier du StadeThe Quartier du Stade (figs. 1, 2 and 3), the focus of this study, is one of the newly-formed neighborhoods. It is located on the north-east side of Delos next to the Stadion, after which it is named.It was not as isolated from the sanctuary center as it may seem today.The Archegesion (GD 74), the sanctuary of the Archegetes/Anios, the mythical founder of the Delian city (first half of sixth century BCE),37 is located between the hippodrome and this neighborhood.It is also generally thought that the gardens mentioned in the accounts of the hieropoioi (near the Hippodrome, near the Neorion, near the palaestra) were located in this area.38#p21The Stadion (GD 78) predates the neighborhood; it is mentioned in the accounts of the hieropoioi, the annually appointed officials of the sanctuary, since the first quarter of the third century BCE.39 The Gymnasion (GD 76) attached to the Stadion was built at the end of the second or the beginning of the first century BCE (based on construction evidence),40 and the Xyston (GD 77) was dedicated by Ptolemy IX when u0394u03b9u03bfu03bdu03cdu03c3u03b9u03bfu03c2 u0394u03b7u03bcu03b7u03c4u03c1u03afu03bfu03c5 u0391u03bdu03b1u03c6u03bbu03cdu03c3u03c4u03b9u03bfu03c2 was epimeletes of the island in 111/10 BCE. Probably both structures, Gymnasion and Xyston, were part of one building project developed by the Athenian colony and financed by Ptolemy IX.41 No exact dates can be confirmed for the rest of the Quartier du Stade.Even from this sparse dating evidence, it is clear that the urban development in this neighborhood as elsewhere on the island occurred after 167 BCE and it declined after the sacks of 88 and 69 BCE.42 Part of the Quartier du Stade is also the synagogue (GD 80), which is located to the south of the port structures of the neighborhood.43 The earliest phases of the synagogue date from the second century BCE; however, it cannot be ascertained whether these are before or after 167 BCE.44#p22Only a very small part of the neighborhood was excavated (Insula I and II) at the beginning of the 20th century (1912-13) by Andru00e9 Plassart, who published an extensive report of the excavations in 1916 u2013 however, a full and detailed publication of the excavations did not follow.45 More recently, in 1997, House IB was re-excavated and identified as a perfume workshop by Jean-Pierre Brun and Michu00e8le Brunet.46 Their study provides a relative chronology of the development of that house, which is helpful in the study of the overall neighborhood. In the context of the research project of the French School in Athens on the provision of storage space in houses and shops on Delos (dir. Vu00e9ronique Chankowski), I examine the unpublished excavation archives of Andru00e9 Plassart (1912-1913), study the finds from the neighborhood and conduct an architectural survey of the Quartier.47 In doing so my aim is to analyze the urban development of the Quartier du Stade and address it in relation to the economic development that Delos underwent in this period. #p23From the two Insulae that were exposed by Plassarts excavation, we may infer that it was a mixed-use residential and manufacturing neighborhood with some sale activities and some storage facilities within the residential units. From the visible remaining structures of the neighborhood facing towards the port, we can see that there were no large storage facilities like the ones located to the south of the main port; instead, the storage facilities were integrated in the residential areas.Insula I presents a few shops, (u03b1), (u03b2) and (u03b3) at its north end.48 Aside from a modest house at the north (IA), the rest of the buildings are quite big with courtyards: for instance, the perfume workshop (IB) and Houses IE, IC and ID. Insula II has a shop at the southwest corner (u03b6, u03b7, u03b8) and two houses with courtyards (IIA, IIB).Storage spaces were dispersed on the ground floor of the buildings.The character of this neighborhood is very similar to the other newly-formed neighborhood of the island, the Quartier de Skardhana, where we also have mixed residential, manufacturing and storage uses.49 Industrial and commercial features are not completely unique to the newer neighborhoods, but also appear to some degree in the older neighborhoods, too; for example, one of Delos two excavated coroplastic workshops appeared in the heart of the Quartier du Thu00e9u00e2tre,50 and there are numerous small shops throughout the island.51 The upper floors, like all the houses of Delos, were the most opulent ones; for example, the surviving sculptures come from the upper floors and the remains of the walls from the upper floor feature polychrome decoration.52#p24The inhabitants of some of the excavated houses were Italian (IC, ID, IE) as is suggested by the altars of the Lares Compitales placed at their entrances,53 and is indicated by a bilingual, Greek and Latin, inscription in House IC, that records a dedication by three freedmen to their patron: [u039au03bfu03afu03bdu03c4u03bfu03bd u03a4u03cdu03bbu03bbu03b9u03bfu03bd] . . . u03c4u03bfu03bd u039au03bfu03afu03bdu03c4u03bfu03c5 u03c5u1f31u1f78u03bd [u039au03bfu03afu03bdu03c4u03bfu03c2 u03a4u03cdu03bbu03bb]u03b9u03bfu03c2 [u1f29u03c1u03b1]u03bau03bbu03adu03c9u03bd u03bau03b1u1f76 u039au03bfu03afu03bdu03c4u03bfu03c2 u03a4u03cdu03bbu03bbu03b9u03bfu03c2 u1f08u03bbu03adu03beu03b1u03bdu03b4u03c1u03bfu03c2 u03bau03b1u1f76 u039au03bfu03afu03bdu03c4u03bfu03c2 u03a4u03cdu03bbu03bbu03b9u03bfu03c2 u1f08u03c1u03afu03c3u03c4u03b1u03c1u03c7u03bfu03c2 u03bfu1f31 u039au03bfu03afu03bdu03c4u03bfu03c5 u03c4u1f78u03bd u1f11u03b1u03c5u03c4u1ff6u03bd u03c0u03acu03c4u03c1u03c9u03bdu03b1 u1f00u03c1u03b5u03c4u1fc6u03c2 u1f15u03bdu03b5u03bau03b5u03bd u03bau03b1u1f76 u03bau03b1u03bbu03bfu03bau03b1u03b3u03b1u03b8u03afu03b1u03c2 u03c4u1fc6u03c2 u03b5u1f30u03c2 u1f10u03b1u03c5u03c4u03bfu03cdu03c2. [Tullium f . . . . pum] Tullius l. A[ristarchus] Tullius l. Ale[xander] Tullius l.He[racleo p]atro[nem] suom honoris et be[nef]ici cau[sa] (To) Tullius son of , Tullius Heracleon and Q Tullius Alexandros and Tullius Aristarchos (dedicated) to their patron, honoring his virtue and benefaction. 54#p28The freedmen Heracleon, Alexandros and Aristarchos dedicated a statue to their patron (Tullius f.).The patron and freedman Heracleon are known from other inscriptions. Quintus Tullius is Apolloniastes in 125 BCE (ID 1730).55 As Plassart pointed out, this inscription must be dated later, while Heracleon appears as a slave in a dedication of Competaliastes dated to 97/96 BCE (ID 1761).56 The inscription came from the upper floor of the house, probably from the north balcony around the court, as it was found in the upper layers of the rubble in room (g) close to its south wall.57#p29In addition, a terracotta figurine of a clothed Oriental Aphrodite (Inv. no. A2498) was found in House IC.58 The origin of the figurine was not thus far identified, as Plassarts notes are confusing because he changed the labeling of the houses as well as their rooms during his excavation.59 I have examined the changes of Plassarts labeling and concluded that the figurine comes from room (h) of the House IC.60 The figurine shows some influence from Egyptian iconography and as many other Egyptianizing figurines from Delos points to the appeal and integration of Egyptianizing religion in the multicultural community of Delos.61 It is not clear from Plassarts notes whether the figurine was found on the upper or lower layers of the rubble, which would respectively indicate that it came from one of the rooms on the upper floor or from room (h). Room (h) also featured a badly shaped graffito of a horse and a boat followed by an equally clumsy in execution inscription: (u039cu039d[u0397Cu0398u0397u03a4u0399] u0395u039au03a0u0391u0393u0391u0398u039fC [u0395]u03a0u0391u0393u0391u0398u03a9: u03bcu03bdu03aeu03c3u03b8u03b7u03c4u03b9 u1f18u03bau03c0u03acu03b3u03b1u03b8u03bfu03c2 u1f10u03c0u1fbd u1f00u03b3u03b1u03b8u1ff7).62 It is possible that u1f18u03bau03c0u03acu03b3u03b1u03b8u03bfu03c2 is a misspelling of u1f18u03c0u03acu03b3u03b1u03b8u03bfu03c2, a freedmans name that is also attested in an inscription found in the southern extremity of the Portico of Philip (ID 1961, u039au03b1u03b9u03bau03afu03bbu03b9u03bfu03c2 u1f18u03c0u03acu03b3u03b1u03b8u03bfu03c2).63 #p30House IIA seems to have been inhabited by members of a Jewish community and, at some point, it may have served as an early location of the synagogue later located at the southeast of this area. A dedication to God Most High found in the house uses the epithet u1f55u03c8u03b9u03c3u03c4u03bfu03c2 to refer to God, an epithet that has been identified as referring to the Jewish deity (ID 2328: u039bu03c5u03c3u03afu03bcu03b1u03c7u03bfu03c2 u1f51u03c0u1f72u03c1 u1f11u03b1u03c5u03c4u03bfu1fe6 u0398u03b5u1ff7 u1f59u03c8u03b9u03c3u03c4u1ff3 u03c7u03b1u03c1u03b9u03c3u03c4u03aeu03c1u03b9u03bfu03bd. Lysimachos for himself [to] God most High [for a] votive/thank-offering). In addition, the direct access to the well from the court is a unique feature in Delos that has been only attested at the synagogue, and could have been designed for ablutions.64 The ethnic diversity of the neighborhood is characteristic of the diversity of the island in this period.65#p31During fieldwork seasons 2009-2010 I studied and conducted the architectural survey of Houses IC and ID at the Quartier du Stade (figs. 4 and 5),66 and examined the development of their construction history in relation to the urban fabric of the neighborhood and the port facilities that might have been attached to it (fig. 3).67 The architectural survey was carried out using a handheld digital laser distance measurer and an automatic optical level on a tripod for the distances up to 15 m as well as a total station for the larger distances. The plans, sections and elevations were produced with a combination of CAD and hand drawings.Hand-drawn scaled plans were created on site in order to record measurements, which were used to produce the CAD drawings that were worked over on Illustrator.Sections and elevations were hand-drawn and also worked over on illustrator.Houses IC and IDHouse IC 68In House IC the entrance was originally from Rue Transversale through room (e), on the south side of the house (fig. 4). In the second phase of the house, the entrance was from Rue du Stade through room (a), on the west side of the house, and an upper floor was added which was accessible by a staircase in room (a) (fig. 5).69 The reconfiguration of the entrance to the house led to rearrangements in the interior organization of the house.In order to facilitate the access to room (g) from courtyard (c) the opening in the center of the wall between these two spaces was closed and an opening at the west end of the same wall was made. In its original disposition this opening provided a more direct access from room (e) and, in its subsequent phase, it was more easily accessed by room (a).In this way, the architectural composition gravitated in the area that gave access between vestibule (a), courtyard (c) and room (g).The two small rooms (e) and (f), once in the epicenter of the architectural composition and now leftovers, were used as storage spaces in this period u2013 as the amphora sherds found in them suggest. The design practice of using such leftover rooms in the architectural composition as service rooms or rooms for storage is also noted in the other Quartiers on Delos, for example, rooms (a), (c) and (d) in the Maison du Lac (GD 64).70 Rooms (h) and (i) at the north end of the house are also possible storage spaces; the latter was not plastered (i) and a large clay pot was found in the former (h). The lack of plaster in room (i) suggests that it was allocated as a storage room or other type of service room throughout the history of the house.Room (h), however, may have been turned into a storage space only in the second phase of the house.Its relatively big size and location immediately after the oecus maior (room g) is a typical trait of evening reception rooms in the Delian houses.71 The addition of the second floor in the second phase of the house, which was accessible from vestibule (a) and was associated with the change of the entrance from room (e) to (a), could explain the choice of the use of room (h) as a storage space at this time. By the construction of the second floor the lighting and ventilation of room (h) was reduced and the upper floor now offered more attractive alternatives for such reception rooms.The combination of these factors must have led to their conversion into storage spaces.The northeast area of room (g) also provided a place for storage.The east part of the north wall of room (g) featured two perpendicular shelf brackets at 1.20 m from the floor level that were placed at 1.07 m from each other.72 The change of the entrance to room (g) from courtyard (c) from the center to the west end of the wall probably facilitated the use of the eastern part of room (g) as a service and storage area. It is possible that the change of the entrance was in fact conducted in order to make more effective use of space, as not much area was in this arrangement reserved for passage.It seems that the area north of the courtyard (rooms [g], [h] and [i]) was reserved for service rooms of the household in the second phase of the house, probably due to the reduction of light and ventilation, and could have operated as an independent unit that would have been rented out. Fig. 6.House IC, west wall, section-elevation.Concerns of light and ventilation as well as stability seem to have preoccupied the architects of the house with the addition of the second floor.On the west wall of courtyard (c) a big window looking onto the street (Rue du Stade) was opened in the second phase.This wall, as well as its northern extension towards rooms (g) and (h), were originally built by a combination of mud and stone (in stone up to 1.40-1.60 m and then mud), and due to considerations in the need for load bearing support of the second floor in the second phase of the house they were altered to only stone. The addition in stone that replaced the mud part in the second phase is thinner than the lower part of the wall by 10-15 cm and forms a horizontal irregular line on the wall (fig. 6).Plassart had noted the difference in the thickness of the wall, but did not associate it with the replacement of the mud part with the addition of the second floor.73 This wall formed the west fau00e7ade of the house and flanked rooms (g) and (h) as well as courtyard (c). The wall is not interconnected with the north and south walls of rooms (g) and (h) and the addition of the second floor posed problems of stability for the mud part of the wall. A similar decision was taken in the case of room (a).In the first phase of the house, the south wall of room (a), which in the second phase became the entrance to the house, was also partially made of stone up to 1.90 m and then mud. The mud part of the wall was replaced with stone in the second phase.74 In this case as well the mud wall was not sufficient to bear the load of the staircase going to the second floor that was added at this time.Mud walls were used extensively in the newly-formed neighborhoods of Delos and provide evidence for the quick construction that initially took place.75House ID 76In House ID the ground floor area was also modified during a second phase of the house (figs. 4 and 5). The two large rooms, (j) and (n), were broken down into smaller rooms (j), (m), (t), (n), (o), (p) and (q).77 The creation of smaller rooms may be associated with both the need for storage as well as to provide bedrooms for the slaves of the house as Chamonard proposed.78 Only rooms (k) and (l) provide archaeological evidence for use as storage spaces (amphora sherds).79 They are located in the more remote area on the ground floor of the house, which is also the case of the storage facilities in House IC (rooms [h] and [i] and east part of room [g]). Some of the other rooms (m, o, and t) had plain white decoration and featured niches (an architectural feature that would be used to place lamps).80 These rooms could have been used as service or slave rooms.Similar plain decorated rooms appear in the Quartier du Thu00e9u00e2tre, for example room (g) in Maison du Trident (GD 118) and room (d) in Maison de Dionysos (GD 120), and it has been proposed that they were used as service or slave rooms.81Fig. 7. Maison de Sceaux, plan (source: Siebert 2001, pl. 6).Published with the permission of the French School in Athens (EfA).There might be, however, another explanation for this change.The modification of the ground floor created two clusters of small rooms: of (j), (k), and (l), and of (o), (n), (p), (q) (t), and (s).These rooms were accessible from area (i) of the courtyard, the pastas, and could have operated independently from the rest of the house, as stores, workshops, and spaces for some other commercial activity or rooms to be rented out.82 As in the case of House IC, the rooms that were originally laid out as typical oeci maiores, serving as reception rooms, were turned into service areas in the second phase. A comparison with the Maison des Sceaux (GD 59D) in the Quartier de Skardhana (the other newer neighborhood on Delos), whose destruction by fire has preserved evidence for the use of its rooms, is instructive.83 The Maison des Sceaux was also modified in a similar way in a later phase of the house (fig. 7). The east part of the ground floor was separated and small rooms were created to accommodate a store and workshop for grain, wine, and maybe olive oil production, which was accessible almost independently from the main entrance of the house.84 At the west part of the ground floor the traditional oecus maior of the house, room (u03bc), was connected with room (u03b9u0384) of the adjacent Maison de lEpu00e9e, thus extending the area of the house. In the new arangment adjacent rooms (u03be) and (u03b9u0384) were accessible only through room (u03bc), that was in turn accessible from the courtyard through pastas (u03b8u0384).This individual cluster of rooms could have been rented out to a business.85 The large number of pottery and twenty amphoras found in room (u03bb), to the east of pastas (u03b8u0384), as well as the large piece of furniture found along the east wall of its adjacent to the south room (u03ba) suggest that these two rooms were used as storage spaces.86 This storage could have served the activities of the adjacent cluster of rooms (u03bc-u03be-u03b9u0384), of the store and workshop at the east part of the house (u03c0-u03c1-u03c3-u03c4-u03c5) or of the inhabitants of the upper floor of the house. The presence of a personal archive of 16,000 seals (128/7 BCE u2013 69 BCE), a large number of whom bore names of the Italian families known to have been active on Delos, as well as the over-lifesize veristic portrait busts (Inv. nos. A7258, A7259) that came from the upper floor suggest that the owner(s) were Italian bankers/traders.87Similarly to the Maison des Sceaux, the modifications conducted at a later phase in Houses ID, as well as in House IC, created groups of rooms that could operate independently as workshops, businesses, storage places or sleeping rooms, and presumably could be rented out for such functions. The archaeological identification of such uses that the case of the Maison des Sceaux provides points to the information we lack in other Delian houses, where no fire destruction has preserved such material remains.The analysis of the architectural design of the houses allows us, however, to identify an architectural pattern in relation to these uses.We notice that in a subsequent phase some rooms of the ground floor, either intact or broken down to smaller rooms were grouped together and were made accessible through one and only entrance. In the Quartier du Stade, aside from Houses IC and ID, House IE features a similar distribution in its ground floor.The southern part of the ground floor of the house has a number of rooms that were accessible from the courtyard (d) and two of them were used as storage rooms (rooms [c] and [j]).Domestic economy or integrated commerce?Fig. 8.Maison des Comu00e9diens (left), Maison des Tritons (right), plan (source: Bruneau et al. 1970, pl. A). Published with the permission of the French School in Athens (EfA).The changes discussed in Houses IC and ID show that over time owners tried to make the most of the available space.The architectural analysis of the houses suggests that as in the case of the Maison des Sceaux these changes were implemented in order to create spaces that integrated the commercial needs of the city in the domestic sphere. I will draw examples from two more houses in the Quartier de Skardhana, the Maison des Tritons and the Maison des Comu00e9diens (fig. 8), to show the variety of architectural schemes that were used in order to accommodate the owners need for extra space.88 In these two houses small rooms were subsequently added outside the original plan of the houses, taking over part of the street, in order to create spaces for service, storage as well as workshops. In the Maison des Comu00e9diens, rooms (D) and (E) that were added at the south part of the house operated as a workshop for purple dye production as the great number of crashed mollusks in several of the numerous amphoras that were found in room (D) and the abundance of red color on the walls of the same room suggest.89 In the Maison des Tritons, rooms (AK-AKu0384) and (AL-AM-AN) were added to the south and east parts of the house, again taking over part of the street, in order to complement the service rooms of the household.90 Room (AKu0384) together with (AL), (AM) and (AN) operated as a bath. Room (AN) served to heat the sweating room (AM), a sudatio, that was accessible from the courtyard of the house through latrines (u0391u0399u0384) and (AKu0384), or directly from the street through room (AK).91 If the bath-suite was accessible from (u0391u0399u0384) through (AKu0384), which is more likely as there is 1 m difference between (AKu0384) and (AK) and a shallow wall separates them, (AK) could have operated as an independent storage room accessible directly from the street. Even if the bath-suite was accessible from the courtyard, it could have either been used by the inhabitants of the house or operated independently for profit as Tru00fcmper has suggested.92 Contrary to the cases of the Maison des Sceaux, Houses IC and ID, the owners of the Maison des Tritons and the Maison des Comu00e9diens wanted to make profit on their properties without however altering the spacious layout of the ground floor of their houses and changing their sumptuous character.93Recent studies of the economy of the Greek house and city have pointed out that no uniform rules can be deduced for the provision of commercial and storage facilities within domestic contexts. Each case is different and it seems that the available space was shaped in order to serve the individual needs of the owners.94 In the case of Delos, either the original larger rooms of the ground floor, the typical oeci maiores and oeci minores that Chamonard identified in the houses of the older neighborhood, the Quartier du Thu00e9u00e2tre,95 were subsequently broken down to form smaller rooms (e.g., House ID, Maison des Sceaux); or when this was not desirable, extra small rooms were subsequently added to the houses, which sometimes occupied parts of the street (e.g., Maison des Tritons, Maison des Comu00e9diens). In both cases owners aimed to create small spaces that could operate as storage or workshop rooms and could have also been rented out.In other cases, remote, not-well lit and/or ventilated areas of the houses were grouped probably in order to serve for such functions (e.g., House IC).It is possible that the storage spaces within the houses did not only serve the needs of the household but also complemented the storage needs of the commerce of Delos.96 A recent study of the shops in the Quartier du Thu00e9u00e2tre has shown how the interior shapes of the shops were in a subsequent phase furnished with shelves and mezzanines in order to accommodate the need for more storage.97 It is possible that changes in the spatial arrangements of the houses discussed here were conducted in order to complement the needs of the burgeoning Delian commerce. The case of the Maison des Sceaux provides a concrete example for the integration of commercial activities within the domestic sphere, to which the Maison des Tritons and the Maison des Comu00e9diens provide further parallels.The typological similarity of Houses IC and ID in the Quartier du Stade to the houses of the Quartier de Skardhana suggests that in the case of the houses of the Quartier du Stade as well owners created the new spatial arrangements in order to make profit in the dynamic economic microclimate of late Hellenistic Delos. Houses IC and ID in the context of the Quartier du StadeFig. 9.Insulae I and II of the Quartier du Stade, earlier phase, plan (after Plassart 1916, pl. 1).The development of Houses IC and ID, analyzed here, needs to be situated in the overall context of the two Insulae and their development.In an earlier phase of the neighborhood, Rue Transversale u2013 the street in between Insula I and Insula II u2013 was a private street that gave access to Houses IC, ID as well as IIA as the entering point to Rue Transversale from Rue du Stade operated as a doorway to a private street (fig. 9).98 Although House IIA was not investigated during the last two fieldwork seasons, Plassarts study indicates that there were originally two openings on the north wall of courtyard (d) opening onto Rue Transversale that were later closed. Several small private streets are noted in the Quartier du Thu00e9u00e2tre and the Quartier de Skardhana.99 It seems that a change, either of ownership or of the nature of the uses, led to this street being no longer a dedicated private point of access.It is possible that the move of the entrance to House IC from room (e) to room (a), as well as the entrance to House IIA from courtyard (d) to room (a) were associated with this change. Furthermore, the street in between House IB and House IE was closed only in the third phase of House IB, that is, end of second - beginning of the first century BCE, when IB was turned into a perfumery.100 This street was one of the streets providing access to the sea to the east side of the neighborhood and its closing may be associated with the change of the Rue Transversale from private to public in order to facilitate the circulation towards the shore and the port facilities that might have existed there. If this is so, the change of the nature of Rue Transversale from public to private, and the second construction phase of Houses IC and ID with the associated provisions for storage as well as small slave quarters, can be dated to the same period, the beginning of the first century BCE.The association of these changes points to the ways in which the growing manufacturing and commercial activities of Delos at this time u2013 for example, the conversion of House IB to a perfume workshop u2013 affected the development of the city. The changes in the layout of Houses IC and ID and the creation of the perfume workshop IB, as well as the changes in the street arrangement of the Quartier du Stade addressed here, may be further related to the building project of the Xyston and the Gymnasion at the end of the second century BCE and beginning of the first century BCE.The large window on the west wall of House IC provided a view into the newly refurbished Stadion. The refurbishment of the Stadion at the end of the second century BCE would have certainly incited the redevelopment of this area at the beginning of the first century BCE.This points to another major force shaping the ancient city of Delos, that of benefaction.Both religious and civic benefactions were means of self-representation and promotion and ignited the development of the sanctuary and city of Delos from early on.101 These benefactions in Delos during the late Hellenistic period must be understood in the context of competing claims over the growing importance of the international commerce of Delos. As Delos was a passage of trade, the storage facilities in the island point to one of the factors affecting the urban growth of the island.We already noted that the new neighborhoods were formed in relation to small natural port facilities, in order to assist the load of the major big port.The capacity of these small port facilities was significantly smaller and accommodated smaller boats.102 We may speculate that in the case of these smaller port facilities, the smaller in size and lighter in weight goods were traded, such as perfumes, unguents, incense, gems and dyes.103 Indeed the manufacturing facilities for dye and perfume have been identified only in these new neighborhoods, for example the perfumery at the Quartier du Stade and the purple dye installations at Quartier du Skardhana and the Quartier du Stade.104 Such products did not need the large storage facilities that we encounter to the south of the main port, but smaller facilities that could have been created within the residential units. The study of the storage facilities in the old neighborhood of the Theatre (Quartier du Thu00e9u00e2tre) has shown that by contrast to the large storage facilities around the port, the storage facilities further up the hill, in the neighborhood of the Theatre, were of smaller scale inside the boutiques and next to manufacturing installations, while some provisions were made inside the houses.105 In both new neighborhoods, the Quartier de Skardhana and the Quartier du Stade, there are no big storage facilities next to the port and the small storage facilities must have been integrated within the urban fabric, inside the residences (e.g., rooms k and l in House ID) as well as next to the manufacturing installations (e.g., perfumery IIB). The provision for storage within the neighborhood must have responded to the needs of the commercial activities of Delos and in close relation to the activities of the ports.ConclusionThis preliminary study of Houses IC and ID in relation to the overall development of the Quartier du Stade allows us to identify two driving forces behind the development of the area: on the hand, the provision of spaces that accommodated and complemented the commercial activities of the port u2013 which were smaller in capacity and satisfied a different kind of commerce than that of the main port u2013 and on the other, private initiatives that financed the public constructions shaping the city of Delos. Furthermore, the hastiness in construction attested in the construction techniques of the neighborhood, such as mud brick walls, suggests that changes were implemented reactively in order to fit the needs of the inhabitants and their commercial activities, which were not planned in advance.The rapid urbanization of Delos may be compared with far more accelerated developments of growing commercial centers of Asia, such as Hong Kong, and the private initiatives and public benefactions igniting development in the city may be also seen in relation to such initiatives today: for example, the Burj Dubai, now Burj Khalifa, which aims to receive international recognition and attract investment to the city. I do not wish to stretch this comparison far but merely point out that we are just beginning to understand such urban developments. Urban studies today recognize what may be termed a disciplinary paralysis to sufficiently describe, let alone influence, the accelerated urbanization in developing regions of the world and the rapid redevelopment in existing urban areas.For this reason urban studies today examine the evolving agents, relationships and consequences of contemporary urbanization.106We tend to examine the large scale urban planning as applied on virgin terrain and the ways in urban planning initiatives matched the existing organic growth of cities. We identify the ancient city on the basis of key ingredients u2013 aside from city walls and cemetery boundaries in the Hellenistic period these are: gymnastic edifices, theatre, agorai and monumental sanctuaries.107 The example of Delos is indeed unique in that it is a city with no walls to mark its boundaries or gates and tombs pointing its entrance.The sea is the boundary and the port facilities are the gates to the city of Delos. In Delos we see Purcells notion of the coastline, the ora maritima, as a concept of organization of human resources rather than a simple geographical term.108 Aside from this particularity, Delos has the ingredients, the key structures, of a Hellenistic city.But in its particularity, the rapid urban development of Delos in the late Hellenistic period points to the interior workings of the city, its small-scale developments vis-u00e0-vis the large scale forces that shaped the city u2013 in this case economic activities and benefactions. The unique character of Delos brings to our attention the ties between economic and urban growth u2013 a relation that is not unique to Delos, but merely exaggerated.In the late Hellenistic period Delos became a merchant city, to adopt the term of Max Weber u2013 a city maintained by its commerce, whose organization and form were indeed shaped vis-u00e0-vis handling and shipping activities.109In this preliminary sketch of my study of Delos I have tried to outline the factors that influenced the growth of Delos in the late Hellenistic period and relate them to the construction history of the Quartier du Stade. Nothing could have predicted this enormous expansion of Delos in this period u2013 neither the fame of the sanctuary, nor the quality of the port, nor the commercial activity on the island during the period of Independence nor the geographical position of Delos.Delos does not occupy a better or more central position in relation to the neighboring islands of the Cyclades.The decision of Rome to grant the island the status of a free port combined with the destruction of Corinth, a powerful rival, in 146 BCE, as well as the intensification of the relation of Rome and Pergamon for which Delos played an intermediary role, led to the commercial and urban development of Delos.#p61In effect, the settlement that we now see dates from this period. The urbanization of the island was rapid and took place during roughly 70-80 years, in the manner of what we call today a boomtown.This period is abruptly stopped after the sacks of 88 and 69 CE.As a typical boomtown the city becomes a ghost town when it ceases to be an economic center u2013 although there is some attested occupation, especially in the areas of the sanctuary and its immediate surrounding structures in the imperial period. Delos never again gained a major importance as a religious center, and after a small prosperity of the island during the palaeochristian period, the island is abandoned at the end of the sixth century CE."
}