{
  "articleId": "isaw_paper18_8",
  "text": "ARTICLE_ID: isaw_paper18_8\nIncubation in Demotic Literature Unknown Author Despite the occasional appearance of studies of dreams in ancient Egypt, there has not been one devoted exclusively to the cult practices of divinatory and therapeutic incubation there, and most of the studies that do touch upon incubation pre-date the publication of several Demotic tales from the Tebtunis Temple Library that provide new insights. This gap in the scholarship has now been addressed in my 2017 bookWhere Dreams May Come: Incubation Sanctuaries in the Greco-Roman World, 2 vols. Religions in the Graeco-Roman World 184. Leiden/Boston, which makes full use of the documentary and literary sources from Egypt to establish what can be known regarding the religious phenomenon of seeking oracular or curative dreams from gods at their sanctuaries (a practice widespread among the Greeks beginning in Classical times, if not Archaic). Demotic works of fiction represent an irreplaceable source of information, as I discussed at the “Cult Practices in Ancient Literatures” workshop, but since the conference paper was derived from the book (especially pp. 74–100), here I provide only a brief summary of the topic rather than a full-length article.⬈ Dreams and dream accounts represent a frequent element of Demotic literature, appearing in more than half of the longer surviving examples. While all such passages are of interest, only the ones stating (or likely to have stated) that a dream had been received at a temple are relevant, insofar as they add to our understanding of this ritual and its role in Egyptian religion. A full appreciation of the issues involved in employing Demotic tales as evidence for incubation can be achieved by using an approach common among journalists: asking the questions known as the “Five W’s (and one H) of journalism,”i.e.Who? What? When? Where? Why? and How?⬈ Overall, then, the Demotic tales (and related Greek works) provide a rich and multifaceted body of evidence for the history and role of incubation – particularly divinatory and fertility incubation – in Egyptian religion, and one that must be studied in detail for a proper appreciation of this phenomenon.⬈ I would like to thank the audience and participants of the “Cult Practices in Ancient Literatures” workshop for their feedback on my paper, and Franziska Naether both for organizing the event and helping me in numerous ways to gain a greater understanding of Egyptian literature and religion as I worked on the book from which this talk was drawn. While several other people deserve to be acknowledged for this as well – and indeed they have been, in that work’s introduction – I must single out for additional thanks Kim Ryholt, who has provided valuable information regarding unpublished Demotic literary texts that he or colleagues are or were editing, and who shared his thoughts on a number of issues pertaining to dreams in Demotic literature.⬈"
}