{
  "articleId": "isaw_paper18_4",
  "text": "ARTICLE_ID: isaw_paper18_4\nISAW Papers 18.4 (2020) At the end of the Sumerian narrative poem Lugalbanda and the Anzu Bird, the hero Lugalbanda is sent home from the battlefield to the city of Uruk by his king, Enmerkar. Enmerkar’s army is losing its siege against Aratta, a faraway city-state, and Lugalbanda’s mission is to find out from Uruk’s patron deity, Inana, what can be done to change the course of the campaign. The goddess responds with a lengthy description of a ritual whose meaning and literary function is obscure: Lugalbanda and the Anzu Bird is the second in a set of two narrative poems featuring the hero Lugalbanda. They belong to a cycle of four closely related Sumerian tales that are concerned with the rivalry between the Mesopotamian city of Uruk and its fabulously wealthy mythical counterpart, Aratta.2 The surviving copies of these texts date almost exclusively to the Isin-Larsa period (2017–1763 bce),3 but all likely originated in the Ur III period (2112–2004 bce).4 In the first of the two Lugalbanda stories, commonly known as Lugalbanda and the Mountain Cave, the hero is marching to battle with the army of Uruk when he becomes ill and has to be left behind in the mountains. He survives alone in the wilderness by (re)inventing fire-making, cooking, and trapping. There, he prays to the celestial gods, and, ultimately, his illness is cured. Lugalbanda and the Anzu Bird picks up where the previous story left off: now lost in the mountains, Lugalbanda ingratiates himself with the powerful Anzu bird to obtain its help in finding his way back to his fellow troops. Anzu magically grants him the ability to run with superhuman speed and endurance, and Lugalbanda easily overtakes his comrades on the road to Aratta. The army of Uruk marches on and begins its assault against the enemy city, but, after a year of siege warfare, they still find themselves stymied by Aratta’s defenses. Enmerkar, king of Uruk, suspects they are deadlocked because he has lost the favor of Inana, patron deity of his city, and Lugalbanda uses his new power to sprint back to Uruk to entreat the goddess on behalf of the king. In answer to Lugalbanda’s plea, Inana offers a ritual that will sap Aratta’s strength. The procedure that she recommends is to be carried out at a body of water described as the “gleaming water skin of Inana” (kušummud za-gìn dinana-ke4). In this mystical location, called a “holy place” in lines 396 and 403 (ki kug-ga), Inana advises the king, Enmerkar, to perform the following actions: Fell a solitary tamarisk tree at the water’s edge Manufacture a bucket from the wood of the tamarisk Uproot old reeds from the water Capture the ĜIŠ.ŠEŠ fish Cook the ĜIŠ.ŠEŠ fish Feed the ĜIŠ.ŠEŠ fish to the ankar weapon, “Inana’s battle strength” (á mè dinana-ka) The propitiation of the gods through gifts of foods, beverages, and fragrances was a pillar of Mesopotamian religious practice for millennia.5 In addition to the regular offerings, which included daily meals provided to the cult statues in their temples and sacrifices made during monthly or annual festivals, special offerings could be given on behalf of the community or an individual in celebration, thanksgiving, or to obtain divine aid. Both the gods themselves and their divine emblems were suitable recipients for these gifts.6 The ritual prescribed by Inana therefore falls well within established Mesopotamian religious practice, but the precise meaning of this section of the epic remains unclear. In the first instance, the appropriateness of the procedure for securing the goddess’ favor and overcoming Aratta’s resistance is not self-evident. Why is it necessary to sacrifice a fish, in general, and the ĜIŠ.ŠEŠ fish, in particular? Sacrifices of fish were common in Mesopotamia, and offering lists record that certain deities at times exclusively received large quantities of fish, Inana being one example.7 Furthermore, why must Enmerkar catch the fish in a bucket fashioned from the wood of a specific tamarisk? Basket traps and creels were commonly used in Mesopotamia both for freshwater fishing and for transporting the catch to the storage rooms of temples and palaces.8 Tamarisk branches are pliable enough to be used in weaving – the Hopi people of the American southwest, for instance, incorporated tamarisk into their woven baskets when the plant was introduced to the region.9 The cane, rushes, and reeds that grew plentifully in the Mesopotamian marshlands, however, would presumably have been a more convenient source of materials for crafting a trap. As a conclusion to the epic narrative, the passage also disrupts a standard structural feature of Sumerian poetry: repetition. Leading up to the oracular pronouncement, Enmerkar, encamped at Aratta, recites a long message to Inana (lines 294–321) that is recapped line for line by Lugalbanda when he arrives at the goddess’ temple in Uruk (lines 360–387). Similarly, we would expect Inana’s directions to be reiterated in the poem in a subsequent performance of the ritual by Enmerkar, which would bring the action of the narrative to a resolution. Instead, the reader is left hanging – instructions have been issued but not (yet) followed, and the words of Inana’s speech are suspended in the air, never to be repeated. A partial explanation of the passage has been provided by Jeremy Black, who posits that Inana’s speech is an allegory that refers back to previous elements of the story, in order to bring the whole content of the poem to a coherent conclusion. He calls this the “‘inclusion’ or ‘embedding’ of one genre within another, i.e., an allegory is included within the mythic/legendary narrative.”10 Black identifies many correlations between aspects of the ritual and previous episodes in the poem, including repeated vocabulary and imagery. Based on these allusions, Black suggests that the three fish referred to in Inana’s oracle correspond to characters that appeared earlier in the story: the kiĝtur fish to Lugalbanda; the suḫurmaš fish to the Anzu bird’s chicks; and the ĜIŠ.ŠEŠ fish to the Anzu bird itself.11 Black does not believe that we can decode the ritual point for point in order to “solve” it, like a riddle;12 nor does he suggest that his is a complete explanation for the passage. Instead, he says: “the content of the oracular utterance is like a dream, in which familiar elements are rearranged and make nonsense.”13 Black’s account sheds light on one way in which the description of the ritual serves to conclude the epic narrative: by recapitulating, in allusive terms, the key images of the story. But if Inana’s oracle is like a dream, then, dreamlike, it may contain multiple layers of significance.14 Not only is polyvalence a defining feature of literary texts,15 it was also a principle embedded in many aspects of Mesopotamian culture, from the polysemy of cuneiform signs to the portentous meanings believed to be hidden in everyday events. Beyond reprising episodes that occurred earlier in the text, I propose that Inana’s utterance contains both sexual and astral symbolism. Like the allegorical correspondences that Black has identified, these symbols allude to – and, ultimately, resolve – themes that are developed throughout the poem. Both layers of meaning hinge on two crucial items that Inana instructs Enmerkar to use in the ritual: first, the bucket made of tamarisk wood; and, second, the enigmatic ĜIŠ.ŠEŠ fish, to be captured in the bucket and sacrificed to the ankar weapon. A recurring theme in Lugalbanda and the Anzu Bird is the relationship between human and deity and, more specifically, the relationship between the king of Uruk and his patron goddess, Inana. The nature of this relationship is not straightforward, but imagery throughout the narrative emphasizes its intimacy and its resemblance to the bonds of kinship. The comparison to a parent/child relationship, for instance, occurs a number of times, with the deity occasionally filling the role of the parent and occasionally that of the child.16 Enmerkar refers to Inana as his “princely sister” (nin9 e5-ĝu10);17 and, finally, there is a passage that equates the rapport between king and goddess to the relationship between lovers.18 A marital or sexual relationship between the king and the goddess Inana is a common motif of Sumerian literature. The designation “(beloved) spouse of Inana” – dam (ki-áĝ) dinana – first appears as an attribute of a Mesopotamian monarch in the mid-third millennium bce.19 The title becomes more prevalent during the Ur III and Isin-Larsa periods, contemporary with the composition of a number of royal hymns that include “explicit references to erotic relationships between individual historical rulers and Inana.”20 In visual culture, several Old Babylonian cylinder seals, like the one pictured below, depict a goddess and the king clasped in an embrace. Figure 1. Old Babylonian cylinder seal showing a goddess embracing a king (far right). Image courtesy of the British Museum. The extent to which this literary and iconographic motif reflects actual cult practice has been the subject of considerable debate. Although the literary sources were, in the early and mid-twentieth century, used to reconstruct a Sumerian sacred marriage rite involving a sexual union between the king and a priestess of Inana, no surviving Mesopotamian ritual texts describe such a ceremony, nor indeed any type of ritual enactment of marriage between the king and the goddess or her proxy.21 As a metaphor, however, the erotic relationship between Inana and the king serves, as Pongratz-Leisten has observed, both to reinforce the individual ruler’s legitimacy by creating familial affiliations with the gods and to “[sacralize] the institution of kingship.”22 Lugalbanda and the Anzu Bird was composed during the Ur III period and copied during the Isin-Larsa period, at the height of attestations of this metaphor, and Inana’s relationship with the king plays a prominent role in all four Sumerian poems dealing with the conflict between Uruk and Aratta. The success of Uruk’s military campaign against Aratta in the Lugalbanda poems ultimately hinges on Inana’s divine support, hence the return of Lugalbanda to Uruk to learn what needs to be done to restore Enmerkar to her good graces. In the other two poems of the cycle, Enmerkar and the lord of Aratta each set out to prove, by means of a contest of wits or witchcraft, that he is the goddess’ true favorite – and that his rival should therefore submit to his authority. In Enmerkar and Ensuhgirana, this partiality is couched in explicitly sexual terms. At the conclusion of the narrative, once Uruk has triumphed in the competition, Ensuhgirana acknowledges Enmerkar’s superiority by saying: “You are the beloved lord of Inana, you alone are exalted. / Inana has truly chosen you for her holy loins, you are her beloved.”23 I propose that the ending of Lugalbanda and the Anzu Bird contains corresponding, if more subtle, erotic content and that the action Inana advises Enmerkar to perform – to catch a magical fish in a ritually-prepared bucket – is an allusion to sexual intercourse between king and goddess, with the bucket symbolizing the goddess’ vagina and the fish the king’s phallus. Mesopotamian cult statues, representations of the gods that were the focus of public worship, were typically made of a wooden core plated with precious metal and dressed in valuable garments.24 The practice of ritually investing these images with the presence of the deity informs the plot of Lugalbanda and the Anzu Bird: the reason Lugalbanda must travel all the way back to Uruk to ask for Inana’s guidance is so that he may visit her in the form of her cult statue in the temple. In the Sumerian literary debate between the tamarisk and the date palm, the tamarisk boasts that its flesh is the “flesh of the gods” (su diĝir-re-e-ne) and for this reason the fruits of the date palm are laid before it in offering.25 The date palm responds: “You may be the flesh of the gods in their shrines... but it is silver that can pride itself as the skin of the gods.”26 This exchange plays on the use of tamarisk-wood as a base material in the manufacture of cult statues.27 In the context of the Lugalbanda epic, then, when Enmerkar fashions a bucket from the tamarisk tree, he is crafting a vessel (an object whose hollow shape is emblematic of female genitalia28) in a way that mimics the creation of a cult statue, using a substance recognized as very the flesh of the gods. Fish, on the other hand, are linked with (re)production in one of the other poems of the Uruk/Aratta cycle, Enmerkar and Ensuhgirana, the same text that describes the relationship between Inana and the king in explicitly sexual terms. During that narrative’s contest of enchantments, the wise woman of Uruk and the sorcerer of Aratta cast fish spawn into the Euphrates river and conjure from it various animals. The copious number of eggs produced by fish may have contributed to their association with generative force. The oblong shape of a fish, moreover, lends itself to identification with the phallus, with the fish’s head representing the glans penis and its small mouth the urethral opening. The cross-cultural phallic symbolism of the fish was recognized as early as 1872 by Angelo de Gubernatis in his book Zoological Mythology. He pointed out that in the Neapolitan dialect of Italian the word pesce (“fish”) was even slang for the phallus.29 Ancient Egyptian sources recount that the phallus of the god Osiris was devoured by a fish after he was murdered by his brother Seth, and sea creatures supplied an abundance of bawdy metaphors for human genitalia in Greek comedy.30 In Lugalbanda and the Anzu Bird, the fish is fleshy, representing the king’s human, earthly substance, in contrast to the bucket, which is made of the tamarisk-wood stuff of the gods. Notably, the symbolically male fish and symbolically female bucket are distinguished from each other as active from passive: the immovable bucket passively receives the living, writhing fish.31 There are other erotic overtones to the interlude. The entire scene takes place in a marshland, and both fish and tamarisk partake of the waters of this sacred place. Waters are closely connected with sexuality, fertility, and cosmic creation in both Sumerian and Akkadian literature.32 In Sumerian, the word a, meaning “water,” is used to refer to semen,33 and hymns describe Inana’s vulva as a “wet place”34 and a “watered”35 ground. Marshes (ambar) in particular figure as the sites of sexual assignations; in some texts the marshland itself serves as a metaphor for the female pudenda.36 The king’s hunt for the fish also evokes sexual pursuit. As a concluding episode for the epic, then, the sexual symbols embedded in the ritual resolve the tense relationship between the goddess Inana and the king that has led to the stalemate in Uruk’s battle with Aratta. Inana, who was previously described in the narrative as having abandoned Enmerkar, “like a child that hates its mother,”37 will resume her role as king’s consort by means of the ritual. Family ties between the king and the gods will thus be reaffirmed, and divine support of Enmerkar’s rule will be restored. In addition to its erotic content, the king’s pursuit of the mystical fish suggests a second layer of astral symbolism. One reason the ritual has proven so difficult to interpret is that it is unclear exactly what Inana is asking Enmerkar to catch for her. The mysterious ĜIŠ.ŠEŠ fish appears in only two surviving texts ,38 Lugalbanda and the Anzu Bird and a royal hymn of Ur III king Shulgi, where it appears in a context with other mythological fish.39 I believe a clue to the identity of the ĜIŠ.ŠEŠ fish lies in the description diĝir suḫur-máš40 The goat-fish or carp-goat is a mythological creature whose body consists of the head, chest, and forelegs of a goat coupled with the tail of a fish. It is most familiar today as the zodiacal sign Capricorn (Figure 2). Figure 2. Gold coin of the Indian Mughal empire depicting Capricorn, 1621–1622 ce. Image courtesy of the Metropolitan Museum of Art. The association between the constellation we now know as Capricorn and the mythological hybrid goat-fish originated in Mesopotamia. The modern zodiac, consisting of 12 signs dividing the sky into equal segments of 30 degrees each, was established in Babylonia in the fifth century bce.41 Prior to that period, Mesopotamian astronomers recognized 17 to 18 constellations along what was called the “path of the moon” – the ecliptic.42 We have textual evidence for the identification of the constellation Capricorn with the suḫurmaš goat-fish by the end of the second millennium bce,43 but representations of goat-fish in Mesopotamian iconography appear a full millennium earlier, in the Ur III period when the Lugalbanda narratives were likely composed (Figure 3). Figure 3. Cylinder seal of the Ur III period. The second figure from the left, possibly the god Enki-Ea, sits with his feet resting on a goat-fish. Image courtesy of the British Museum. Mesopotamian divinities were composite beings who could manifest in, and act on, the world in a multiplicity of forms, including as celestial bodies. The moon, for instance, was an instantiation of the god Nanna, the sun of Utu, and the planet Venus of Inana.44 The association between deities and cosmic bodies was so close that the very cuneiform sign for “god”– diĝir – was based on the shape of a star.45 In this religio-social context, the characterization of the ĜIŠ.ŠEŠ fish as the “god” of the goat-fish may classify it as a being with a celestial dimension, and, by extension, as the divine goat-fish that is manifest in the sky in the form of the Goat-Fish constellation. In both the late Babylonian 12-sign zodiac and the earlier list of 17 to 18 constellations in the “path of the moon,” the Goat-Fish is immediately followed by gu-la, the “Great One,” the constellation we know today as Aquarius. This corresponds to the positions of the two constellations side by side in the night sky. We have textual evidence for the Great One constellation by the Old Babylonian period, at the beginning of the second millennium,46 and Edith Porada has suggested that there is a continuity from visual images of a nude, bearded hero dating as far back as the Jamdat Nasr period, circa 3000 bce, through Old Babylonian cylinder seal designs showing a nude male figure with two streams of water flowing down on either side of him and, often, stars flanking his head (Figure 4), to later representations of Aquarius.47 Figure 4. Cylinder seal of the Old Babylonian period. The second figure from the left is an en face nude, bearded hero holding a pot from which streams of water flow down on either side of him. Image courtesy of the British Museum. When visible, during the fall and winter months in the Northern hemisphere, Aquarius appears to follow Capricorn slowly across the heavens over the course of the night due to the rotation of the earth. Enmerkar’s pursuit of the ĜIŠ.ŠEŠ fish in the Lugalbanda ritual may therefore allude to an observed astronomical phenomenon, Aquarius’ nightly chase of Capricorn, symbolically linking Enmerkar, the valiant king of Uruk, with the Great One constellation, the celestial hero. Although it is tempting to imagine that the passage played an etiological function, explaining the existence of these constellations and their movement across the heavens, this is far from clear, particularly given the obscurity of the ritual and its multiple layers of allegorical meaning. The ritual may instead have been conceived, at least in part, as a performance of a celestial event. There are a number of indicators that the ritual recommended by Inana at the end of Lugalbanda and the Anzu Bird is intended to conclude not only the text in which it appears but both Lugalbanda poems taken together as a more or less cohesive whole. For example, a number of rare terms used in the description of the ritual also occur in Lugalbanda and the Mountain Cave, the first of the two narratives, including kušummud “water skin,” gišbuniĝ “bucket,” and á-an-kár “the ankar-weapon.”48 Astral content in the ritual would resume the theme of celestial healing that was introduced in Lugalbanda and the Mountain Cave, where Lugalbanda’s illness is cured through prayer to the celestial gods,49 thereby providing, in addition to the resumption of the king’s erotic relationship with Inana, a second means of restoring Uruk’s military might and settling the city’s conflict with Aratta. It is perhaps not surprising that the invocation of celestial imagery would be required to placate Inana in particular, who is called upon by Lugalbanda in her cosmic manifestation as the planet Venus to help him in Lugalbanda and the Mountain Cave. The ritual that concludes Lugalbanda and the Anzu Bird is densely packed with multiple layers of symbolic meaning that resume and resolve the many themes of the narrative and its companion text in a single sequence of events. Jeremy Black has identified allusions in the ritual that refer back not only to earlier episodes in Lugalbanda and the Anzu Bird but to passages in Lugalbanda and the Mountain Cave. In addition to these, the action of catching the ĜIŠ.ŠEŠ fish in a bucket made of tamarisk wood not only has an erotic dimension, symbolizing intercourse between the earthly male ruler and the goddess Inana, but also perhaps includes a celestial dimension whereby Enmerkar’s chase after the fish represents Aquarius’ pursuit of Capricorn across the heavens. Both the erotic and celestial content of the ritual offer distinct means of returning the advantage to Uruk in its military campaign against Aratta: first, by re-establishing the king’s intimate relationship with his city’s patron deity; and, second, through the process of celestial healing that was successfully used to cure Lugalbanda in Lugalbanda and the Mountain Cave. The reiteration of themes and images from both Lugalbanda poems may explain why the ritual appears only once, without the repetition characteristic of Sumerian poetry: the ritual itself is a synthesis and a repetition of motifs and episodes developed elsewhere in the epic narrative."
}