{
  "articleId": "isaw_paper22_2",
  "text": "ARTICLE_ID: isaw_paper22_2\nThis paper addresses a methodological consideration that every teacher, researcher, and human being existing in the world faces daily.Abstraction is a vital process behind any attempt at understanding or representing reality.As such, it is key to the role of the historian, and to the game designer attempting to create a simulation, no matter how loosely that simulation adheres to our understanding of historical reality. For the historian creating games or simulations, abstraction is a painful art, because creating something that succeeds as both a game and a historical work requires a ruthless commitment to selectivity.In what follows, I will discuss some specific examples of abstraction, outline why attention to abstraction is critical to intentionally designing games that address historical topics, and show how I considered issues of abstraction in a historical design of my own.1Abstracting SpaceIn geographical representations as in ludic representations, abstraction is essential. The process of translating the world that we see around us from satellite imagery to a human-useable map is a process of abstraction, that is, selection, aggregation, categorization, measurement, representation and a host of other decisions by the cartographer. A cartographer applies their judgement in this process of abstraction and thus translates that information about the world into a map.The kind of map that is produced and the kind of information it conveys reveal some of the priorities and judgements of the maps creator and the cultural forces of their society. For example, how different designers draw the subway lines, land masses, hours of operation and whatever other information they include in a subway map suggests something about how they imagine the lived space of the city (fig. 1).Fig. 1 The Abstraction of New York.Satellite imagery to Subway Maps.From left to right Satellite image from Google Maps, New York City MTA Subway Map designed by Massimo Vignelli in 1972,2 NYC MTA Subway Map designed by Michael Hertz in 1979,3 Eddie Jabbours unofficial KickMap of the NYC subway system.4This logic of abstraction might be articulated as followsA text is an abstraction of a world (including imaginary and historical worlds).An abstraction is built through processes of selection and aggregation.Acts of selection and aggregation are guided by individual judgements (often unspoken & implicit) made by the creator of the text.Texts produced within a society are permeated by the assumptions of that society and the positionality of the creator within it.This process can be applied to any text, including maps, visual art, and literary texts that construct historical worlds, fictional worlds, or historically imagined fictional worlds like that of the Iliad. It also applies to ludic representations.After all, a game is a text that abstracts a world through procedures, rules and systems to create a space for play.In other words, game design is an exercise in selection and aggregation with the purpose of creating an abstraction.The intersection between games and cartography is illustrative of how historical games use abstraction to make historical arguments and encode assumptions about the ancient world. The following three examples, show the relationship between gameplay, player goals, and the map as a play space.Fig. 2 Imperium Romanum II (1985).5Imperium Romanum II (West End Games, 1985) represents the geographical space of the Roman Empire as a uniform hex map (fig. 2).The victory conditions vary by faction and scenario, but most involve some combination of elimination of enemy leaders and control of provincial regions. The players goals and the play space encourages a 19th or 20th century model of warfare in which two lines of opposing armies attempt to block or penetrate the other.Fig. 3 Successors (2008).6In Successors (GMT Games, 2008), the map is a network of named nodes, most of which represent cities, linked by lines along which movement can occur (fig. 3).One of the ways to win involves controlling defined groups of these nodes (called provinces).7 The game emphasises lines of movement and connectivity between cites as well as the importance of controlling cities both for controlling movement around the play space and ultimately for victory.Fig. 4 Time of Crisis The Roman Empire in Turmoil, 235-284 AD (2017).8In Time of Crisis (GMT Games, 2017) the geographical location of a piece is only defined at a regional level (e.g. all units in Hispania are in the same space) (fig. 4).9 Players score points by having leaders in the capitals of these regions. Troops move between and occupy regions in order to give bonuses to place leaders in and remove leaders from those capitals.In this representation of space, detailed movement is entirely abstracted away to focus on the aspects of the historical period the designers wished to focus on.Each of these maps was created through a deliberate choice of the designer about how to represent space and its relationship to history and to game play. In each case, that abstraction of space has a relationship to the games victory conditions and involve considerable limitations on realistic geographical interactions.Because of this, each game makes historical arguments about the relationship between space and power.10 Both the map and the victory conditions abstract extremely complex systems in geographical and political space into player-comprehensible representations. However, while each such choice was deliberate, it may not have been made with the goal of making a specific historical argument.At a certain point, any game designer will have to abstract their subject to a level that produces the kind of play experience they want to achieve.These choices about the level of abstraction condition the processes that occur during a given game as well as the goals that players strive towards. Game designers will often look at these aspects of a game in reverse, asking how do I write the rules of this game to encourage players to act in a certain way during play.For example, designers concerned with the historical authenticity of their games, will often consider how they can design their rules to create historical outcomes or whether the game is sufficiently accurate for their taste.For historians engaged in what we might call scholarly design, it is important to examine also the historicity of the processes of abstraction themselves what aspects of the historical source material were selected, which aspects were omitted, what arguments do those acts of abstraction make about the historical world that this represented, and so on.While we might imagine that every designer of a historical game examines historical processes and applies processes of abstraction to derive the processes of play for a game, the scholar designer should be attentive to the relationship between abstraction and historical argument and consider the historical arguments that their choices bring to the game at each step.This is where the pain comes in.Abstracting HomerThe act of abstracting a set of source material and transferring it into another medium is an act of translation. No translation can perfectly and elegantly convey the entire semantic range of a word, phrase, grammatical or metrical construction; the creative production of the translator is inevitably at work.They must make hard decisions about which words to choose and which potential readings to emphasise.Their goals and the context of the translation will influence the output.Similarly, as a designer, your game cannot include every aspect of the source material. You have to make choices.My next example draws on a game created by upper-level Classics majors in a Short Term class at Bates College in May 2019.Over the course of a month they abstracted the highly complex textual world of Homeric battle into a 45-60 minute two-player bluffing card game called The Fall of Troy.11 Before analysing some aspects of this games design, I will give an example of play. The opening of Iliad 3 (in abbreviated form) sets the stageNow with the squadrons marshalled, captains leading each, the Trojans came with cries and the din of waru2026But Achaeas armies came on strong in silence, breathing fury, hearts ablaze to defend each other to the deathu2026Now closer, closing, front to front in the onset till Paris sprang from the Trojan forward ranks, a challenger, lithe, magnificent as a god, the skin of a leopard slung across his shouldersu2026Soon as the warrior Menelaus marked himu2026 [he] thrilled like a lion lighting on some handsome carcassu202612Fig. 5 Menelaus and Paris (cards created by Berdon, Carrera, and Lewis using internet clipart)We all know how the eventual fight goesBoth men armed at opposing sides of the forces, into the no mans land between the lines they strode, glances menacing, wild excitement seizing all who watched, the stallion-breaking Trojans [Played 2 Infantry, 1 Cavalry Battle Score +5] and Argive men-at-arms [Played 2 Infantry Battle Score +2].Paris hurled his far-shadowing spear, Menelaus reared with a bronze lance and a prayer to father Zeus [Played Hecatomb].13Unfortunately for the Greek player, Zeuss favour only prevents another god from interfering with the war by cancelling their divine favour and the Trojan played did not play a Hecatomb to cancel.They added up both sides, The Trojan player won and received 2 VP towards the 15 they need to win the war. All the infantry, cavalry and hecatombs were discarded and the players checked for Fate Pairs.Menelaus was Pariss fated victor, so Paris was killed and permanently discarded; Menelaus returned to the Greek players hand.Just like Homer said, right?Fig 6 The Fall of Troy playtest. (Photo by the author).In discussing this game, I will focus on two instances of abstraction the Battle Score and the Fate Pairs. In The Fall of Troy, the two players control the Greeks and the Trojans respectively through a series of battles.The winner of each battle is the side with the highest Battle Score.Players play cards representing heroes and soldiers each of which increases their own battle score by the amount printed on the card (fig. 5).Players can play as many cards as they want in each battle in order to achieve the highest score but they must play all their cards at once without knowing what the other player has played (fig. 6; note the symbolic wall that separates the two play spaces from the view of the opposing player). The limiting factor is that soldier cards can only be played once in each game and each hero can be played every second turnu2014with the risk that they might be permanently lost (removed from the game) depending on the cards the other player plays.The mechanic of the Battle Score arises from the design goal of having a simple system in which each participants impact on each conflict is defined by a single statistic, their combat bonus. In deciding which numbers to assign, the designers had to assign quantitative weight to the qualitative data of the source material.This involved choices about relative rankings based on the designers judgement.In many cases, the Iliad makes the relative combat prowess of the various heroes clear, but in some cases other considerations must enter play, such as narrative importance.The designers also wanted to include the concept of divine fate for important individuals. To express this concept each hero has two names printed on their card (Fate Pairs, fig. 5). A name in green indicating the hero who will be defeated by this card and a name in red indicating the hero who will defeat this card.While this allows for a well-balanced game, it does not apply neatly to the Homeric textual world in which most important Greek heroes survive and most important Trojan heroes die. Imaginative interpretation of the source text is sometimes required.For example, in the pair above, Menelaus is fated to defeat Parisu2014a reading that considers Aphrodites abduction of Paris from the battlefield as mechanically equivalent to death.In the case of Menelaus defeat by Pandarus, the design suggests that after Athena manipulates Pandarus into shooting Menelaus, the default outcome is that she does not save Menelaus from death (unless the Greek player plays some other card to save him).14A number of design goals are evident in the preceding descriptions We might list these asmodel the military conflict that underlies the Iliad.incorporate the actions of the gods in the conflict.make the conflict system as simple as possible.model the importance of fate in conflicts between Homeric heroes.Underlying the abstractions are two further assumptions. First, that the designers are willing to accept outcomes at variance to the source text, most notably that the Trojans can win this war.15 Second, that the designers aim to give both players an equal playing field.This can be seen above in the requirement that each hero be a fated victor over one other hero and be a fated victim to another.It is also clear in that both sides have the same number of heroes and that each set of heroes has the same array of Battle Score bonuses, one +7, two +5s, and four +3s. These assumptions could be reframed as two additional design goalsthe Greek and Trojan sides can each win the game according to the same victory conditions.the abilities and capacities of the Greeks and Trojans are symmetrical.Each of these design goals could be defined as historical or practical.Historical design goals arise from some aspect of the source material or from the broader historical context. Practical design goals arise from some aspect of the surrounding context of play other than the historical source material.In my analysis of The Fall of Troy, I would categorise goals 1, 2 and 4 as historical and goals 3, 5, and 6 as practical.16It is inevitable that some choices in the process of abstraction will be made from a practical perspective rather than from a historical one.For example, maps are smaller than the world and thus require omissions and the grammatical structures of a source language are not those of a target language and require more than lexical equivalence to produce translation. The goals of the designer will not conform exactly and entirely to the goals of the source text, and because of this certain ahistorical outcomes will become embedded in the game.Nevertheless, as designers, thoughtful and intentional consideration of our goals can focus historical attention on the aspects of the game we want to be the most accurate.Abstracting MesopotamiaThe Fall of Troy emerged from a class in which the students played a number of historically themed games and then designed their own. One of the games they played, was a game I had designed a week or so earlier, now named Regna Adsignata.My design had two historical design goals (HDGs)communicate the arc of the history of Romano-Parthian conflict in the Roman Near East.17demonstrate through play the precarity and limited agency of allied kingdoms at the edge of imperial states.18Regna Adsignata also had practical constraints that arose from the context of the class. The game needed to run during in-class game labs, to include a certain number of students, and to fit with the other games I had chosen for the relevant week and for the course as a whole.That created several practical design goals (PDGs).19play time of 45-60 minutescapacity of at least 4 playersexpose the students to new game mechanicsbe accessible and fun to a non-specialist audienceIt is always good practice to have clear design goals, but this is especially important when designing a game with attention to the historical argument, because these design goals are your guides as to what will be included and omitted and on the level of abstraction required.Fig. 7 Regna Adsignata Playtest (Photo by the author)In Regna Adsignata20 each player plays an allied kingdom in the Mesopotamian Borderland (fig. 7); the actions of Rome and Parthia are determined by card draws from the event deck. Each turn of the game represents about 25 years and proceeds through the following phasesDraw an Event card21Players choose actionsDetermine and resolve Local ConsequencesResolve actionsThis order demonstrates the precarity of allied kingdoms (HDG 2).The players have a general idea of what the Imperial powers might do (Event card) but they dont know how that plays out in terms of imperial power in the borderland (Local Consequences) (PDG 3).The two big levels of abstraction here are time and player agency each 25 year turn includes only two significant events (one global and one local) and one action from each player-kingdom; for that action, each player must choose one resource to focus on each turn, either prestige, money, or military power. The design attempts to strike a balance between chronological scope and desired level of complexity, where the latter is measured most easily in the time it takes to play the game (PDG 1). A common problem in first time designs is a mismatch in this balance.When you design a game as a subject expert, the desire to include too much detail is strong.After all, everything is important, right?Not really. Whats actually important is having clear design goals and a willingness to sacrifice aspects of the reality that dont serve those design goals.We might call this a goal-driven mastery of your own processes of abstraction.Fig. 8 Regna Adsignata Map (Image by the author).Each player kingdom (Commagene, Edessa, Palmyra, Nisibis, Hatra and Adiabene) and the Roman and Parthian start areas are marked by a different colour.How players win a game is an important part of the historical argument of the game. This is not only because it makes a claim as to what success means in a historical context, but also because it incentivises players and guides how they play during the game.My game ends after 12 turns unless a certain external event happens first, then the player with the most prestige wins.In game terms, this is a fixed turn count, with the possibility of surprise early endings.Note that the players know when the game is likely to end (although they cannot be sure) but they have no agency in determining that end. This emphasises the limited agency of borderland states (HDG 2).Fig. 9 Original sketch design of the Regna Adsignata Map (Photo by the author).The player kingdoms in the initial design were marked by red circles.One final piece of abstraction is the map.Like Successors, my game uses a network map focused on cities to show the importance of urban spaces (HDG 1) (fig. 8).Because of the scale of time in the game, these links and the control markers that Rome and the players place on the map do not represent the concrete presence of military or political force (such as specific military units or administrators). Rather, they represent long-term influence and frequent, repeated mobility of people and groups. I chose the included cities and the player kingdoms based on their long-term importance to the region, but gameplay had a significant effect too (HDG 1, PDG 2).Part of the game flow is that when war breaks out between Rome and Parthia in the borderland, the players all have to choose sides.In order to present the borderland space as a space in which the historical actors had a certain degree of highly-constrained agency (HDG 2), I wanted players to have to make meaningful (PDG 4) and historically and geographically viable (HDG 1) choices about which side to support. That meant each player kingdom needed to have different considerations to the other player kingdoms, especially in terms of their proximity to the threatening empires on either side of the map (HDG 1).22ConclusionA common response to observing omissions or abstractions in a historical representation in contemporary media is to consider them to be deficiencies at best as the result of painful choices of what to sacrifice in service of making a game as playable as possible, at worst as a lack of up to date research. Because every historical text from Sallust to Syme to Successors is the result of processes of selection, omission and judgment, this is seldom a useful approach.More useful is to consider what arguments those processes of abstraction make about their historical subject and how they do so.As a historian and a teacher, one of the most useful and exciting parts of historical game analysis is how it offers parallels between historiographical analysis and the processes of ancient cultural production. Both game design and history-writing centre around processes of selection and omission of source material, and the inevitable abstraction of a complex reality to a digestible representation.Like a historical text, a game text cannot and should not include everything relevant to the period or events it covers.The goal of the scholar-designer, like that of the historian, is to select which aspects of the subject they want to focus on, understand their non-historical design goals, and to bring those two competing facets of their design together. Sometimes this involves hard choices that cause you to re-evaluate your assumptions, design goals, and priorities, but the consideration of these choices will make your game better, help you understand what your game is doing more clearly, and maybe even offer new ways of thinking about the ancient material itself.I hope, therefore, that for those of you that attempt it, this process might be a Rewarding Art of Abstraction."
}