{
  "articleId": "isaw_paper17",
  "text": "ARTICLE_ID: isaw_paper17\nThe Epoch Dates of the Antikythera Mechanism (With an Appendix on its Authenticity) Alexander Jones, Institute for the Study of the Ancient World, New York University Handle: http://hdl.handle.net/2333.1/ffbg7m07 Abstract: Attempts previous to 2014 to date the ancient Greek astronomical Antikythera Mechanism, on the basis of the letter forms of its inscriptions or on its Egyptian Calendar scale's alignment, were inconclusive. (Occasional claims that the Mechanism was not a product of antiquity at all are refuted in an appendix to this paper.) In 2014, two separate and complex arguments were published dating the series of computed lunar and solar eclipses inscribed on the Mechanism's Saros Dial to the interval 205-187 BCE, and in 2017 an argument was presented that the Corinthian Calendar lunisolar cycle and the Panhellenic Games cycle inscribed on the Metonic and Games Dials also had an epoch in 205 BCE, four months after the eclipse epoch. The present paper offers a more direct confirmation of the dating of the eclipse sequence, a reaffirmation of the calendrical epoch and explanation of it in the context of Hellenistic calendar regulation and synchronization, and a hypothetical reconstruction of the design decisions that determined the choice of the two 205 BCE epochs. These decisions could plausibly have been made by a designer as late as the c. 60 BCE archeologically determined date of the shipwreck from which the Mechanism was recovered. 1. Introduction. The Antikythera Mechanism, a gearwork chronological-astronomical simulator whose corroded metallic (chiefly bronze) fragments were recovered from a Hellenistic shipwreck site off the island of Antikythera in 1901, is an artifact of undisputed importance for the history of Greek mechanical technology, astronomy, and calendrics.1 Since it first came to notice in 1902 in the National Archaeological Museum (Athens), there have been many attempts to date it. (For occasional allegations that it was not a product of antiquity at all, see Appendix 2.) An obvious terminus ante quem is the date of the shipwreck; and while that cannot be determined exactly, ceramics, such as transport amphorae that constituted part of the cargo and tableware that likely were the effects of the crew or passengers, point to the middle of the first century BCE, while a small hoard of 36 silver cistophoric tetradrachms minted at Pergamon and Ephesos, the portable wealth of someone on board, includes Pergamene issues ranging from approximately 104-98 BCE through approximately 76-67 BCE, but none from after the resumption of minting of these coins in 58 BCE. Taken collectively, the evidence of the coins and ceramics suggest a probable shipwreck date of 60 ± 10 BCE, with a date more than 20 years before or after 60 rather unlikely.2 The fragments of the Mechanism bear remains of inscribed Greek texts, ranging from single letters and words on the scales of the output dials to extended explanatory texts, using letter forms similar in general character to Hellenistic lapidary inscriptions but smaller in size, with letter height ranging from about 1.2 to about 3 mm. Starting within days of the 1902 \"discovery\" of the fragments, experienced epigraphers (as well as a few less qualified people) have repeatedly offered date estimates for the letter forms, but this approach has proved inconclusive; there is growing consensus among Greek epigraphers that without knowledge of the place where an inscription was made and an extensive body of dated comparanda from that place (ideally with identified individual cutters), paleographical dating has an imprecision on the order of plus or minus a century.3 Here are three recent epigraphers' verdicts on the Mechanism's inscriptions: \"… the style of writing could date the inscriptions to the second half of the 2nd century BC and the beginning of the 1st century BC, with an uncertainty of about one generation (50 years). Dates around 150 BC to 100 BC are a plausible range.\" (Haralambos Kritzas)4 \"It seems better, accordingly, to widen the palaeographical dating range for the Antikythera inscriptions to the end of the third to the beginning of the first century BC, with a preference for the earlier half of this period.\" (Charles Crowther)5 \"… unless further securely dated examples of such tiny writing on bronze can be found, the most that can be said is that the writing dates from the end of the 3rd to the middle of the 1st century b.c.\" (Paul Iversen)6 In other words, so far as the letter forms go, the Mechanism could have been made any time from say 225 BCE to immediately before the shipwreck, a range that does not rule out any plausible date likely to be offered for the Mechanism on other grounds. Within this range, the intervals favored by individual epigraphers are liable to be influenced by the inscriptions that they use as comparanda or of which they have the most experience. Another approach is to seek datable evidence in the dials and inscribed texts—their contents now, not their paleography—or in the configuration of surviving mechanical parts in the fragments. Following earlier attempts of this kind that were received for a time as definitive but eventually proved misguided, two separate papers that appeared in 2014 deduced that one of the bodies of data inscribed on the Mechanism, a series of descriptions of possible eclipses, had been computed for dates in the interval 205 through 187 BCE.7 Each paper's argumentation follows a different methodical route, and both routes are complex and challenging to follow for a reader who is not well versed in ancient Greek and Babylonian astronomy and especially ancient eclipse theory. Moreover, the proposed date range is significantly earlier than the datings that had most commonly been suggested for the Mechanism (typically the second half of the second century or the first half of the first). Among the ways by which one might try to deal with this disparity are to consider whether the later datings could be mistaken, or to look for a rationale for inscribing on the Mechanism data pertaining to a period many decades, perhaps more than a century, in the past. But first one would like to be confident that the eclipses have indeed been correctly dated. In the present article, I first offer a more direct approach to the problem of dating the eclipse descriptions, taking advantage of certain key points in the interpretation of the evidence that are now settled so that one may assume them with passing reference to the earlier literature. Following this, I bring into consideration evidence, some derived from recent publications and some new, pertaining to other parts of the Mechanism's dials, texts, and the remains of its pointers. My conclusion is that the date range of the eclipse sequence was determined by a set of chronological, astronomical, and esthetic choices that combined to constrain a somewhat artificial epoch or \"zero\" setting of the Mechanism's pointers and gearwork. The constraints could account for the selection of an epoch date quite far in the past, despite certain significant drawbacks to having a long interval between epoch setting and the present when the Mechanism was being operated. 2. The dial plates and their inscriptions. The basic layout of the Antikythera Mechanism, comprising two bronze dial faces (conventionally designated \"front\" and \"back\") and, between them, a wooden casing that enclosed the complex system of gearwork driving the dial pointers, was discovered by Derek de Solla Price.8 In this preliminary section I review the evidence for the dial faces and what can be deduced from them and from the other inscriptions of the Mechanism concerning the various outputs, making minimal reference to the remains of the internal gearwork. As well as providing background to the following sections for readers who are not conversant with the consensus reconstruction of the Mechanism achieved since the early 2000s, this will reveal the robustness of this consensus: even if all the gears had vanished and we had just the exterior fragments, in principle we could have obtained an extensive knowledge of the Mechanism's functions and assumptions underlying them.9 Fig. 1 shows a reconstruction of the back dial plate of the Mechanism, which was approximately 31.5 cm tall and 17.0 cm wide, to the nearest half centimeter.10 About a quarter of the plate, almost entirely from its right half, survives in four fragments. Fragment B alone preserves part of the upper half, including about a third of the spiral scale of the large Metonic Dial, and the small Games Dial in its entirety. Of the lower half of the plate, about a third of the spiral scale of the Saros Dial in addition to some of the plate outside the scale (inscribed with the Back Plate Inscription, or BPI) are extant in Fragments A, E, and F, and the greater part of the small Exeligmos Dial is also in Fragments A, B, and E have physical joins, so that the relative placement of the upper and lower dial systems is known within a tolerance of less than a centimeter.11 Fig. 1. Reconstruction of the back dial plate of the Antikythera Mechanism, showing the parts extant in Fragments A, B, E, and Pointers are omitted. Numerals identify cells of the two spiral scales that are known or believed to have contained inscriptions. Fragments 24 and 25 preserve mirror-reversed offsets of small regions of the plate also extant in Fragment Before discussing details of the dial plate, it will be helpful to quote for reference the fragmentary lines of \"Part II\" of the Back Cover Inscription (BCI) that described the upper and lower dials:12 The Metonic Dial's spiral slot and scale make five complete turns winding clockwise from inside to outside, starting and ending at points directly below the pointer axis, and the surviving scale divisions, along radial lines through the pointer axis, confirm BCI II.3's statement that the entire scale was divided into 235 cells, corresponding to the 235 lunar months of a 19-year \"Metonic\" period.13 Each turn thus comprised exactly 47 cells. Every cell was inscribed with the name of a calendar month (of a calendar to be discussed below in section 5), and the cell corresponding to the first month of the calendar year also contained a year number, from 1 through 19, so that the scale described a complete 19-year calendrical cycle.14 The lines forming the cell divisions were continued slightly inside the interior of the spiral, and 22 of these partial cells (identified in Fig. 1 by numerals prefixed with \"e\") were inscribed with numbers that are \"skipped\" (ἐξαιρεσιμοί, cf. BCI II.4) day numbers within all months along the same radius—that is, while all months of the cycle were nominally 30 days long, by omitting the specified day, the 110 months along these radii became in actuality 29-day months, in conformity with the Metonic period relation as it applies to lunisolar calendars: The decision to make the Metonic Dial a five-turn spiral was thus not arbitrary, but intended to take advantage of the fact that not only the total number of months in a 19-year period but also the numbers of 30-day and 29-day months are all divisible by 5. The subsidiary Games Dial is a simple circular dial divided into four equal quadrants by engraved radii that are approximately 7–8° counterclockwise from the 12-o'clock, 3-o'clock, 6-o'clock, and 9-o'clock orientations. It is situated close to the inside of the Metonic spiral, at the Metonic Dial's 3-o'clock position, that is, its center is horizontally aligned with the pointer axis of the Metonic Dial. The interiors of the quadrants are inscribed with year numbers from 1 through 4, running counterclockwise starting with the lower right quadrant—this is the Mechanism's only dial for which the prevailing sense of the pointer's motion in forward-moving time is counterclockwise. Outside each quadrant are inscribed the names of two panhellenic athletic festivals, indicating that, for example, during year 1 of the four-year cycle the Isthmian and Olympic festivals were held. Following a longish passage (omitted above) concerning the mechanically complicated pointer of the Metonic Dial, BCI II.17-19 speaks of two pointers, and despite the gaps in the text, it is clear that these pointers belonged to a pair of dials similarly divided into four quadrants. One of this pair, described in the lost part of line 18,15 must have been the Games Dial, while the other's quadrants, we are told, counted 19-year periods within a 76-year \"Callippic\" period. This Callippic Dial was probably situated on the left side of the Metonic Dial's axis, and perhaps symmetrically situated with the Games Dial as shown in Fig. 1. Wright's straightforward reconstruction of the missing part of the gear train to this dial's pointer results in a clockwise sense of motion. We lack physical evidence not only for the precise location of this dial relative to the Metonic spiral, but also for the orientation of the scale divisions and just what was inscribed in the four quadrants. The slot and scale of the Saros Dial, the Metonic Dial's counterpart in the lower half of the dial face, make four complete turns clockwise from inside to outside. For this dial the starting and ending points are directly above the pointer's axis, and it is probable (allowing for some uncertainty in measurements on the extant fragments) that the endpoints of both the Metonic and Saros Dials' slots were one and the same, as shown in Fig. 1. The surviving radial scale divisions, similar to those of the Metonic scale, imply that the entire scale was divided into 223 cells, evidently the \"223 equal\" things mentioned in BCI II.20, and corresponding to the 223 lunar months making up a Saros eclipse cycle. Fig. 2. Detail of part of the back dial plate with the Saros and Exeligmos dials and Back Plate Inscription, with translated inscriptions based on the revised editions in Iversen & Jones 2019. Not every cell contained inscribed text. Running clockwise along the scale, four or five consecutive empty cells repeatedly alternate with one or two consecutive inscribed cells, with a distribution approximating the average number of lunar months separating the successive alignments (at intervals of about 5.87 lunar months) of the Sun's longitude with the Moon's nodal line, as shown in Fig. 2. A syzygy sufficiently near such an alignment, potentially bringing the Moon's latitude close enough to zero for an eclipse to be possible, may be called an \"eclipse possibility\" or EP for short. The inscriptions are highly abbreviated statements that an eclipse of the Moon, or of the Sun, or both may take place during the relevant month, accompanied by a time expressed as a whole number of hours, explicitly or implicitly of daytime or nighttime. All inscribed cells include index letters, forming two complete 24-letter alphabetic sequences plus one additional letter at the end, which keyed the cells to additional information pertaining to the eclipses in the Back Plate Inscription. On the basis of the 20 extant cell inscriptions (commonly referred to as \"glyphs\"), it can be inferred that 49 cells were inscribed on the entire scale, as indicated by the numbered cells in Fig. 1.16 These comprise 17 glyphs having both lunar and solar statements (meaning that a lunar EP at the middle of the month is followed by a solar EP at the end), 11 pairs of consecutive glyphs having respectively a solar and a lunar statement (meaning that a solar EP at the end of the first month is followed by a lunar EP at the middle of the second), and 10 glyphs having a lunar statement (a lunar EP at the middle of the month) unpaired with a solar statement. The total of lunar-solar pairs, solar-lunar pairs, and lunar-only, 38, is the number of times that the Sun crosses the nodal line during one Saros. Every such crossing is associated with precisely one lunar EP, whereas fewer than three-quarters of them are associated with a single solar EP, the remainder with none. The fact that solar EPs either fall in the cells preceding those containing lunar EPs or follow lunar EPs in the same cells implies that the lunar month was considered to begin slightly later than conjunction. Immediately inside the innermost turn of the Saros Dial slot, at the 3-o'clock orientation with respect to the pointer axis, is a short engraved radial line, presumed to be one of a set of four such marks at the 12-o'clock, 3-o'clock, 6-o'clock, and 9-o'clock orientations.17 These would have indicated the 16 dates during a complete Saros at which the Sun's longitude aligned with either the lunar apogee or the lunar perigee, at intervals of approximately 13.94 lunar months. (A syzygy near such an alignment brings the Moon's anomaly close to zero.) The divisibility of 16 by 4 motivates the choice of a four-turn spiral for the Saros Dial; BCI II.20 probably contains the word for \"four,\" which could refer either to the number of turns or the number of marks inside the spiral. The subsidiary Exeligmos Dial, like the Games Dial, is a simple circular dial, but this one is divided into three equal sectors by radial lines at the 1-o'clock, 5-o'clock, and 9-o'clock orientations. The dial is just inside the right side of the Saros spiral, practically tangent to the slot, but slightly above the Saros Dial's 3-o'clock position, probably to make room for the graduation mark discussed in the preceding paragraph. The surviving gear train would have caused the Exeligmos Dial's pointer to revolve once clockwise in three complete Saros periods as displayed on the Saros Dial, a period designated Exeligmos (ἐξελιγμός, literally \"revolution of a wheel\") in ancient Greek astronomical texts (Geminus, Introduction to the Phenomena chapter 18, and Ptolemy, Almagest Book 4, chapter 2). The sector clockwise of the 5-o'clock graduation is inscribed with the numeral 8 (Greek Η), and the one clockwise of the 9-o'clock graduation has the numeral 16 (ΙC). The remaining sector seems to be vacant.18 The meaning of these numbers arises from the motivation for tripling the Saros period to make the Exeligmos: an average Saros is approximately 6585 ⅓ days, i.e. 6585 days 8 equinoctial hours, so that syzygies (and thus eclipses) in the corresponding months of successive Saros periods lag by an average of 8 equinoctial hours per cycle. If one assumes that the Saros period is an exactly constant time interval, the Exeligmos Dial indicates the number of equinoctial hours to be added to the times indicated in the Saros Dial glyphs for Saros periods succeeding the \"base\" cycle inscribed on the dial. Hence each Exeligmos cycle begins when the pointer is towards the 1-o'clock position, and the (presumably) vacant sector represents the base cycle and cycles separated from it by multiples of three Saros periods, requiring zero adjustment of the times. Similar wording in BCI II.17 and 24 suggests that the latter belongs to a description of the Exeligmos Dial. The use of the singular \"tip\" (ἄκρον instead of ἄκρα) probably means that there was only this one subsidiary dial inside the Saros spiral, and for that matter a second dial circle of the same size as the Games and Exeligmos Dials, if it had existed, ought to have been partly preserved on the extant region of the plate around the Saros Dial's pointer axis.19 Putting together the various kinds of information represented in the Saros and Exeligmos Dial inscriptions, we can state the Saros period relation in a form directly relating to the dials, as follows: The front dial face (Fig. 3) was a single large circular dial inset in an approximately square plate having the same width, 17 cm, as the back face, but only about half its height (16.5 cm). Above and below it were two smaller, rectangular plates that were probably fixed to the Mechanism's wooden exterior frame, while the dial plate was held in place between them by means of sliding catches whose bolts could be slid in and out of bearings on the inside of the fixed plates.20 The knobs of these catches are represented by solid gray circles in Fig. 3. About a quarter of each of two concentric dial scales and the part of the plate outside them survives in Fragment The inner scale, fixed to the dial plate, was graduated into twelve divisions corresponding to the twelve zodiacal signs, with each sign subdivided into 30 degrees. The outer scale, lodged in a ring-shaped sink of the dial plate and held in place in any of 365 possible orientations relative to the Zodiac Scale through a system of drilled peg-holes behind the scale and (probably) four clips gripping the scale's rim (shown as gray arcs in Fig. 3), was graduated into twelve larger divisions and one smaller one corresponding to the twelve 30-day months and five additional \"epagomenal\" days of the Egyptian calendar year. The existence of the Egyptian Calendar scale, and the fact that its orientation could be adjusted manually, implies that there ought to have been a pointer revolving around the dial with a period representing one solar year. The scale ring would have been reset when needed to take account of the cumulative difference between solar years and Egyptian calendar years (which had a constant length of 365 days). The Zodiac Scale also implies such a pointer, because a double alphabetic series of index letters inscribed along the dial keyed specific degrees to the Parapegma Inscription, a list of annually repeating astronomical events such as solstices, equinoxes, and appearances and disappearances of constellations that was inscribed on the plates above and below the dial. The average spacing between degree graduations on the extant part of the Zodiac Scale (extending from the middle of Virgo through the middle of Sagittarius) is significantly less than 1° (as is apparent from the fact that the sector for Libra exposed on Fragment C spans just slightly over 29 day intervals on the Egyptian Calendar Scale instead of the expected 30 ⁵/₁₂ day intervals), and this is probably deliberate: a nonuniform division of the zodiac into larger degree intervals around the solar apogee and smaller intervals around the perigee would allow a single pointer to indicate simultaneously the Egyptian calendar date and the Sun's approximate true longitude, while also making it easy to see the inequality of the astronomical seasons without operating the Mechanism, by simply counting the day graduations corresponding to the quadrants of the zodiac.21 The extant fragment, however, has the surviving portion of the Egyptian Calendar Scale in an orientation relative to the Zodiac Scale that would not have been valid for any historical date within centuries of the first century BCE, so it had apparently last been installed more or less at random.22 What looks like an engraved ra dial line just outside the Egyptian Calendar Scale and approximately aligned with Libra 18° on the Zodiac Scale (treating the longer graduation separating the Virgo and Libra sectors as Libra 0°), has been interpreted as a mark indicating the correct orientation of the Egyptian Calendar Scale for an epoch date; since the apparent mark coincides with a repaired break through the fragment, however, not all researchers have accepted it as an intentional feature. We will return to this alleged \"fiducial mark\" in the following section. Fig. 3. Reconstruction of the front dial plate with pointers for the longitudes of the Sun, Moon, and five planets, showing the part extant in Fragment The central disk-shaped casing for the lunar phase display is also extant in a displaced position in the same fragment. The presumed fiducial mark is shown, close to the boundary between the Pachon (ΠΑΧΩΝ) and Payni (ΠΑΥΝΙ) sectors of the Egyptian Calendar Scale. At the center of the dial, a jar-lid-shaped casing, extant though in a displaced position in Fragment C, housed a differential gearing that caused a small particolored ball showing through a circular window to revolve to display the current lunar phase.23 For this to work, the casing had to revolve at the rate of the Moon's longitudinal motion, and it may thus be presumed that a pointer was attached to indicate the Moon's longitude on the Zodiac Scale. Additionally, BCI 18-25 preserves partial lines from a description of a set of pointers pertaining to the five planets and probably indicating their longitudes; we have no physical remains in Fragment C of these planetary pointers. 3. Rehm and Price on dating the Egyptian Calendar Scale. In Fragment C's state as first identified in 1902, the front dial scales were entirely concealed behind layers of material that were removed in 1905 and now constitute Fragment G and many small fragments. Fig. 4, a detail of a photograph of the fragment taken by Georg Karo late in 1905 for Albert Rehm, shows how a bit of the Egyptian Calendar Scale, but none of the Zodiac Scale, was now exposed behind one of the displaced plates bearing the Parapegma Inscription. (Subsequent breakage of this plate resulted in the fragment's present state, with more of the Egyptian Calendar Scale and part of the Zodiac Scale exposed.) Shortly before, Rehm had inspected Fragment C in person, observing the graduated scale and reading and identifying the inscribed Egyptian month name Pachon (ΠΑΧΩΝ).24 Fig. 4. Detail of the 1905 photograph of Fragment The nearly horizontal black line underlines the traces of the Egyptian month name ΠΑΧΩΝ (Pachon); all the letters except the first letter are easily legible in the photograph. The arrow points to where Price's \"fiducial mark\" ought to have been visible. Rehm interpreted the Mechanism as a kind of planetarium, with the Egyptian Calendar Dial functioning as a scale of longitude in place of a graduated zodiac (since he was unaware of the Zodiac Scale). Assuming—incorrectly—that the Egyptian Calendar Dial was fixed in position, he inferred that the version of the Egyptian calendar that it represented had to be the reformed calendar with leap-years every four years, which was instituted soon after Egypt became a Roman province in 30 BCE, and therefore that the Mechanism was made after 30 BCE.25 Although he never published his 1905-1906 research on the Mechanism, Rehm communicated this dating to Karo, who cited it in print as a basis for dating the Antikythera Wreck to after 30 BCE.26 Following his 1958 personal examination of the fragments (by which time Fragment C was essentially as we see it now), Price recognized that the Egyptian Calendar Scale was a separate metal ring that was adjustable in its position relative to the Zodiac Scale, so that it had to pertain to the unreformed form of the calendar with constant years of 365 days.27 That observation eliminated Rehm's argument, which Price almost certainly did not know about in any case. On the other hand, Price was the first to take note of the supposed \"fiducial mark\" outside the Egyptian Calendar Scale, and, exploiting this, he formulated a new rationale for dating the Mechanism's manufacture. It will be worthwhile to retrace in some detail Price's reasoning, which took different forms in his 1959 popular article in Scientific American and in his final 1974 treatment in Gears From the Greeks. In the Scientific American article, Price provides a drawing of Fragment C that, surprisingly, lacks the inscription ΠΑΧΩΝ on the Egyptian Calendar Scale, though the two exposed letters of the following month, ΠΑ[ΥΝΙ] are shown; moreover, this was not an accidental omission since, as we will see, Price did not think that the names of the months for the exposed parts of the scale were knowable.28 This is the odder, because Price identifies the scale as referring to Egyptian months, and it is hard to see how he could have made this deduction on the basis of just the graduations (which do not span the numbers of degrees on the Zodiac Scale that one would expect for calendar days because of the nonuniform graduation of the Zodiac Scale) and just the two letters ΠΑ, but clearly he somehow did so.29 In any event, when Price asserts that the two scales, as they stand in the fragment, \"are out of phase by 13½ degrees,\" he apparently means that the arc measured counterclockwise along the Zodiac Scale from the graduation on that scale corresponding (as Price knew) to the boundary between Libra and Scorpio and the graduation on the Egyptian Calendar Scale corresponding (as we know but Price d id not) to the boundary between the months Pachon and Payni was 13 ½ degree intervals.30 He continues, \"Standard tables show that this amount could only occur in the year 80 and (because we do not know the month) at all years just 120 years… before or after that date.\" This must mean that Price used modern astronomical tables to determine a year in which the Sun's longitude was at approximately Libra 16° 30' on the first day of some month of the unreformed Egyptian calendar. He must have found a satisfactory match for Libra 16° 30' on October 12, 80 BCE, which was the 1st of the Egyptian Phaophi (the second Egyptian month). Although, as he notes, a year 120 (solar) years earlier or later would have the Sun at the same longitude on the first of an Egyptian month (respectively Thoth, the first month, or Hathyr, the third month), he rejects these candidates on the grounds that 200 BCE is too early, and 40 CE too late, based on the archeology of the shipwreck. It is only at this stage of the argument that Price adduces his fiducial mark. Since \"the mark is exactly 1/2 degree away from the present position of the scale,\" by which he means that the graduation separating the two exposed month-intervals on the Egyptian Calendar Scale is half a degree counterclockwise of the mark, he infers that the scale ring had been turned by just this tiny amount since the manufacture of the Mechanism to correct for the difference between a solar year of 365 ¼ days and the Egyptian year of 365 days over two elapsed years.31 Thus the fiducial mark indicates the correct setting for 82 BCE, so that \"we are led to suggest that the instrument was made about 82 , used for two years… and then taken onto the ship within the next 30 years.\" (This last item was to accommodate Gladys Weinberg's information that the wreck date was estimated as 65 ± 15 BCE.)32 Three remarks can be made concerning Price's 1959 argument. First, it only works because Price treated the identities of the Egyptian months to which the exposed parts of the Egyptian Calendar Dial belonged as unknowns. Leaving aside the complete month name ΠΑΧΩΝ that he entirely failed to notice, the initial letters ΠΑ of the following month, which he did record, would, if recognized as a month name (hence either Pachon or Payni), have ruled out any date within the 200 BCE to 40 CE span that, he supposes, exceeds in both directions the archeologically acceptable interval. Second, the claimed precision of a single year for the scale alignment is spurious. Without knowledge of the solar theory underlying the Mechanism's Sun/date pointer and the time of day to which the alignment is supposed to apply, the intended date for any alignment would easily be subject to an uncertainty of a decade or more. Thirdly, Price assumes that the scale alignment indicated by a fiducial mark must apply to a date contemporary with the Mechanism's manufacture; he does not consider the possibility that, as was common with astronomical tables, an epoch date in the past might have been chosen. In the 1974 version, Price uses a slightly different datum to determine the date of last setting of the Mechanism, namely that, by his reckoning, in Fragment C as it stands Libra 0° is aligned with the 13-and-a halfth day of an Egyptian month. Instead of using modern tables, he now interpolates between autumnal equinox observations reported in Ptolemy's Almagest (Book 3 chapter 1) for 147 BCE (Hipparchus) and 139 CE (Ptolemy), finding that \"In 87 it was therefore at the 13th Thoth and two years later, in 85 it was at the 13½ Thoth.\"33 Again there is a misleading air of precision about these calculations, since not only does Price disregard the times of day or night reported for the Hipparchian and Ptolemaic equinoxes but he assumes that Ptolemy's equinox dates are a reliable guide to the equinox dates that would have been assumed by the makers of the Mechanism, even though the date and time given for the 139 CE equinox are notoriously more than a day too late. But the more serious problem for Price is that he now was aware of the ΠΑΧΩΝ inscription, whereas his computation had determined that, for a setting appropriate for 85 BCE, the month in that location of the scale ought to have been Thoth. His attempt to resolve this conflict is confused. Taking the alignment of Libra 0° and Thoth 13 in 87 BCE as a kind of given, he calculates that an alignment of Libra 0° with Pachon 13 would correspond to approximately 876 CE or 586 BCE, \"both of which are beyond the range of archaeological possibility.\" True enough. But what is this calculation supposed to mean in terms of the epoch and final setting of the Mechanism? In the end, he decides that the fiducial mark indicates that \"the instrument was engraved ca 87 or at some other date distant from that by a multiple of 120 years, 34 , 154 , etc.\"—though of course these later dates should have been out of the question. Or if we wish to push the date backward from 87, Price thinks that we have to go back not 120 years but 143 years to 230 BCE, to take into account that the five epagomenal days fall between Thoth and the preceding calendar month, Mesore.34 This would only make sense, however, if the idea was that the Egyptian Calendar Ring was supposed to be aligned at epoch with reference to the Libra 0° mark—in which case what was the point of having a separate fiducial mark? In fact the whole discussion of the dating is irredeemably muddled, giving the impression that Price wanted simultaneously to hold on to the idea that his fiducial mark indicated an epoch setting for the Egyptian Calendar Dial, to the idea that this epoch was only a few years before the shipwreck date, and to the idea that the shipwreck date was represented by the present alignment of the Egyptian Calendar Ring, in the face of the contrary evidence from the inscribed month names. A symptom of Price's muddle is that he never clearly sets out how the fiducial mark was supposed to be used. The principle, one would think, would be that, for some chosen \"zero\" setting, this mark should line up with the beginning of the Egyptian calendar year, that is, with the graduation on the Egyptian Calendar Scale separating the sectors for the epagomenal days and for Thoth. Never mind how the calendar ring is aligned in the existing Fragment C, which is probably just a random configuration thoughtlessly created by whoever packed the Mechanism up for its fateful voyage. The alignment that matters is the fixed one noted above in section 2 between the mark and, approximately, Libra 18° on the Zodiac Scale. In what years was the Sun within, say, 2° of Libra 18° at, say, noon (for the meridian of Rhodes) on Thoth 1? Using modern theory for the solar longitudes, this criterion is satisfied from 217 through 202 BCE. If Price's mark was what he thought it was, the epoch date ought to have been within this span, or not much outside it—well over a century before the shipwreck.35 But is the mark what Price thought it was? In Gears From the Greeks, he describes it as \"a short but clear incised line—I feel sure it is no accidental crack.\"36 He adds this assurance because there is a break in the fragment running along the supposed line, and continuing right through the two scales. Allan Bromley commented in 1990:37 Price's fudicial [sic] mark near the outer dial ring is certainly now a crack. I have not been able to persuade myself that it was originally a deliberate engraving mark from which a crack subsequently developed. Looking at the fragment in its display case in the National Archaeological Museum, one can certainly convince oneself that there is an intentional mark, straight and radial in orientation, and extending from the edge of the Egyptian Calendar Scale outward about halfway to the edge of the plate. Photographs also reinforce this impression, while the tomography is less clear except insofar as it shows that the fracture follows a less rectilinear outline below the surface. Karo's 1905 photograph, however, reveals no trace of either the break (which may have happened at the same time as the partial shattering of the plates bearing the Parapegma Inscription) or the mark. An engraved line could have been concealed by patina, but the graduations and the ΠΑΧΩΝ inscription on the Egyptian Calendar Scale are clear enough in the photograph (the letters are indeed much clearer there than they are now), and one might reasonably expect that the same cleaning that made the scale legible would have done the same for anything engraved on the plate just outside its rim. In short, the genuineness of the fiducial mark is far from a certainty, but if it is real, it points to an epoch date in the late third century BCE, not the early first. 4. Dating the eclipse sequence. We now turn to the recent proposals to date the eclipse sequence inscribed on the Saros Dial, which depend on flaws built into the way that the Mechanism's eclipse predictions were supposed to work. If the relations (2) and (3) defining the Saros were highly accurate representations of nature, a sequence of EPs computed for a particular interval of 223 months and described on the Saros Dial's scale and in the supplementary information of the BPI—including properties of any actual eclipses that are not affected by parallax—would be equally valid for preceding and subsequent intervals of 223 months, except that all the times of syzygies in some of these intervals would have to be shifted later by 8 or 16 equinoctial hours, as indicated on the Exeligmos Dial. The Mechanism's eclipse prediction display by its very structure presumes that the Saros period relation is exact, a belief incidentally shared by Geminus (Introduction to the Phenomena chapter 18, speaking of the Exeligmos) and by the \"still earlier mathematicians\" to whom Ptolemy alludes in Almagest Book 4 chapter 2. In reality, however, the Saros period relation has inaccuracies in every element, some of them pronounced: (4) 223 synodic months ≈ 238.992 anomalistic months ≈ 241.999 dracontic months ≈ 18.03 years ≈ 6585.322 days The inaccuracies result in slow long-term changes in the distribution of EPs in repeating Saros cycles, and more rapid changes in the syzygy times. This raises the prospect that we may be able to determine a specific interval of 223 months for which the data inscribed on the Mechanism were computed, if the computations were based on a reasonably good theory and if enough data survive. The 2014 papers by Christián Carman and James Evans and by Tony Freeth separately arrived at such a dating, concluding that the opposition in the first month (i.e. the first syzygy) of the cycle was that of May 12, 205 BCE, and hence that the base Saros cycle was bounded by the conjunctions of April 28, 205 BCE and May 9, 187 BCE. We will now see that this dating can be obtained by a comparatively simple argument. The astronomical information contained in the Saros Dial scale inscriptions can be reduced to four knowns: (i) We know, probably within a degree or two, the assumed elongation of the mean Moon (or equivalently, the mean Sun) from the Moon's ascending node at each mean syzygy of the cycle that is implied by the distribution of EPs. The essential elements in this deduction are the following: The lunar EPs were the complete set of 38 oppositions in the Saros for which the mean Moon at mean opposition was calculated as closer to a node than at the preceding and following oppositions.38 Equivalently, one can generate the sequence as the set of mean oppositions for which the lunar latitude, neglecting lunar anomaly, falls within a range of values centered on the ecliptic and just broad enough so that one and only one EP occurs near the date when the Sun passes one of the nodes. The cycle can be shown to have comprised five groups of seven or eight lunar EPs at six-month intervals, with a five-month interval separating each group from the next, following an 8-7-8-7-8 pattern, starting with cell 37.39 (The numbered cells in Fig. 1 illustrates this alignment.) To obtain this pattern, the assumed elongation of the mean Moon from the nearest node at the mean opposition of the cycle's first month should have been approximately –37.3° ± 0.3°.40 The solar EPs were a set of 28 conjunctions, each of which was one of the two consecutive conjunctions immediately preceding and following a lunar EP.41 The fact that several lunar EPs were not neighbored by solar EPs is a consequence of a modelling assumption that a conjunction is a solar EP if and only if the lunar latitude at mean conjunction, neglecting lunar anomaly, falls within a range of values that is narrower than the latitudinal range for lunar EPs, with the positive limiting value further from the ecliptic than the negative limiting value. This asymmetry was clearly intended to take account of the influence of parallax on the Moon's apparent latitude for an observer in the Mediterranean region.42 The pattern of solar EPs implies that the mean Moon was assumed to be at an elongation of approximately –39.6° ± 0.2° from the ascending node at the mean opposition of month 1. The disjunction of about 2° between this result and the result obtained from the lunar EP pattern probably tells us that the two sets of EPs were derived from distinct eclipse theories that may have had slightly different alignments for the lunar nodes. For our analysis, we assume that the nodal elongation for the mean opposition of month 1 was –38° ± 5°, surely an overgenerous tolerance. (ii) We know that the Moon was assumed to be at its apogee at the opposition of month 1, from the following considerations: The times recorded for the EPs on the Saros Dial scale have to be understood as times of true syzygy expressed in \"idealized\" hours of day or night, that is, equinoctial hours counted from 6 AM for day and 6 PM for night. This is the only meaning that they could have that is consistent with the assumption built into the Mechanism that the times are applicable to all solar and lunar EPs in repeating Saros cycles subject to shifts of 8 or 16 equinoctial hours.43 A periodic component dependent on the Moon's elongation from its apogee can be isolated in the differences between the recorded true syzygy times and computed times of mean syzygy. This sinusoidal component turns out to be aligned such that the opposition of month 1—the first syzygy of the Saros cycle—has the Moon approximately at apogee.44 As noted above in section 2, the inside of the Saros Dial scale was engraved with an extant graduation at the 3-o'clock position, and by inference also with graduations at the 12-o-clock, 6-o'clock, and 9-o'clock positions, indicating alignments where the Moon would be at its apogee at opposition.45 These marks reflect the roughly 14-month beat cycle of the anomalistic month relative to the synodic month. This shows that the anomalistic alignment deducible from the recorded EP times was intentional and built into their method of computation. (An intentional anomalistic alignment for the first month of the Saros also explains the otherwise puzzling decision to begin the cycle with a month not containing an EP.)46 Since the Moon's apsidal line was more difficult to determine precisely in antiquity than than the nodal line, we should grant a larger tolerance for this datum; allowance for a misalignment of as much as a day's worth of lunar motion, say ±15°, should be more than sufficient. (iii) A component dependent on solar anomaly can also be isolated from the differences between recorded true and computed mean syzygy times, though its alignment is less precisely determined.47 One of the previous studies estimated that the Sun's implied elongation from apogee at the opposition of month 1 was between –30° and 0°.48 There is no evidence on the Mechanism comparable to the graduation marks of the Saros Dial to suggest that the solar anomaly was assumed to be aligned in a special way. (iv) Aside from the periodic components discussed above, the recorded times also yield information about the alignment of the mean Moon relative to the mean Sun; in effect, for the correct date the errors in the recorded times compared to times of true syzygy computed by modern theory should tend to be small and average about zero. The strategy we will follow is to select all oppositions within a chosen chronological search range that are within our adopted tolerances of the expected values for criteria (i) and (ii), and then to inspect the fit of the recorded hours to syzygy times computed by modern theory as a test of criteria (iii) and (iv). As a search range, we initially take the two centuries from 250 BCE to 50 BCE. The latter end of this interval is set by the estimated date of the Antikythera shipwreck, 60 ± 10 BCE as stated above, section 1. The earlier end is admittedly arbitrary. Candidate datings become increasingly implausible the further back one goes from the period within which the manufacture of the Mechanism is imaginable, because, while for some purposes one may have wanted an epoch date in the moderately remote past, an interval equivalent to thousands of revolutions of the input knob would have been impractical—in this respect, a mechanism is more limited than a set of astronomical tables. (On the other hand, we should not be overconservative, since a device supplied with dials representing cycles as long as 76 and 54 years—roughly equivalent to 350 and 250 turns of the input knob—was evidently meant to display dates spanning intervals at least that long.) Two centuries of data suffice to show the pattern of data points that arises over time with respect to the Moon's elongations from the apogee and from the ascending node, and we are free to extrapolate the date range further if the pattern suggests that there may be candidate dates beyond the provisional limits. For every opposition in the search range, I have used the theory of Ptolemy's Almagest to compute the elongation of the mean Moon from its apogee and its elongation from the point 38° before the ascending node.49 (The Almagest lunar and solar mean motions are easily accurate enough for this kind of investigation, and very convenient for making such calculations.) The resulting anomaly-latitude elongation pairs, plotted in Fig. 5, are not scattered evenly but form a lattice of little slanting rows of tightly spaced data points, reflecting the fact that the Saros period brings about an approximate but not an exact return of the Moon to the same situations in anomaly and latitude. Each row of points represents the same lunation number within all the Saros cycles of the search range, with the earliest cycle at the right end of the row and the latest cycle at the left end. The leftward shift represents the error of the Saros period relation with respect to anomalistic months, and the smaller downward shift represents its error with respect to dracontic months. Fig. 5. Elongation of the mean Moon from the point 38° east of the ascending node plotted against elongation of the mean Moon from the lunar apogee (based on Almagest mean motions) for mean oppositions between 250 and 50 BCE. We are looking for oppositions such that the two elongations had small values, so in Fig. 6 we show just the part of the graph close to the origin, with a box enclosing the region determined by the tolerances adopted above. This shows that we can disregard all but the two rows that are closest to the horizontal axis representing zero latitudinal error. Fig. 6. Same graph as Fig. 3, detail of region around the origin. Only the leftmost, i.e. latest, data point of the row to the right of the origin falls within the box; this is the opposition of December 20, 68 BCE. At that time of year, the Sun was fairly close to its perigee, far from the anomalistic alignment implied by the solar component isolated from the recorded syzygy times. If we take the differences between the recorded times and times of true syzygies computed by modern theory50—always assuming that the date, which was not recorded in the inscriptions, was such that the time error was less than 12 equinoctial hours—the results are practically random (Fig. 7); the standard deviation of the differences is approximately 6.18 hours.51 Fig. 7. Error of time of syzygy recorded on the Saros Dial relative to syzygy times computed by modern theory for a Saros cycle beginning in 68 BCE. The next cycle, beginning with the opposition of January 1, 49 BCE (just outside the search range), offers an even worse fit for the syzygy times, with standard deviation 7.85 hours. It is scarcely conceivable that the shipwreck took place late enough in the first century BCE to make inspection of subsequent Saros cycles in this series worthwhile. The row of data points to the left of the origin has five data points within the tolerance box. To cut to the chase: the middle point, corresponding to the opposition of May 12, 205 BCE, turns out to be the one we want. The Almagest theory value for the elongation of the mean Moon from apogee at mean syzygy is –7° 8', that for the mean Moon's elongation from the ascending node –40° 3', and that for the mean Sun's elongation from its apogee –18° 25'. The syzygy time errors (Fig. 8) are, with one exception, all within a range barely exceeding ±6 hours, with standard deviation 3.54 hours and mean time difference 0.79 hours. Previously, four of the recorded times (corresponding to the four data points with greatest positive errors in Fig. 8) had been identified as probably affected by errors of ancient computation or copying;52 if these and one additional one with a negative error of comparable magnitude are excluded, the standard deviation drops to 1.85 hours, with mean time difference –0.16 hours. This is definitely good enough agreement if we allow for imprecisions in the ancient theory and calculations. For the other four cycles within the tolerance box, the times are all wrong, as we would expect because of the roughly 8 hour systematic shift of syzygy times from one Saros cycle to the next.53 Fig. 8. Error of time of syzygy recorded on the Saros Dial relative to syzygy times computed by modern theory for a Saros cycle beginning in 205 BCE. Fig. 6 suggests that we might also look at the cycle of this series that began three Saros cycles—one Exeligmos—earlier, with the opposition of April 10, 259 BCE, again just outside our search range. With respect to criteria (i) and (ii), this opposition is superior to the May 12, 205 BCE opposition, having the mean Moon at elongation 1° 30' from apogee at mean opposition according to the Almagest theory, and at elongation –38° 40' from the ascending node. With respect to the Sun's anomaly, however, it is less satisfactory, with the mean Sun at elongation –50° 36' from its apogee according to the Almagest theory. The syzygy time errors for the cycle beginning in 259 BCE (Fig. 9) are on average about as good as they are for the cycle beginning in 205 BCE, with standard deviation 3.56 hours and mean difference –0.14 hours; but many more data points have large errors, say exceeding ±3 hours of modern theory. The 259 BCE dating is thus inferior in fit to the 205 BCE dating, besides being even more uncomfortably early relative to the archeological context in which the Mechanism was found. From now on we will restrict consideration to the 205 BCE dating. Fig. 9. Error of time of syzygy recorded on the Saros Dial relative to syzygy times computed by modern theory for a Saros cycle beginning in 259 BCE. Before we turn from the Mechanism's eclipse sequence epoch to the epochs of the calendrical displays, it will be worth our while to consider how effective a predictor of eclipses the Mechanism would have been if its predictions were compared with accurate observations. To start with, let us imagine an idealized version of the Saros Dial on which are recorded astronomically accurate times of true syzygies for 205 through 187 BCE to a precision of a minute instead of an hour. Thus in Table 1, we give in the leftmost columns the computed UT modern-theory dates times of opposition for all 38 lunar EPs from this interval, and in subsequent columns we give the times for the corresponding lunar EPs in the subsequent three Saros periods accompanied by the errors (prediction minus true) of the opposition times that would have been predicted by applying the time correction from the Exeligmos Dial to the times in the second column.54 With each progressive Saros, the mean error increases by about a quarter-hour (respectively +0.24, +0.49, and +0.73 hours), while the standard deviation increases by about two-thirds of an hour (respectively 0.67, 1.35, and 2.02). After one exeligmos, errors of more than four hours are frequent. The worsening unreliability of the predicted times is, of course, a consequence of the inaccuracies of the Saros relation we pointed out at the beginning of this section. But the Mechanism's eclipse prediction function is not really a case of good predictions of times of mid eclipse for the epoch Saros cycle, decent ones for the neighboring ones, and progressively poor ones for more remote cycles. The time predictions for the epoch cycle, as we have seen, were themselves quite poorly computed, with standard deviation approaching two hours and several individual errors approaching three hours, even when the handful of grossly discrepant times are excluded. The inaccuracy would have been compounded by additional errors of comparable magnitude if the times, expressed as they are as hours of day or night though actually equinoctial hours counted from 6 hours before and after noon, were confronted with observed times in genuine seasonal hours counted from sunrise and sunset. The situation was even worse with respect to predicted times for solar eclipses, since parallax can cause the observable time of mid eclipse to differ from the time of true conjunction by as much as two hours. Moreover, the descriptions of solar eclipses in the Back Plate Inscription, which are supposed to apply to groups of all solar EPs in the Saros period that have approximately the same lunar latitude, provide us with a broader range of predicted characteristics of eclipses that would inevitably have compared badly with observations, including statements of disk color, magnitude, and (likely) changing wind directions.55 It seems clear, therefore, that the Mechanism's eclipse predictions were not devised in a context of operation in which its predictions were likely to be tested or verified against observations.56 5. The Egyptian Calendar and Corinthian Calendar epochs. Two calendars of quite diverse kinds were represented in the Mechanism's displays. In section 3 we have already discussed the Egyptian Calendar Scale ring and its shifting alignment relative to the Zodiac Scale and the dial plate, and shown that Price's \"fiducial mark,\" if it is indeed an intentionally engraved mark indicating the epoch alignment of the graduation corresponding to Thoth 1 on the Egyptian Calendar Scale, implies an epoch date during the last two decades of the third century BCE. The consistency of this result with the preferred 205 BCE dating of the base Saros cycle's beginning provides some degree of support for both the reality of the fiducial mark and the validity of the 205 BCE Saros epoch. In 205 BCE, Thoth 1 corresponded to October 13. According to the alignment of the fiducial mark with the Zodiac Scale, the Sun's longitude on October 13 ought to have been approximately Libra 18°. According to modern theory as well as according to Ptolemy's solar theory, the Sun was close to Libra 17° at noon on October 13. A discrepancy of a degree, amounting to assuming a date for the autumnal equinox about a day too early, would be entirely acceptable. The other calendar of the Mechanism is the lunisolar one inscribed on the Metonic Dial's scale. The twelve months of this calendar, in their order in the calendar year, are given in Table 2. Table 2. The months inscribed on the Metonic Dial scale. Month number Name Transliteration I Φοινικαῖος Phoinikaios II Κρανεῖος Kraneios III Λανοτρόπιος Lanotropios IV Μαχανεύς Machaneus V Δωδεκατεύς Dodekateus VI Εὔκλειος Eukleios VII Ἀρτεμίσιος Artemisios VIII Ψυδρεύς Psydreus IX Γαμείλιος Gameilios X Ἀγριάνιος Agrianios XI Πάναμος Panamos XII Ἀπελλαῖος Apellaios In the following, we will refer to these months by their ordinal number, as a Roman numeral. Since the dial is a representation of a 19-year, 235-month calendrical cycle, we know that the complete sequence of cells comprised twelve 12-month years and seven 13-month years. The preserved sequences of identifiable months are given in Table 3. Thus there were two intercalary months between Year 1 III and Year 3 V, one more between Year 4 XI and Year 7 IV, one more between Year 8 X and Year 11 III, an attested intercalary month (IV) in Year 11, one more between Year 12 VI and Year 15 I, and the last one between Year 16 III and Year 19 III. If we assume that two intercalary months never occurred in the same year or in consecutive years, the intercalary years must have been Years 1, 3, 5 or 6, 8 or 9, 11, 13 or 14, and one of 16–18. Table 3. Preserved sequences of months on the Metonic Dial scale. cells year months 1–3 1 I–III 31–38 3 V–XII 39-49 4 I–XI 79–87 7 IV–XII 88–97 8 I–X 127–137 11 III–IV, IV2, V–XII 138–143 12 I–VI 175–186 15 I–XII 187-189 16 I–III 226–227 19 III–IV 235 19 XII Let us call a 19-year cycle that distributes the intercalary years as evenly as possible (or equivalently, one such that the beginning of month I is always within a lunar month of some fixed date according to the solar year) a \"well-distributed\" cycle. A well-distributed cycle will always be a cyclic permutation of a cycle such that Years 1, 3, 6, 9, 11, 14, and 17 are intercalary, or, using the notation I for intercalary years and O for ordinary years, I O I O O I O O I O I O O I O O I O In this particular norm for counting the the years of the cycle, Year 1 is the year that starts earliest relative to the solar year. We will call this the \"standard norm\" for a well-distributed cycle, and our numbering of years in a cycle will assume the standard norm.57 On the highly probable assumption that the cycle of the Metonic Dial was well-distributed, it has to have been in the standard norm.58 Only a single intercalary month, a repeated IV in Year 11, appears in the surviving inscriptions. The intercalary months in Years 1 and 3, if they were repetitions of the same month, would have had to be either III or IV, so that it appears probable that IV was the regularly intercalated month throughout the cycle. The preserved sequences rule out a pattern such that the intercalations were spread out intervals of 33 or 34 months to maximize uniformity. The specific lunisolar calendar represented by the month names and their sequence has been identified as a version of the calendar of Corinth, a member of the broad Dorian family of Greek calendars that is otherwise chiefly attested in inscriptional sources from Corinthian colonies and localities under the cultural influence of these colonies in the region of Epirus in northwest Greece.59 Iversen has offered compelling arguments that the beginning of the Corinthian calendar year was in mid to late summer.60 More specifically, he offers two possible approximate syncronizations with the Athenian calendar (whose year began with the month beginning immediately after the summer solstice), namely that Corinthian month I was most often coincident either with Athenian month II (Metageitnion) or with Athenian month III (Boedromion).61 Turning to the Games Dial, Table 4 gives the athletic festivals inscribed for the four numbered years of the cycle. Table 4. Athletic festival cycle on the Games Dial. year festivals 1 Isthmians (Isthmia), Olympics (Olympia) 2 Nemeans (Nemea), Naa (Dodona) 3 Isthmians, Pythians (Delphi) 4 Nemeans, Halieia (Rhodes) Although this list includes all the four prestigious festivals of the periodos and has the most prestigious of all, the Olympics, in Year 1, the cycle is not the standard 4-year Olympiad cycle, for which see Table 5. Table 5. The Olympiad cycle. year festivals 1 Olympics 2 Nemeans, Isthmians 3 Pythians 4 Nemeans, Isthmians The reason for the difference must be that the years of the Olympiad cycle were coincident with Athenian calendar years, beginning with the first month following summer solstice, whereas the years of the Games Dial began at a different time of year. Since the Isthmians were held before the solstice and the other festivals after the solstice, the Olympiad year separated the Isthmians from the other festivals that took place later in the same season, namely the Olympics and Pythians, whereas the Games Dial year did not split the festival season. The last part of Games Dial Year 1, possibly just a month or two, overlaps the first part of Olympiad Year 1, and similarly for the other numbered years of the two cycles. The obvious hypothesis is that the years of the Games Dial are meant to be understood as calendar years of the Corinthian Calendar, though the correspondence between years as displayed on the Metonic and years as displayed on the Games Dial would have been only approximate. Corinthian Calendar years, like all lunisolar calendar years, are variable in length and never equal to a solar year, whereas equal quadrants swept over by a uniformly moving pointer would effectively represent solar years, beginning and ending on fixed dates according to the solar year, not according to a lunisolar calendar year. Hence the Games Dial pointer would not normally cross from one quadrant to the next at exactly the same time as the Metonic Dial's pointer crosses from one calendar year to the next, though the margin of discrepancy would always be within one lunar month. The roughly 7–8° counterclockwise twist of the quadrant divisions from horizontal and vertical is likely to have its explanation in the conflict between the two kinds of year. The angle closely corresponds to one lunar month's motion of the pointer, so that if one imagines a second set of quadrant divisions in the precise horizontal and vertical orientations, the small segments between each pair of nearby divisions could bound the interval within which the actual calendar year always began. If, however, the inscribed festivals all were held in the last part of the calendar year, there would only be call for inscribing the divisions representing the latest possible pointer position for the change of calendar year to prevent the pointer from ever indicating festivals belonging to the wrong year.62 If this is correct, the pointer should have been oriented exactly vertically or horizontally at the beginning of the 19-year calendar cycle since the calendar cycle was in the standard norm. Thus at the beginning of Year 1 of each 19-year calendar cycle, the Metonic Dial pointer was oriented straight down, and at the beginning of Year 1 of each 4-year athletic festival cycle, the Games Dial pointer was oriented either straight down or within a few degrees of straight down. Iversen has proposed that the configuration in which both pointers were simultaneously oriented straight down corresponded to a deliberately chosen epoch for the dials of the Mechanism's upper back face.63 Moreover, since this configuration would recur every 4×19 = 76 years, the lost Callippic Dial could also have been inscribed so that its pointer would be oriented downwards, marking the beginning of the first 19-year period of the full 76-year cycle, whenever the other two pointers were in their epoch orientation. As a step toward determining what year was chosen for this epoch, Iversen hypothesizes that the quadrant dividers of the Games Dial did not represent an abstract latest possible position for the beginning of the Corinthian Calendar year relative to the solar year, but specifically the annual occurrence of an observable astronomical phenomenon that was required to fall within the last month of the calendar year. An epoch year would then have been a Corinthian Calendar year whose end overlapped with an Olympiad Year 1 and whose first month had the earliest possible position relative to the critical astronomical phenomenon. This hypothetical calendrical epoch could not have been identical to the epoch of the eclipse cycle, since the lunar month containing the May 12, 205 BCE opposition was in the spring, whereas the Corinthian calendar year began after the summer solstice. Iversen offers as the most plausible candidates for an astronomical phenomenon that was always kept within the calendar year's last month the heliacal rising of Arcturus and the autumnal equinox. He further proposes that the calendar epoch year was the one that began in 205 BCE, immediately following the May 12, 205 BCE eclipse epoch. The conjunction marking this epoch year-beginning would have been that of August 23, 205 BCE. (Whether the actual epoch coincided with this date or fell one or two days later would depend on how the mean beginning of the lunar month was defined in relation to the conjunction or the following first visibility of the Moon.) The Corinthian calendar year 205/204 BCE would have been a year 1 according to the scheme of the Games Dial, since 204/203 BCE was Year 1 of the 144th Olympiad. Two further considerations confirm that the calendar epoch was indeed the fourth month counting from the lunar month containing the eclipse epoch. Firstly, we consider the appearance of the entire back face when the Mechanism would have been set to the calendrical epoch. Because the Exeligmos Dial is divided into its three time-correction sectors such that the beginning of its cycle is at the 1-o'clock orientation, its pointer and the pointer of the Saros Dial would have been nearly parallel at the calendrical epoch. Given that the orientation chosen for the Exeligmos Dial's sector divisors is so nonintuitive and otherwise unexplained, it seems clear that an intentional element in the design of the back face was that both the upper dial pointers taken as a group and the lower dial pointers taken as a group should be in parallel orientations, and that the Exeligmos Dial's division was normed so as to have this effect.64 Secondly, Christián Carman has shown that the location of the Metonic Dial pointer along the spiral slot, preserved in Fragment B, and the orientation of the Exeligmos Dial pointer, preserved in Fragment A, correspond with a high degree of probability to a date approximately 143 lunar months later than a date for which the back dial pointers all had the parallel configuration described above.65 In other words, when the Mechanism was lost in the shipwreck, its gearwork was set to a date less than 12 years after an epoch setting as hypothesized by Iversen. Such a brief interval is unlikely to be an accident; rather, it argues strongly that the Mechanism had recently been set or reset to this epoch configuration. As we have seen, Iversen hypothesizes that the Corinthian calendar year was defined by a principle that either the autumnal equinox or (he thinks less likely) the morning rising of Arcturus was always within the first month of the year. Table 6 lists the relevant astronomical events in 205 BCE, allowing us to see how well either norm would work.66 Table 6. Astronomical events in 205 BCE. Event 205 BCE conjunction of eclipse epoch April 28 new Moon crescent of eclipse epoch April 28 full Moon following eclipse epoch May 12 summer solstice June 26 conjunction June 25 new Moon crescent June 26 conjunction August 23 new Moon crescent August 25 Arcturus morning rising (Mechanism) Sept 16 Arcturus morning rising (actual) Sept 21 conjunction Sept 22 new Moon crescent Sept 24 autumnal equinox Sept 26 Suppose first that the autumnal equinox was always supposed to fall within the first month of the Corinthian year. In that case, the equinox is quite early in the month in 205 BCE; but this makes a problem since the calendrical epoch year should be one in which the first calendar month is in its earliest possible position, so the equinox should be close to the end of the month. If, on the other hand, we suppose that the rising of Arcturus was supposed to fall within the first month, this could work for 205 BCE, if we use Arcturus's rising as estimated by modern theory. However, there is an indication inscribed on the Zodiac Scale at a location corresponding to a date approximately 10 days before the autumnal equinox that probably refers to the rising of Arcturus, and if we use this date, it is no longer close enough to the end of the lunar month in 205 BCE for the month to be in its earliest possible position. The near coincidence of the summer solstice and the conjunction and new Moon crescent in 205 BCE suggests another, perhaps more satisfactory hypothesis for how the Corinthian year could have been defined, namely not as beginning with the month within which some astronomical event fell, but as beginning with the third month following the summer solstice. This definition, taken together with the assumption that intercalation was consistently performed by a repetition of calendar month IV, would in principle have fully synchronized the Corinthian calendar to the Athenian calendar, whose year began with the first month after the solstice. As we will see, synchronization of this kind is well attested among Hellenistic lunisolar calendars. 6. Athenian calendar regulation and synchronization of calendars. Our evidence for ancient Greek calendars, including such fundamental matters as the names and order of the months and the season when the calendar year began for any particular calendar, and the procedures for deciding when a month or a year began and how long it should be, derives largely from inscriptions preserving actual dates, and in many instances is very incomplete. The calendar of Athens, being exceptionally well documented, has played a normative role among Greek calendars in both ancient chronography and modern scholarship, and its operation and regulation have been investigated—and disputed—more extensively than any of the others. It will be helpful here to summarize certain aspects, primarily concerning the evidence for intercalation practices, as they are currently understood. The Athenian calendar year began in early summer—we will refine this presently, but for now we just assume the undisputed principle that the year normally began in June or July (Julian). The twelve months and their sequence are given in Table 7. The normal month to be repeated in intercalary years was VI.67 An idealized form of the Athenian calendar created for astronomical applications is the Callippic calendar, which is attested in Ptolemy's Almagest and in a few Demotic and Greek astronomical papyri.68 The distinguishing feature of dates expressed in the Callippic calendar is that the calendar years were numbered serially within serially numbered 76-year \"periods\" (περίοδοι), such that Period 1 Year 1 was 330/329 BCE. As is obvious from this structure, the pattern of intercalary years in the Callippic calendar followed a 19-year cycle. From attested dates in Periods 1 and 6 associated with absolutely datable astronomical observations or predictions, it can be deduced that each 76-year period comprised four well-distributed 19-year cycles following the standard norm, such that the beginning of the first month of each cycle was almost immediately after the summer solstice, a rule set out by Plato, Laws 767C, for the calendar of an ideal state, and generally assumed to have applied to the calendar of Athens, though apparently nowhere explicitly prescribed for it in sources available to us. The fact that the Callippic periods are of 76 rather than just 19 years tells us that the calendar also regulated the distribution of 30-day and 29-day months, perhaps according to an arithmetical scheme such as that of the Mechanism's Metonic Dial or a similar scheme described by Geminus, Introduction to the Phenomena chapter 8. The beginning of the month was, on average, closer to the conjunction than to the date of first visibility of the new Moon crescent. Our knowledge of the intercalations of the actual calendar of Athens is chiefly dependent on inscriptions from which the character of specific years as intercalary or ordinary can be deduced. Athenian years were not numbered, but were identified by the name of the magistrate called the \"archon eponymous\" and by the secretary of the boule who held office during the year. In isolation, an archon name yields no information about the Julian equivalent of an Athenian year, but since the selection of secretaries normally cycled through the Attic tribes, an otherwise roughly dated year that is designated by a secretary or by an archon associated with a known secretary can often be dated exactly. For some intervals of the Classical, Hellenistic, and Roman periods the archon lists are fully known—in particular, the History of Diodorus Siculus provides a sequence of Athenian archons correlated with Olympiad years from 480/479 through 308/307 BCE—but other intervals are subject to gaps and uncertainties. An inscription containing an isolated date with an identifiable year and a month specified as intercalary (δεύτερος, \"second,\" or ἐμβόλιμος, \"intercalary\") naturally establishes that year as intercalary, but such documents are rather infrequent, and moreover provide no positive evidence for years that were ordinary. Fortunately there are some types of inscription from which the characters of a larger number of years, both intercalary and ordinary, can be obtained. From around 340 BCE on, dates are commonly expressed both according to the calendar month and day and by the day number of the term of the prytany currently held by one of the Attic tribes. Since these terms were approximately equal, being the length of the calendar year divided by the number of tribes, the correlations make it possible to determine whether the year had twelve or thirteen months. From the Roman period, we have lists of gymnasiarchs serving typically for terms of one month, from which we sometimes have a sequence of attested months around month VI that either include or definitely do not include an intercalary VI. In recent decades a consensus has emerged that, over a long interval, the calendar of Athens conformed, with few deviations, to a 19-year intercalation cycle respecting the rule that the calendar year began with the first month following the summer solstice. As Morgan wrote in 1996, summarizing researches that he has not as yet published in detail:69 … from the mid-fourth century until the early third century the Athenians did closely follow this rule, with rare exceptions in times of political irregularity… Thus, combining lists of attested intercalary and ordinary years constructed by Stephen Lambert for 352/352 through 322/321 BCE,70 by Michael Osborne for 300/299 through 210/209 BCE,71 and by Harold Mattingly for 140/139 through 101/100 BCE,72 we have a pattern of attested characters of years, as shown in Table 8, that indicates a well-distributed cycle whose Year 1 according to the standard norm is 330/329 BCE ± 19k.73 This means that, at least so far as concerns intercalary and ordinary years, the Athenian calendar was synchronized with the Callippic calendar, even long before the Callippic calendar's 330/329 BCE epoch. Table 8. Attested and deduced ordinary (O) and intercalary (I) years of the calendar of Athens, 335/334 through 211/210 BCE and 140/139 through 101/100 BCE. Numbers represent the BCE year during which the Athenian year began, e.g. \"330\" represents the year 330/329 BCE. Years expected to be intercalary according to the Callippic norm are in bold type. While the inscriptional evidence reveals a 19-year recurring pattern of intercalary and ordinary years, it does not directly indicate how the character of years pattern was determined. In principle an identical pattern would result either from relying directly on an assumed 19-year cycle or (since the equation of 19 tropical years with 235 lunar months is quite accurate) from observing or forecasting the summer solstice. The two methods should not be thought of as exclusive of each other, as can be seen from two testimonia regarding Meton of Athens: on the one hand Diodorus, Bibliotheca Historica 12.36.2 states that Skirophorion 13 in the archon year of Apseudes (433/432 BCE) was the \"starting point\" (ἀρχή) of Meton's 19-year cycle (ἐννεακαιδεκαετηρίς), while a scholion to Aristophanes, Birds 997 (FGrH 328 F 122) states that in the archon year of Apseudes Meton erected a \"sun-turning-thing\" (ἡλιοτρόπιον), presumably an instrument by which the date of solstice could be determined, against the wall of the Pnyx. Skirophorion 13 was in fact the summer solstice date in 432 BCE associated with Meton by IMilet inv. 84 + inv. 1604 and by Ptolemy, Almagest 3.1.74 An intercalation cycle would have enabled the character of a year to be determined in advance (a necessity when the intercalated month was not the final one), while reference to observed solstices would have provided a check of the cycle's alignment with the seasons. A convenient way to model the intercalations of a well-distributed calendar cycle regulated by the rule that an annual phenomenon (such as summer solstice) must always be within the final month of the year is to treat that month as nominally a 30-day month, and calculate the day number dn of the phenomenon within the last month of Year n thus: (5) dn = dn–1 + 11 ¹/₁₉ days mod 30 Whenever the addition of 11 ¹/₁₉ would result in a value exceeding 30, Year n needs an extra month to keep the phenomenon within it, and thus is intercalary. It is easy to confirm that this algorithm generates a well-distributed cycle, and if we set d0 = 30, the cycle is in the standard norm. Again, setting 330/329 BCE ± 19k as Year 1 with d0 = 30, we find that 432/431 BCE corresponds to Year 13 with d12 = 12 ¹²/₁₉, which is close to the summer solstice date Skirophorion 13 in 432 BCE that is ascribed to Meton of Athens and that was supposedly the solstice preceding Year 1 of Meton's own presumed calendrical cycle (which of course did not follow the standard norm). After the beginning of the first century BCE the inscriptional evidence for intercalary and ordinary years dries up for more than two centuries. Was the same \"Callippic\" well-distributed pattern of intercalations by 19-year cycles continued? If so, the earliest year-beginning of the cycles would gradually have drifted sufficiently later than the summer solstice (Fig. 10), so that year 12 of the cycle, an ordinary year, would begin more than a month after the solstice, because 235 mean lunar months is about ¹/₁₁ days longer than 19 tropical years. If this was noticed, meaning that someone was paying attention to observed dates of summer solstices, a plausible response would have been to shift the beginning of Year 12 back one month, making Year 12 intercalary and the formerly intercalary Year 11 ordinary. This would amount to renorming the cycle so that the new Year 1 according to the standard norm would be 319/318 BCE ± 19k, a series that we may note includes the 205/204 BCE calendrical epoch year of the Antikythera Mechanism.75 Fig. 10. Longitude of the conjunction occurring closest to the summer solstice (solar longitude 90°), in Years 1 (solid markers) and 12 (hollow markers) according to the standard norm for the Callippic calendar. A temporal 1-day separation of the conjunction from the solstice corresponds to about 1.6° separation in longitude. The roughly seven-cycle waves are an effect of lunar anomaly sampled at 19-year intervals. Simone Follet determined from inscriptions the characters of eleven Athenian years spread over most of the second century CE (Table 9).76 All are consistent with the Callippic intercalation cycle, with one exception: 138/139 CE, which, being an ordinary Year 12 according to the Callippic norm, Follet deduced to have been intercalary; there are no other definite attestations from Years 11 and 12.77 Since an exchange of character of Callippic norm Years 11 and 12 is precisely what would have resulted from a renorming of the intercalation cycle to take account of the backward creep of the solstice relative to the lunations, it appears credible, even likely, that such a renorming had taken place by the early second century CE. A terminus post quem for such a renorming is 168/167 BCE, a Year 11 according to the Callippic norm that is known to have been intercalary.78 One might tentatively date a renorming, if it did indeed happen, to the late second or first century BCE, when the gap between the solstice and the beginning of the first month of Callippic norm Year 1s would have become large enough to motivate it. For our present purposes, calendar synchronization will mean the existence of rules regulating two lunisolar calendars such that any Month m of one calendar always, or almost always, coincides with Month n in the other calendar where n–m is constant; the calendar years need not coincide. If A and B are two well-distributed lunisolar calendars, their years will remain in rough alignment without systematic drift, that is, for any month of calendar A, there will be at most two consecutive months of calendar B that can coincide with that month.79 Whenever an intercalary month is inserted in calendar A, the ensuing months of A will have counterparts one month earlier in B than in the previous year, with a return to the previous alignment when B has its next intercalation. For every month in calendar A to have only one counterpart in calendar B and vice versa, the intercalations in both calendars must therefore be simultaneous, not just to the year but to the month. Such synchronizations would not be likely to occur by accident, but one might look for evidence of them as a deliberate means of facilitating communication, travel, and commerce between Greek cities. A particularly rich source of such evidence is the corpus of well over a thousand manumission inscriptions from Delphi.80 These inscriptions, recording the sales of slaves to the god Apollo that effected their emancipation, mostly date from the last two centuries BCE and the first century CE, and in many a date is preserved expressed in both the calendar of Delphi and the calendar of the city where the owner resided. When we have sufficient such double dates correlating the Delphian month with the calendar of a particular other locality, as many as three tests of synchronization may be possible: (1) consistent correspondence of individual months of the other calendar with just one month of the calendar of Delphi, (2) consistent correspondence of individual months of the calendar of Delphi with just one month of the other calendar, and (3) correspondence of intercalary months of the two calendars. In Phokis, the region immediately surrounding Delphi, two systems for designating months were in use, namely a set—or perhaps multiple sets for different Phokian cities—of month names (Amalios, Dionysios, etc.), and ordinal numbering (πρῶτος = \"first,\" δεύτερος = \"second,\" etc.) counting from the first month of the calendar year. In the manumission inscriptions the ordinal naming is more frequent, and for our calendrical purposes it is more useful since it directly locates a Phokian month as well as whatever Delphian month is equated with it in the annual sequence—in fact, Kirchhoff's reconstruction of the order of months of the calendar of Delphi was based on the Phokian equations.81 Table 10 lists inscriptions correlating the Phokian numbered months with months of the Delphian calendar. Table 10. Month equations between the calendars of Phokis and Delphi and their inscriptional attestations. SGDI = Sammlung der griechischen Dialekt-Inschriften, FD = Fouilles de Delphes, BCH = Bulletin de Correspondance Hellénique. The consistent multiple attestations easily satisfy tests (1) and (2). Moreover, while we have no instance of an intercalary Phokian month using the ordinal naming, FD III 1:333 equates a named Phokian intercalary month (Amalios) with the Delphian intercalary month (Poitropios), satisfying test (3). Thus we have strong evidence that the calendars of Delphi and Phokis were synchronized, which also implies that both were regulated according to some cyclic principle. Ozolian Lokris, to the immediate west of Phokis, also had a federal calendar with ordinally numbered months, as well as named months variously attested in individual Lokrian cities; table 11 lists attested equations of the numbered months with Delphian months. Although we lack a direct equation of intercalary months, IG IX,12 3:672 attests to an Aitolian intercalary month IV, which would correspond to a Delphian intercalary month VI if intercalations took place in the same year. Hence the evidence for synchronization with the calendar of Delphi is also good for Ozolian Lokris and compelling for Aitolia. The Delphian calendar years 176/175, 168/167, 154/153, 143/142, and 140/139 BCE are known to have been intercalary, and the same has been proposed with less certitude for 165/164, 163/162, and 130/129.82 All these years except the doubtful 163/162 were intercalary in the Athenian calendar according to the Callippic norm. Moreover, the comparatively scarce attested equations of Delphian and Athenian months (FD III 2:66 equates Delphian III and Athenian III, and SGDI II 2089 equates Delphian VI and Athenian VI) are consistent with their calendar years' beginning concurrently, so that also their intercalary months would have been simultaneous. Hence we have a group of calendars of central Greece that were synchronized with the Athenian calendar during the late Hellenistic period. How widespread such synchronization was in this time is impossible to say. In the preceding section we saw that the calendrical epoch of the Antikythera Mechanism is likely to have been determined by the assumption that month I of the Corinthian calendar year was the third month beginning after the summer solstice, and moreover the repeated month in all intercalary years was likely to have been IV. Since in the Athenian calendar month I was the first beginning after the solstice and month VI was the intercalated month, the Corinthian calendar as inscribed on the Mechanism was in principle synchronized with the Athenian calendar—\"in principle,\" because complete synchronization would be contingent on a presumed renorming of the Athenian 19-year cycle (so that the years that were formerly Year 12 became Year 1) for which the evidence is slight, and \"as inscribed on the Mechanism,\" because we cannot know the exact extent to which the structuring of the Corinthian calendar on the Mechanism reflects actual calendrical practices in any locality where it was in use. This would have depended partly on how well informed the designer of the Mechanism was about those practices, and partly on the extent to which the Mechanism's calendrical function was meant to be descriptive as opposed to normative. 7. Rationale for the epoch dates and significance for the Mechanism. One way to approach a clearer understanding of how the makers of the Mechanism came to choose its epoch dates is to consider them as part of a broader process of designing a device for simulating a multiplicity of chronological and astronomical functions—admittedly a speculative exercise, but not hopelessly so, given that so much of what we know about the Mechanism has obvious connections with other products of Hellenistic astronomy. For this purpose, we can think of the Mechanism as comprising three conceptually separable divisions: one to synchronize the natural solar-stellar year, the lunisolar calendar, and the phases and zodiacal revolutions of the Moon, a second to predict eclipses and introduce an anomalistic component in the Moon's revolutions, and a third to incorporate the revolutions and synodic anomalies of the five planets. We will be concerned here only with the first two. I suggest that the germ of the Mechanism was the idea of coordinating the two kinds of time reckoning that were central concerns of Greek astronomy already in the fifth century BCE, if later testimony can be relied on: the lunisolar calendrical structures that pertained to the religious, administrative, and civil life of the Greek cities, and the \"parapegmatic\" years defined and subdivided by solstices, equinoxes, and the rising and setting dates of stars and constellations and associated with natural phenomena such as seasonal weather patterns. Surviving Hellenistic parapegmata such as the second century BCE inscription fragment IMilet inv. 456B and the complete parapegma transmitted as an appendage to Geminus's Introduction to the Phenomena divide the natural year into twelve segments of varying duration corresponding to the intervals during which the Sun traverses the twelve zodiacal signs, with the solstices and equinoxes set on the first days of the segments belonging to Cancer, Libra, Capricorn, and Aries. Accordingly, an initial design decision for an Ur-Mechanism was to represent the natural year by a pointer whose axis, driven more or less directly by the input rotation, revolved around a circular Zodiac Scale divided into twelve zodiacal sectors. Index letters at the beginning of each sector would mark the solstices, equinoxes, and entries of the Sun into each zodiacal sign, and other index letters irregularly spaced along the sectors would mark the dates of stellar phenomena. Instead, however, of subdividing the sectors into the individual number of days of the Sun's travel through each sign as in other parapegmata, the designer chose to make the scale primarily a spatial rather than a temporal one by inscribing thirty degree-divisions in each sector, anticipating that the scale would serve to track the revolutions of other heavenly bodies, not just the Sun. This use of degrees of longitude can be seen as an intrusion into the parapegma tradition from the later Hellenistic engagement with Babylonian mathematical astronomy.83 But the designer also wished to represent the time-dimension of the parapegmata, that is, the unequal numbers of days assigned to the zodiacal signs, a concept that allegedly can also be traced back to the fifth century in the form of an assumption that the astronomical seasons delimited by the solstices and equinoxes are unequal in length. This might have been accomplished by providing a second zodiac scale concentric with the spatial one but such that the sectors were subdivided into the requisite number of day-divisions. Instead, the designer adopted the 365-day Egyptian calendar year as a time scale, perhaps because the Egyptian \"wandering year\" was a familiar topic in the Greek astronomical and chronographical literature as we know from Geminus, Introduction to the Phenomena chapter 8. This choice had two corollaries: first, that the Egyptian Calendar Scale had to be a separate component installable in any alignment with the zodiac scale, since the Egyptian calendar dates of the annual solar and stellar phenomena were not constants but shifted forward by one day every four years; and secondly, because of this variable alignment of the temporal scale with the spatial scale, the inequality of the numbers of days in which the Sun traverses the zodiacal signs had to be represented by nonuniform spacing of the signs and degrees on the Zodiac Scale, not by nonuniform spacing of the months and days on the Egyptian Calendar Scale. While it may have been considered desirable to have a reference mark indicating the alignment of the Egyptian Calendar Scale with the Zodiac Scale for some epoch year to facilitate determining the correct alignment for other years, nothing in the structure of this dial favored any particular epoch year over any other. For that matter, since the parapegma cycle is indicated by a circular scale rather than a linear text, no particular annual phenomenon such as summer solstice had to be privileged as the cycle's starting point. Turning to the lunisolar calendar display, it would have been mechanically possible to devise a gear train leading from the axis that bears the solar pointer to another output axis whose revolution represents a 19-year, 235-month calendrical period; but such a dial, giving less than 2° to each lunar month, would not have been an effective means of showing the details of the calendrical cycle. Instead, an output with a revolution five times as fast, representing a 47-month subperiod, was adopted. Conveniently, this expedient not only allowed for scale cells big enough to inscribe with month names and year numbers, but also accommodated a cyclic scheme of 30-day and 29-day months since the numbers of each kind of month required for the 19-year cycle are both divisible by 5. The calendrical cycle dial could have been a conventional circular dial with five concentric scales for the subperiods, accompanied by a subsidiary dial with a 19-year period and five scale divisions to indicate which subperiod was current. Instead, the designer introduced the unusual spiral dial, which simplified the reading off of the current month but at the cost of an inconvenient resetting of the pointer at the end of each complete 19-year cycle. The fact that more than ten lines of the Back Cover Inscription (ii 5-16) were devoted to describing the special pointer for this dial and its method of operation might suggest that the designer took particular pride in its delicate mechanical complexity. By contrast, the subsidiary dials for the 4-year games cycle and the 76-year supercalendrical cycle were straightforward both in concept and gearwork. On the Mechanism that we have the luck to possess as a consequence of the Antikythera Shipwreck, the Metonic Dial is inscribed with the months and years of the Corinthian calendar, but this was probably a modification of the calendar display that appeared on the prototype mechanism, to suit an intended owner living in a locality where the Corinthian calendar was in use. What calendar was on the prototype we can only guess, but in the light of the fact that the Rhodian Halieia is among the athletic festivals inscribed around the Mechanism's Games Dial, Iversen's proposal of the calendar of Rhodes is highly plausible.84 The cycle as described on the prototype dial scale might have been an accurate representation of the way the Rhodian calendar was regulated at the time of the Mechanism's manufacture, or in some respects an idealized or prescriptive version influenced by ideas of how a calendar should be regulated. As Iversen has shown, the Rhodian year probably began with the month Karneios, normally the fourth lunar month following the summer solstice, that is, one month later than the beginning of the Corinthian year and three months later than the Athenian year.85 We may guess that a 19-year Rhodian calendar cycle was inscribed on the prototype Metonic Dial Scale as a well-distributed cycle in the standard norm. Hence the dial's pointer would have been in its initial position pointing downward to the inside end of the spiral slot at the beginning of any Rhodian year that started just about 89 days (i.e. three lunar months) after a summer solstice, presumably years such as 72/71 BCE—to go for the year closest to the date of the Antikythera Wreck—plus or minus some multiple of 19 years. We can further hypothesize that the prototype also had a subsidiary Games Dial inscribed just the same way as the one on our Mechanism, except that it would not have had the Naa of Dodona among its inscribed festivals, and a subsidiary Callippic Dial. The difference in the Rhodian and Corinthian year starts would not have affected the assignment of athletic festivals to the four Games cycle years. With these additions, the configuration such that the pointers of the Metonic and Games dials are simultaneously straight down would correspond to a Rhodian year that begins in the earliest possible position and that also is a year during which the Olympic festival took place, which would mean years such as 129/128 BCE plus or minus some multiple of 76 years. It is worth stressing that, so far as concerns the four outputs we have imagined up to this point as the conceptual germ of the Mechanism, all cycles would repeat exactly after 76 years of simulated elapsed time except for the manually shifted alignment of the Egyptian Calendar Scale, so that one cannot yet speak of a unique epoch date but only of a series of functionally equivalent epoch dates at 76-year intervals. Nor would the addition of a uniformly-revolving lunar longitude output to what started as the solar longitude-parapegma dial, or the provision of a lunar phase display, affect the epoch situation, because the 19-year period is assumed to comprise an exact integer number of synodic months and zodiacal revolutions of the Moon. 76 years' worth of rotary input forward or backward in time would return every single gear and pointer to precisely its initial position. Interestingly, with the calendrical dials calibrated to fit the Rhodian calendar year, the solar and lunar pointers would be close to alignment (conjunction) in the approximate direction of the beginning of Libra—at the bottom point of the Zodiac Scale in our Mechanism—at each 76-year epoch. This is a feature that would have been lost in a conversion to a different calendar. Incorporating a cyclic eclipse prediction function into this Sun-Moon-and-stars Ur-Mechanism radically changes its chronological scale, because at a minimum an eclipse prediction cycle must incorporate a periodicity that brings an approximate return of the Moon to its initial latitude as well as to its initial longitudinal configuration relative to the Sun, and no small multiple of the 19-year cycle accomplishes that.86 The shortest common period of the 235-month calendrical period and the 223-month Saros period on which the Mechanism's eclipse function is based is 52,405 months, or 4237 years, so that any configuration involving a Saros cycle together with a 19-year cycle would effectively pertain to a unique date within any practical span of time to which the device would ever be set. We saw above that the assumption, implied by the Mechanism's eclipse prediction scheme, that the Saros and its triple, the Exeligmos, are exact recurrence periods for lunar and solar eclipses with respect to both magnitudes and times is false, and considerably more accurate parameters were employed in the Babylonian mathematical lunisolar theories as well as in the astronomical modelling of Hipparchus and Ptolemy. Nevertheless we have Ptolemy's testimony in Almagest 4.2 (ed. Heiberg 2.269-270) that some Greek astronomers took the Saros (which he calls periodikos, \"cyclic\") as an exact period relation: Adducing observations of lunar eclipses, for the reasons we gave, [the astronomers of the past] sought to find what interval of a [whole] number of months was always equal in duration to intervals of the same number [of months] and contained an equal number of longitudinal revolutions (either a whole number or plus certain equal arcs). Now the still earlier [astronomers] assumed in a rather rough way that this time-interval comprised 6585 1/3 days; for they saw that in an [interval] of this size 223 months were completed, and 239 restitutions of anomaly, and 242 [restitutions] of latitude, and 241 circuits in longitude plus 10 2/3 °, which is the same number [of degrees] as the Sun takes up over its 18 revolutions in the aforesaid time-interval, such that the [longitudinal] restitions of [the Sun and Moon] are reckoned relative to the fixed stars. They called this time-interval periodikos as being the first [i.e. shortest time-interval] that brings the various motions approximately to one and the same restitution. And so that they could make it comprise a whole number of days, they tripled the 6585 1/2 days and obtained the number 19656 days, which they called exeligmos…. Ptolemy is vague about the chronology of these \"astronomers of the past\" (οἱ παλαιοὶ μαθηματικοί) and their \"still earlier\" predecessors (οἱ ἔτι παλαιότεροι), but since just after spelling out the tripled numbers of periods in the exeligmos he writes that Hipparchus had already shown (ἤδη μέντοι πάλιν ὁ Ἵππαρχος ἤλεγξεν) that the Saros was inaccurate and confirmed certain superior lunar periodicities derived from Babylonian astronomy, he seems to imply that the Saros still had its advocates even after Hipparchus's time. And indeed Geminus, writing several decades after Hipparchus, writes (Introduction to the Phenomena 18): An exeligmos is the shortest time-interval containing a whole number of months and a whole number of days and a whole number of restitutions of the Moon. By \"restitutions\" Geminus is referring specifically to periods of lunar anomaly; his discussion of the exeligmos introduces a chapter on the Moon's varying speed, and he accordingly has nothing to say about latitude or about eclipses for that matter. But it is clear that he regards the exeligmos (and by implication the Saros) as exact. The designer of the Mechanism likely did so too. While it is true that the superior parameters known to Babylonian astronomers and to Hipparchus could not in any case have been made the basis of a mechanical eclipse prediction function as simple as that of the Mechanism, the mere fact that the designer thought that times of syzygy could be projected forward or backward with any reliability using the Saros indicates ignorance of the period's defectiveness. Any gear train originating in the calendrical part of the gearwork and yielding as an output revolution a simple multiple or fraction of a Saros has to have a 223-tooth gear, one of the largest that the device would require. It was unquestionably one of the designer's finest insights that this large gear could be made to revolve with the longitudinal period of the lunar apogee, so that it could be the platform for a system of epicyclic gearing that introduces an anomalistic variation in the lunar longitude output. Perhaps it was in connection with this side-benefit of the decision to give the Mechanism a Saros-based eclipse prediction function that the designer made the Saros Dial a four-turn spiral. Just as in the case of the Metonic Dial, a spiral structure for the Saros Dial was motivated by wanting to provide sufficient scale space to each month to accommodate inscribed information (in this instance concerning possible eclipses), but the specific selection of four turns was clearly dictated by the fact that one Saros contains approximately 16 (4×4) revolutions of the Sun relative to the lunar perigee or apogee. The four marks inside the spiral thus indicated these events. One practical application could have been to enable an operator of the device to set it to months during which the daily motion of the Moon was slowest near opposition and fastest near conjunction or vice versa, facilitating a visual demonstration of the variability of the Moon's speed. Although intended to serve as the basis of eclipse predictions valid for (in principle) any of a succession of Saros cycles, the data with which the Saros Dial Scale and its supplements in the Back Plate Inscription were inscribed had to be computed in the first instance from some specific Saros period, starting for the sake of the lunar anomaly scheme with a month in which the Sun was close to the lunar perigee and hence the Moon close to its apogee at the date of opposition. Such months are not extremely rare, but on the other hand they are not so common for it to be likely that one of the series of epoch years of the calendrical dials, spaced at 76-year intervals, was likely to begin with a month having this property while being near enough to the date of the device's construction to be convenient as a reference setting for practical operation. And in fact the first months of the calendar years 129/128 BCE and 205/204 BCE, which are the only calendrical epoch years at all likely to have been in consideration, did not have the Sun anywhere near the lunar perigee, whether we are considering Rhodian or Corinthian calendar years. As a compromise, the designer chose to use a Saros period beginning a few months before the calendar year 205/204 BCE, namely five months earlier, with the month whose full moon fell on May 12, 205 BCE; and it was only as a result of this decision that 205/204 BCE became the calendrical epoch. Because the two epoch dates were separated by several months, the Saros Dial's pointer could not be at its initial position—in this case pointing straight up—simultaneously with the calendrical pointers' pointing straight down. At the calendrical epoch, the Saros Dial pointer would have been approximately 32° clockwise from the vertical, and so the Exeligmos Dial's sectors were inscribed so that its pointer too would be approximately in this orientation at the calendrical epoch. Adapting the design of the device to create the version that we have, with the Corinthian calendar as the calendar of the Metonic Dial, would not have required any change to the inscriptions of the Saros Dial Scale. If, as Iversen conjectures, the prototype's calendar had its years beginning just one month later than the Corinthian years, the sector divisions of the Exeligmos Dial ought to have been rotated about half a degree counterclockwise to reflect the reduction by one month of the interval between the eclipse and calendar epochs, but this is so small a change that it might have been omitted. Besides this, all the epoch settings of gearwork and pointer relating to the display of the heavenly bodies on the front dial would have to be shifted back by one month's worth of motion. If the designer was active at any period between 205/204 and 129/128 BCE, the choice of an eclipse epoch in 205 BCE would have been an obvious option, since it put the two epoch dates close together and as near to the present as possible. (An epoch date in the future would not be very plausible.) If the date of the device's manufacture was after 129/128, there still may have been motivations for selecting a pair of epoch dates that did not include the most recent calendrical epoch: the designer may have wanted the margin of past time between the epochs and the present to be longer than 76 years, for example in order to be able to perform demonstrations corresponding to historical dates, or perhaps none of the oppositions within reasonable distance of the 129/128 calendrical epoch had the Sun satisfactorily near the lunar perigee. Since the designer seems not to have understood how defective the Saros is as a cyclic predicter of eclipse circumstances, the only real impediment to having the epochs in the relatively remote past was the amount of turning of the input drive required to move back and forth between the epochs and the present. In other words, while the dating of the eclipse series inscribed on the Mechanism's Saros Dial taken by itself may suggest a dating of the Mechanism's construction somewhere within the 76 years after 205/204 BCE, other considerations such as the archaeological context in which it was found, together with what is otherwise known of the development of Greek astronomy in the Hellenistic period, may outweigh this preference and favor a later date. Appendix 2. The calendar of the Metonic Dial as proof of the Mechanism's antiquity. The authenticity of the fragments in the National Archaeological Museum as the remains of an ancient Greek mechanical device has occasionally been contested.88 Following Derek de Solla Price's announcement of preliminary results of his study of the fragments at the Museum in 1958, presented at the AAAS meeting in Washington, DC on December 30, 1958, American and Greek newspapers reported the views of a retired professor of German at the University of Virginia, Karl Mohr, that the Mechanism was merely a modern schoolroom planetarium that had accidentally been dropped from a passing ship upon the ancient shipwreck site.89 Starting in 2012 (or possibly earlier), Francis Nimal, a retired engineer, with collaboration from Bernard Tranier, an artisan clocksmith, has circulated elaborate arguments that the Mechanism was a 17th century pseudo-antiquity intended for a \"cabinet of curiosities\", that perhaps was discarded in a marine site, was subsequently dredged up, and found its way into the National Archaeological Museum's collections, where it became mixed up with the materials from the Antikythera Wreck.90 Most recently, Frédéric Lequèvre, a physicist by training and author of several p opularizing works on science and pseudoscience, has written two monographs on the Mechanism, the second of which raises doubts about its antiquity and concludes that it dates from the second half of the 16th century or later (\"à partir de la seconde moitié du XVIème siècle\").91 The present appendix makes no attempt to address specific arguments that have been raised by Mohr, Nimal, Lequèvre, or anyone else against the Mechanism's status as an artifact of classical antiquity. So far as I know, none of these arguments have been presented in any medium that has passed through peer review or other competent scholarly scrutiny. Underlying them is the popular perception—to some extent unintentionally encouraged by Price and other scholars who, while entertaining no doubts about the Mechanism's age, have sought to emphasize the disjunction between its technology and commonly held beliefs about what was achieved in ancient times—that the Mechanism is too \"advanced\" to have been a production of the ancient Greeks.92 In fact we have numerous explicit references to such devices in Greco-Roman literature starting in the first century BCE, right around the time of the shipwreck .93 Moreover, the Mechanism as currently understood fits well within the known contexts of ancient science and technology, for all that it is beyond doubt a remarkably advanced artifact of those traditions.94 This has been the view of everyone who has conducted serious research on aspects of the Mechanism over the past three decades. Nevertheless, given the huge public attention that the Mechanism has received in the present century, and the notoriety surrounding several recent controversies concerning the authenticity of various ostensibly ancient objects and manuscripts, it is worthwhile to set out the specific evidence that makes the antiquity of the Mechanism not just a credible assumption but a demonstrable fact. Any hypothesis for a post-antiquity origin of the Mechanism, whether (like Mohr, Nimal, and Lequèvre) supposing it to be a modern artifact that has accidentally made its way into the collection of the National Archaeological Museum and come to be identified as ancient, or to be a deliberate forgery, has to take account of the record of photographs and written descriptions that securely document the fragments' presence in the Museum from May, 1902 until the present.95 Newspaper reports from May, 1902, many of which are available online now for anyone to consult,96 state that the fragments were singled out for notice at that time among objects recovered from the Antikythera Shipwreck site during the salvage operations of 1900-1901, and Valerios Stais, the Museum's director, wrote in 1905 that they were recovered during the late stages of the operations (ἀνειλκύσθη περὶ τὰ τέλη τῆς ἁλιευτικῆς περιόδου τῶν Ἀντικυθηραϊκῶν ἀρχαιοτήτων).97 Newspaper articles from June, 1901 reporting the recovery at the wreck site of a \"slab\" or \"marble slab\" bearing an illegible inscription have recently been identified as likely references to some or all of the Mechanism's fragments (presuming that the specification of marble was a mistake, given that no inscribed marble slab appears to have been a part of the wreck).98 Moreover, the condition of the fragments before conservation, including the thick layers of patina and the loss of most of the wooden casing except for parts lying close to metal, is consistent with their having been in a marine environment for a long period. Nevertheless, we will take 1902 as the date by which we can be absolutely sure that the Mechanism was made. It deserves to be noted how improbable on general considerations is the aggregate of scholarly knowledge we would have to assume for a modern constructor of the Mechanism, whether we are speaking of a 16th or 17th century maker of faux antique clockwork or a circa 1900 malicious forger. The front and rear dial plates of the Mechanism, as well as the two so-called cover plates, fragments of which survived adhering to the dial plates,99 were densely inscribed with texts in Greek epigraphic letters characteristic of roughly the last two centuries BCE, ranging from single alphabetic letters functioning as indices to extended prose texts.100 Reflecting the wide range of chronological cycles and astronomical phenomena that the dials displayed, the inscriptions variously employ technical terminology and numerical parameters of Greek astronomy and terminology of mechanical technology and calendrics. Some of the terminology can be paralleled in an exceedingly small number of ancient authors, thus confirming the authenticity of the vocabulary while at the same time showing that a modern fabricator, in addition to being an adept in Hellenistic epigraphy, would have had to be intimately familiar with sources not widely read and belonging to quite disparate disciplines, including such authors as Ptolemy, Geminus, and Heron of Alexandria. For example the term ἐξαιρεσιμοὶ ἡμέραι for the skipped day numbers in nominally 30-day lunar months that in fact contain only 29 (Back Cover Inscription II 4) as well as the scheme of distribution of these skipped days at 64-day intervals (Metonic Dial interior inscriptions) are attested only in Geminus, Introduction to the Phenomena chapter 8;101 and certain mechanical terms in the Back Cover Inscription (e.g. ἀσπιδίσκη = \"boss,\" I 28; στημάτιον = \"bearing,\" II 5-6; τυμπάνιον = \"disk,\" II 5; συμφυές = \"attached,\" II 9-10; γνωμόνιον = \"pointer,\" I 16, 21, and II 17) are elsewhere found in close proximity only in Heron's Dioptra.102 The names of athletic festivals inscribed around the Games Dial include not only the well known panhellenic competitions of the ancient periodos (Olympics, Nemeans, Pythians, and Isthmians), but also the obscure Halieia of Rhodes and Naa of Dodona; the earliest appearance in print of an attestation of the Naa seems to have been the inscription Priene 234, published by Richard Chandler in 1774.103 In the case of a forger, we would also have to presume knowledge of how to fake the effects of centuries of submarine corrosion, which incidentally rendered many of the inscriptions so illegible that it has required technologies unimaginable in 1900 to read them. But the hypothesis of a modern origin of the Mechanism is not just highly improbable. As I will show in the following, the person or people who constructed the Mechanism possessed information that existed in antiquity but that could not have been available to anyone from the earliest modern period until the late 20th century—in fact some of this information only came to light in and after 2008 as a consequence of study of the Mechanism. The part of the back dial plate preserved in Fragment B features a set of concentric arc-shaped strips separated by narrow slots. In photographs dating from 1902 through (probably) 1918, the interior face of the dial plate was entirely exposed but covered in a layer of patina through which nevertheless the structure of the strips and slots is easy to make out.104 Most of the exterior face was concealed behind a layer of accreted material bearing mirror-text offsets from the Back Cover Inscription; the part of the dial plate that was not behind the accretion layer was covered by a thick layer of rough patina through which one can barely see traces of the slots but no other features. This accretion material and the processes by which the mirror-text offsets were created undoubtedly took a very long time. In photographs from the mid 1950s, following conservation carried out by the Museum in 1953, the exposed part of the dial plate's exterior face has been cleared of patina, revealing that the strips were divided by radial strokes into small cells containing brief inscriptions in tiny letters, which with one or two exceptions appear too corroded to identify.105 Price reports that the inscriptions were illegible, and they substantially remain so to unaided direct observation or conventional photography.106 Despite the incompleteness and damaged condition of the strips, Wright was able to show that they originally constituted a continuous spiral scale in five full turns, divided into 235 cells that represented the 235 lunar months comprising a 19-year \"Metonic\" cycle such as could describe a cycle regulating a lunisolar calendar.107 Hence the main dial of the Mechanism's upper back face to which the spiral scale belonged is known as the Metonic Dial. Using the computed tomography data for Fragment B obtained in 2005 by the Antikythera Mechanism Research Project in collaboration with the National Archaeological Museum, a group of AMRP researchers succeeded in reading enough of the inscriptions within the Metonic Dial scale to establish that the sequence of cells constituted nineteen lunisolar calendar years, each containing twelve lunar months with distinct names or thirteen lunar months with one of them a repetition of its predecessor.108 The twelve month names, in order starting with the first month of the year, are listed above in Table 2. Because the month names are repeated in each year, their spellings are secure despite the presence of uncertain or illegible letters in individual attestations, and independent of any comparative material from other sources. This ordered list of months was identified in its first presentation in 2008 as a version of the calendar of Corinth, an identification that has since been confirmed and refined by Paul Iversen.109 What I will demonstrate here is that a significant part of the knowledge of the Corinthian calendar embodied in the list was unavailable from the time that this calendar fell into oblivion, probably by late antiquity, until the late 20th century. Before 2008, the Corinthian calendar was a construction of modern scholarship, progressively built from three sources: (1) the explicit attestations of month names belonging to the calendar of the city of Corinth itself, (2) attestations of month names, mostly in epigraphical sources, with some hints possibly relating to their sequence, belonging to the calendars of various localities in Epirus and neighboring regions, and (3) the almost completely known ordered sequence of months of the calendar of Tauromenion in Sicily, derived from inscriptional evidence. (1) needs no justification. (2) is relevant because many of the localities in question were founded as colonies by Corinth, or were under the cultural influence of such colonies. (3) comes into play because comparison of the Tauromenian calendar with the evidence from (2) reveals an obvious relation even if the historical circumstances that explain the relation are less direct and to some extent speculative.110 Details of the sources. (1) Attestations of months from Corinth itself. Before 1919, when Smith identified an attestation of the month name Phoinikaios in an inscription (Corinth 8,1 2), the sole explicitly attested Corinthian month was \"Panemos\" (Πάνημος, so spelled) in a passage (likely spurious) of Demosthenes, De corona 157.111 (2) Attestations of months from Epirus and environs. The process by which a common calendar for Epirus and its environs was recognized and its month list reconstructed from inscriptional sourced was gradual. Most of this epigraphical material was not excavated until the nineteenth century and later, certainly well after the sixteenth century. Alan Samuel's 1972 calendrical handbook, Greek and Roman Chronology, listed the known month names for several localities (Ambrakia, Epirus, Epidamnos, Apollonia, Corcyra, Corcyra Melaina), amounting to eight distinct names, but without explicitly hypothesizing a common calendar.112 Pierre Cabanes produced a slightly different list of eight months as belonging to the \"Epirote calendar\" in his 1976 monograph on Epirus, and in subsequent publications up to 2003 he brought the number up to twelve and proposed a sequence for them.113 Meanwhile Catherine Hadzis (in a 1995 summary of her unpublished 1992 dissertation) and Catherine Trümpy (in her 1997 monumental work on Greek calendars) have offered two different reconstructions of what they designate as the Corinthian calendar, drawing on calendrical attestations for greater Epirus and Syracuse together with Corinth, complete with twelve month names—in Trümpy's case not entirely the same as that of Cabanes—and a sequence for the months.114 To show how the reconstruction of the calendar attested in Epirote sources was in flux from the 1970s through the 2000s, the following table compares the months known to Samuel and to Cabanes in the 1 970s, listed alphabetically, those accepted by Hadzis, Trümpy, and Cabanes (2003) listed in their reconstructed sequences, and the ordered sequence on the Mechanism's Metonic Dial. As the comparison shows, right up to the publication of the Metonic Dial inscriptions in 2008 no one had established a list of twelve months from the Epirote sources that entirely matched those found on the Mechanism. Most notably, two month names on the Mechanism, Δωδεκατεύς and Λανοτρόπιος, appear in none of the lists. Although somewhat differently spelled counterparts of the Mechanism's Dodekateus were present in published inscriptions from Apollonia and Corcyra, Cabanes did not recognize these as true month names, but supposed in one instance that the word qualified another month (Eukleios) named in the text as the twelfth month of the calendar year and in the other instance that it could be an expression for an intercalary month.115 Again, instead of Lanotropios, Cabanes only knows of a month that he spells Ἁλιοτρόπιος (Haliotropios, presumably meaning \"month of the Sun's turning,\" i.e. a month coinciding with one of the solstices). In fact, as Iversen has established, the supposed attestations of Haliotropios actually read, with uncertain initial breathing, Αλοτρόπιος (H)alotropios, Magnesia 45, also CIGIME 2.2, 76 and 77) or Λαν[ο]τρόπιος (Magnesia 46, probably also National Archaeological Museum NM Kar. 499).116 The orderings of the months proposed by Hadzis, Trümpy, and Cabanes are also very different from that found on the Metonic Dial scale. The only significant match is the sequence Eukleios–Artemitios–Psydreus in Cabanes's list, which was deduced from the inscription IG IX.12 iv 798 (first published in 1702), from which one might also have inferred that the month immediately before Eukleios was Δυωδέκατος, Dyodekatos, if this had not been mistaken for an ordinal qualifying Eukleios.117 3. The calendar of Tauromenion. The months of the calendar of Tauromenion and their sequence are known from a series of inscriptions IG XIV 423-430 which were excavated at Taormina starting in 1833 and published between 1838 and 1890, and an additional one first published in 1964.118 Of the twelve months, seven match (with some orthographic variants) months of the Metonic Dial, and occupy the same relative positions if one synchronizes the two sequences (Table 14). This list only attained (almost) its present form with the publication of the last discovered inscriptions in 1964.119 Using the five inscriptions that had been made known by 1869, Wachsmuth was almost able to reconstruct the sequence from Apellaios through Artemisios, but with an incorrect reading for Lanotro[pios] (\"Dalios\"), an uncertainty about whether there might have been an additional month before Apollonios, and an incorrect placement of Eukleios following Dionysios.120 So far as concerns the seven months shared with the Mechanism's calendar, the correct relative placements were first established by Bischoff in 1894 using the additional inscriptions published in IG XIV in 1890.121 The ordered sequence of month names on the Mechanism's Metonic Dial is in most respects demonstrably that of a genuine ancient Greek calendar, specifically a variant of the family of calendars belonging to various localities in and around Epirus that was largely unknown until the 20th and 21st centuries. All twelve month names are attested (some with slight orthographic variants) in Epirote inscriptions, and they are, for all intents and purposes, the only local month names occurring in them.122 Moreover, the relative positions of eight of the twelve months are verified by their counterparts in the calendar of Tauromenion. These verifications are just what one would have expected if the Mechanism was made in antiquity; its designer could then have had access to full and accurate information about whatever calendar he (or the commissioner of the device) chose to inscribe, either through personal knowledge or from sources lost to us. Could someone in modern times, say in the 16th or 17th century (as proposed by Nimal and Lequèvre) or even right up to the beginning of the 20th century, have composed the Metonic Dial's inscribed calendar? (We leave aside the obvious question of why such a person would have chosen such an obscure calendar that has no ready associations with Greek science and philosophy!) The answer is clearly no. Not only was there no single source, whether literary or inscriptional, providing the names of the twelve months and their sequence, but the minimum combination of sources from which someone with the right insight might have achieved the fullest possible reconstruction independent of the Mechanism's testimony was not yet available. Simply to get the eight months whose relative places are known, including the non-Tauromenian Psydreus, one would have had to have access to both the inscription from Corcyra IG IX.12 iv 798—first published in 1702—and the Taormina inscriptions—published between 1838 and 1964. Right away this rules out Nimal's and Lequèvre's hypotheses. And although the first of the Taormina inscriptions were found in 1833, the correct placing of all eight months would only have been a theoretical possibility after the publication or republication of the Taormina inscriptions IG XIV 423-430 in 1890, and even then it would have been highly improbable.123 Even more decisive is the month name Lanotropios, which was only partially preserved on IG XIV 429 and was only recognized on hard-to-read inscriptions from Dodona and Epidauros after 2008. Moreover, one would have required much more extensive knowledge of inscriptions from Epirus to determine which of the Tauromenian months did not belong. Lists of Epirote months were still seriously defective in the 1970s; before 1902 it is inconceivable that anyone could have come up with the full set inscribed on the Mechanism."
}