{
  "articleId": "isaw_paper22_5",
  "text": "ARTICLE_ID: isaw_paper22_5\nThis paper presents an open-ended scenario in which a game engine can be part of a collaborative effort to invoke the experience of moving through a large and complex Roman house, in particular the House of the Faun at Pompeii.1 This scenario was conceived in the context of teaching so that in what follows the terms learning, creation, and collaboration are overlapping concepts that can all involve the translation of Roman material culture into a schematic digital form that supports exploration of a wide variety of ancient experiences and contemporary scholarly perspectives.2 And while stressing that it is not the goal here to delve too deeply into terminological issues, I do highlight the use of playification in the title. This is distinct from gamification in that the digital scenario under discussion has no defined end and no score is kept.3 There is no winning and therefore no game if that term is used narrowly.But there is play and playfulness that is implemented in the hope they can lead to dialog and hands-on learning.The discussion here also takes place within the context of existing work, which is incorporated by reference to three other uses of games and game engines in teaching. These are pedagogic use of Assassins Creed, itself a prepackaged series of commercial games4; then the Sailing with the Gods game being developed at Emory University5; and also the published discussion of the pedagogic value of using game-engines to let students build a version of the Classical-period Athenian Agora and the Pnyx, which are both outdoor spaces of civic participation and interaction.6 To jump ahead to one conclusion reached by these projects, and by others, and which this article repeats game engines have become flexible enough so that they can be the mechanism for both exploring and teaching diverse approaches to the ancient world that take account of multiple experiences and viewpoints. The particular use case I present adds to that existing discourse by using a cloud-based tool u2014 the online game-engine PlayCanvas (fig. 1) u2014 that has the free distribution of source-code for digital interactive environments as well as the concurrent multi-user creation of those environments as two of its core functions.By illustrating such use and sharing through screenshots, embedded videos, and links, this paper emphasizes openness and reusability within the ongoing discussion of how gaming-related methods and tools are being incorporated into the teaching of the Ancient Mediterranean and of other past cultures.Throughout what follows, process will become as important as result, particularly as the actual results are experimental and schematic. That second term schematic is one that I repeat and by which I mean only that the visual representation of the House of the Faun discussed below is very simplified.Much is left to the imagination of the user u2014 including the existence of upper floors u2014 an aspect that I consider to be a feature.The underdetermination of how users experience a virtual space, including when they're creating that space, is presented as one path to encouraging open-ended consideration of multiple past experiences and modern perspectives.7Moving ahead, this paper will come to describe collaborative building of an interactive online environment using PlayCanvas (figs. 2 & 3). Collaborative means both simultaneous cloud-enabled work in which more than one person can deploy 3D assets and also asynchronous work on versions branching from an original.8 Although PlayCanvas is not an entirely open source environment, it does provide very functional free accounts and can export an HTML5-based interactive environment that itself can be shared on sites such as GitHub.Additionally, PlayCanvas projects can be duplicated and the new version edited by other users. By briefly showing some of these steps, this paper stresses that tools such as PlayCanvas allow the creation of online environments to itself be a learning experience.Learning can follow from the observation that building interactive environments means making choices.Any one such environment, especially one that is achievable by students who may not have especially advanced digital skills, is the product of an accumulated selectivity that requires both inclusion and exclusion. There are many questions to be asked along the way.What are the mechanics of moving through a space and what do those imply about the in-game identity of the player?9 If a camera represents a first-person view, is it placed at adult eye-level or does it represent a child's perspective?How might men and women, or enslaved and free people, experience a space differently.10 And since the recreation of every detail on an ancient space is not feasible, both because we don't know every detail and because infinite detail would require infinite time, what choices as to the appearance of a space are we as modern creators making and what do those say about our interpretation of the Roman world?11 Does an emphasis on wall-painting detract from the skill that went into laying floors? Recognizing that digital environments emphasize such questions is itself an opportunity for learning.12From Game Engines to TeachingGaming and software game engines are already integrated into the presentation and teaching of the historical past generally and of the Ancient Mediterranean specifically.13 Playing unaltered commercial games u2014 even if sometimes in their exploration mode u2014 is a well-established pedagogic technique and the Assassin's Creed series is frequently the starting point for discussing such use. While no one would describe the overall worlds presented by Assassin's Creed Origins and Assassins Creed Odyssey u2014 which are respectively set in late Ptolemaic Egypt and an amalgam of Bronze Age and Classical Greece u2014 as completely accurate, they are sufficiently informed by historical and archaeological understanding to have drawn the attention of instructors hoping to bring interactive experience of an ancient setting into the classroom.In a recent article, MacLeod describes her use of the Discovery Tour mode of Assassin's Creed Origins in a class on Egyptian Religion, another class on Egyptian Archaeology, and at times as a guest lecturer.14 While her introduction correctly notes the slow adoption of gaming when the entire landscape of teaching the ancient world is taken into account, she moves to her own successes while also emphasizing where she sees room for improvement. These can broadly be categorized as improved in-class discussion on the nature of archaeological knowledge about the past.One focus of MaCleod's teaching is the Pyramid of Khafre, built well before the period during which the game's narrative takes place.The inclusion by Assassin's Creed Origins of post-use looting tunnels was a prompt for comparison with the presentation of the temple in the Digital Giza project, a project that does have an avowedly scholarly intent. Students appreciated that the game-engine based presentation of the site was engaging.15 She also reports that several students who were usually quite reticent enthusiastically added to the discussion in the Egyptian religion course.In another use case, Casey confirmed the interest of the creators of Assassin's Creed Origins in ensuring that the final experience was at-least informed by current historical research by interviewing two people closely associated with its production.16 In his discussion of his own teaching, Casey chooses illustrations that are, by my judgment, compelling renderings of life in a complex agricultural society. The work to recreate the pyramids is certainly impressive, but it is the recreation of fields and less spectacular private and public architecture u2014 of which Casey provides many screenshots u2014 that may have the most pedagogic value.In both these scenarios, successful teaching comes not only because of the content on the screen, but because that content is used as a starting point for discussion.The general point is that recreated digital worlds play the same role that many other in-classroom materials do. Discussion and active participation are the goal, not just passive interaction.As noted, Assassin's Creed is a commercial effort.This is not a critique, only an observation as this paper moves towards more open-ended engagement with the use and the creation of virtual worlds.Games that do emerge from their academic creators' prior scholarly interest in the ancient Mediterranean are also of interest here because they highlight the extent to which limits on the practical ability to recreate all aspects of ancient experience are not an impediment to meaningful engagement with that experience. A working example is Sailing with the Gods, a game being developed at Emory University in the context of long-term archaeological field work at the Classical to Roman period Sanctuary of the Great Gods on the Aegean island of Samothrace.17 The impetus for the game was to understand the social network of reciprocal honors granted between cities and expressed at Samothrace. It is parenthetically interesting that one goal of creating the game was to collect data about how human agents might move through both the physical world of maritime navigation and the social networks that such navigation can create.Student players of the game might seem to be imperfect proxies for Hellenistic merchants, but there is no particular reason to think that automated computational agents as used in Agent Based Modeling (ABM) are inherently any better so long as the limits of either approach are taken into account.18 Returning to the game as a game and as a context for recreating human experience, Blakely notes that the earliest play-throughs were punctuated by the frequent deaths of sailors from dehydrationu202619 It may well map to ancient experience that satisfying thirst is an equal concern alongside the creation of what we would call a social network. But it is a metaphoric understanding of these networks that informs the main pedagogic outcomes of the game.Sailing with the Gods asks students to take on the role of captain of a merchant vessel.The game-play itself has at its core the movement of a ship between ports.The player selects the crew, who bring their own social connections, and navigate between cities where they have stronger or weaker social connections that influence commercial success. Blakely summarizes those in part by writing, students come out of the game with a view of the ancient Mediterranean structured as much by stories told [and] contracts agreed to as a purely geospatial configuration.20.Sailing with the Gods is a game, which means that it sets measurable goals and assesses players in relation to those metrics u2014 in this case the acquisition of fame, ancient Greek kleos, via the successful navigation of the Aegean at the head of a crew that is representative of the social complexity of the Aegean and Black Sea worlds. As with essentially all computer-based interactive games, Sailing with the Gods relies on a game engine to implement the ability of players to move through the world interactively.Game engines are software packages that bring together visual assets, handle user input, and introduce the interactive elements that allow game creators to emphasize those aspects of the world that they want players to experience virtually. While game-engine development has certainly been driven by commercial interests, they can also deliver environments in which open-ended movement and experience are implemented without there being any particular narrative goal or quantified outcome in mind. A substantially realized effort at the University of Berlin implements this approach by taking the Agora and the Pnyx in Athens as its selected environment for experimental recreation using the Unity 3D game engine.21 The overall agenda of that work is similar to the ideas explored here. To quote briefly, reconstruction of ancient sites can foster students critical thinking skills that can be applied to their own studies, to research and beyond.22 When asking students, who in this case were graduate students, to consider the Pnyx in particular, existing 3D models of this open-area meeting space were provided, to which students could add textures, plants, people and equipment. (p. 172). Because the main purpose of the Pnyx was a gathering for the Athenian popular assembly and for the delivery of speeches by prominent citizens, students had some ability to consider how well these speeches could be heard, with three options for the placement of the speaker's platform in different periods being set as the origin point for simulated voices.Asking students to make choices that were put into effect by the manipulation of varied digital assets encouraged them to acknowledge the cultural foundations of the situationu2026 (p. 174). Who could hear what? and what that might mean for the nature of civic participation are questions that aren't fully answered by game-engine based inquiry, but it is an issue, a topic for discussion, that is brought to the fore by letting students engage in such work.Using Play CanvasPlayCanvas describes itself as a web-first game engine intended for the creation of HTML5 games and visualizations.The term web-first is meaningful here. Development happens by logging into the PlayCanvas website and working there.Free and reasonably capable accounts are available, with the greatest restriction being storage, which can run out if many projects are underway at the same time.23 As I indicated above, PlayCanvas is not entirely open source one has to use the web-based client for development.But PlayCanvas does support the export of HTML-based projects that are playable when uploaded to any web server. Or projects can be played via the PlayCanvas website, which is the simplest approach.24Game-engine development software enables a workflow that can be loosely characterized as the gathering of digital assets, arrangement of those assets in a virtual space, and then implementation of a mechanism for a player to move around that space and interact with it.In recreating a schematic version of the House of the Faun at Pompeii, three major categories of assets were assembled. The first is the plan of the house that is available under a Creative Commons (CC) license on Wikimedia Commons.25 This plan emphasizes the walls that divide the house into many large and small areas, though there are also indications of columns, pools, and some other features.The House of the Faun is named after the bronze statue that stood in the first atrium near to the impluvium, or decorative pool filled by rain water.26 The original is in the Naples Archaeological Museum, but a copy is on site placed at the center of the impluvium (though it was likely placed at one edge of this pool in antiquity). Fortunately, there are openly-licensed 3D models available.The one used here was downloaded from the model sharing site SketchFab.27 A third category of asset consists of images of many of the floor mosaics that are found in rooms around the main atrium, including the well-known Alexander Mosaic that is another distinguishing feature of this remarkable home.These images also come from WikiMedia commons.This article is not intended as a tutorial on how to use PlayCanvas. Instead the intent is to show that it can be a platform for student engagement, particularly when the pedagogic goal is to encourage students to think about new approaches to studying the ancient world.An effective way of showing this here is screenshots and embedded videos illustrating aspects of working in PlayCanvas and demonstrating how users interact with the result.Figure 1 (above) shows the PlayCanvas interface for creating interactive environments. In many ways it is typical of its genre of software.The center of the screen shows the environment being built.On the left is an outline of all the digital assets in that environment.The Player is highlighted in that outline and also in the center pane, where its blue, green, and red handles for moving it are visible.In figure 1 only one account is working on this scene.The collaborative capabilities of PlayCanvas will be illustrated below.Figure 2 Video showing editing and playing an interactive plan of the House of the Faun in PlayCanvas.Figure 2 is a video showing a sequence of using PlayCanvas that ends with exploring the house.28 My intent in including it here is to be clear about the processes that implement the goals I describe and to make them seem achievable in any similar environment. The video starts with approximately the same view as Figure 1 and I first zoom in to the entrance, or fauces, of the house.Then I click on some of the walls in the outline at the left, which causes them to be highlighted in the center pane.They are translucent, which is an indication that they will not appear when the game is being played.They will, however, block movement.To illustrate this aspect, I next click on the 'u25b6' icon at the top right of the center pane. That initiates playing the game in test mode.After loading, a similar view appears, but with none of the editing tools.There is a panel of brief instructions showing near the top left.That indicates that pressing the 'z' key zooms the camera perspective in-and-out.Neither the zoomed-in or zoomed-out view is a strictly first-person perspective.Both are intended to capture the idea of self-aware individual experience when moving through the plan while also allowing the real-world player to maintain a sense of where they are. Next, the player navigates into the entrance and shows the walls are impassable.After zooming in, the player moves past the theater mask mosaic that marks the entrance.It is appropriate to experience this Roman house as a stage where social interaction is performed.29 Theatrical imagery evokes the god Dionysos and that theme is maintained as we move past the statue of the satyr and then further into the house to pause in the room at the far right corner of the atrium. This room has a finely executed mosaic of the same god, now shown as an infant riding a tiger, likely a reference to versions of the deity's early life that place him in eastern realms, sometimes India.After further testing of the impassibility of the walls here we then navigate to look at the Alexander Mosaic, which shows Alexander the Great (d. 323 BCE) at the moment of a triumph over the Persian King Darius III, perhaps at Issus in Anatolia.30 This is one of the most well-known artworks from the Greaco-Roman world. When near this mosaic, I zoom in-and-out again and move into the space so as to evoke the idea of walking on the artwork itself.This is meant to raise the issue of who would be able to do that.31 Was this a space reserved for the owner?32 But even if that was the case, that person's closest family members and enslaved attendants would have been able to enter in response to expectations of service.33Questions as to who could go where in this particular Roman house, as well as in others, allow the issue of modern student input to be re-introduced to this discussion. It is important that the editable version of the House of the Faun plan can be given to students so that they can adapt it.In classes, I have asked students to take on a persona and to think about where that individual could go.Figure 2 shows the effect of making walls impassable.34 The same mechanism can be used to implement social barriers.The Alexander Mosaic can remain visible but the space it is in can be made inaccessible. That is a brute-force approach that can't simulate all the social complexities of access in a Roman house.35 Instead, it is a tool for asking students to think about such issues and to translate their ideas into specific digital form.Figure 3 Video showing collaborative editing the interactive plan of the House of the Faun in PlayCanvas.The left and right browser windows each have a different user logged-in. These represent users who could be on different computers.Collaborative editing is the next capability of PlayCanvas to introduce.Figure 3 is again a video.It shows two browser windows u2014 Safari on the left and Chrome on the right u2014 and at its beginning the cursor hovers over two icons to indicate that two accounts are working on the same environment; each is logged into one of the two browser windows. In a real-world situation, these browsers would represent two people working on different computers, perhaps in different locations, though it works well to have students in the same classroom or in the same Zoom meeting.36 The video then shows that moving the statue of the faun in one window causes it to move in another. I then switch windows and move the statue horizontally and vertically, and then zoom out. That draws attention to an icon representing the view that the other user is seeing.Zooming in-and-out in the right windows, moves the icon in the left window.My intent here is to show that collaborative editing is possible.While there is some debate about the exact placement of this statue, the more interesting possibilities may be collaborative building of walls and placement of artworks, furniture, other items, as well as models of people. I also mean to have shown that relatively simple digital assets can be the prompt for this kind of work. Integrating 3D models, such as that of the faun, does require some familiarity with file forms and converting between them.Collecting plans of structures and images of artwork and then creating a schematic 3D world are all readily accomplished once instruction is provided.And even relatively simple representations are enough to allow students to build worlds that encourage thinking about not just what structures looked like, but also how they were used and how different individuals might have different experiences. Extended conversation leads to thinking about what aspects of human experience are hard to bring into this schematic representation but which can nonetheless be considered in class.37 My overall point is that PlayCanvas, or any similar tool, is sufficiently open-ended that readers can construct their own scenarios and be able to make progress towards realizing them. I do, however, recognize that the pedagogic scenario described here requires considerable digital infrastructure by way of easy access to networked computers.38 I do not presume that all students have this so also recognize that there are many paths to new forms of teaching.The final functionality to introduce is sharing. As noted, users can share virtual environments they create directly from their PlayCanvas account.It is also useful that PlayCanvas can export these environments as HTML-based packages that can be served as static-pages from any minimally capable webserver.It is similarly easy to initiate this export and doing so results in a directory on one's local machine.Illustrating such downloading is not of interest, but the follow-on result is. I have placed the resulting files into a GitHub repository at httpsgithub.comwalkable-ancient-planspompeii-house-of-the-faun . GitHub can act as a webserver for static pages so that the link httpswalkable-ancient-plans.github.iopompeii-house-of-the-faun will allow live interaction.Indeed, right-clicking on the link to open it in a new window should initiate the multiplayer aspect of the game.39 Readers are encouraged to click through and experience for themselves the extent to which this digital resource might support the ideas discussed in this paper. And while it is certainly the case that the implementation I show here may not continue to function over the very long term, the digital assets remain available and the principles can be applied in future digital contexts.40ConclusionIn conclusion, I stress that one intent here is to be timely. I am writing in the context of current debate about which perspectives should be included within the scope of the related disciplines that have as their focus the Ancient Mediterranean.41 I do believe that collaborative tools such as PlayCanvas can be part of both encouraging creative thinking on that issue and communicating the results of that thinking. Playification is a useful approach and the study of the Ancient Mediterranean can be as open-ended as these tools."
}