{
  "articleId": "isaw_paper4",
  "text": "ARTICLE_ID: isaw_paper4\nThe Antikythera Mechanism is a fragmentarily preserved Hellenistic astronomical machine with bronze gearwheels, made about the second century In 2005, new data were gathered leading to considerably enhanced knowledge of its functions and the inscriptions on its exterior.However, much of the front of the instrument has remained uncertain due to loss of evidence.We report progress in reading a passage of one inscription that appears to describe the front of the Mechanism as a representation of a Greek geocentric cosmology, portraying the stars, Sun, Moon, and all five planets known in antiquity. Complementing this, we propose a new mechanical reconstruction of planetary gearwork in the Mechanism, incorporating an economical design closely analogous to the previously identified lunar anomaly mechanism, and accounting for much unresolved physical evidence.Subjects: Antikythera mechanism (Ancient calculator), Astronomy, Greek.IntroductionEvidence & ModelsBuilding the New ModelAppendicesAcknowledgements & Author ContributionsReferences and Notes1. Introduction1.1.The Antikythera MechanismThe Antikythera Mechanism was on board a ship otherwise laden with fine bronze and marble sculpture and glassware, which sank within a few years after 70 BC off the island of Antikythera, between Crete and the Greek mainland.3 The shipwreck site was discovered by Symiote sponge divers in 1900 and salvaged by them, under Greek government supervision, in 1900-1901.4 In 1902 fragments of the Mechanism were noticed among unsorted bronze pieces from the wreck at the National Archaeological Museum in Athens.5 2. The FragmentsWhen the remains of the Antikythera Mechanism were recovered from the sea, it is very likely that it was in one piece, and surely not more than two or three.There are now 82 separate fragments, all of which probably belonged to the original device.Seven of the largest fragments are labelled from A - G and the remaining smaller fragments from 1 u2013 75.The two sides of each fragment are designated -1 and -2. For example, A-1 is the familiar view of Fragment A with the four large spokes.This designation does not mean front and back, since there are many fragments whose orientation is not yet known.It is simply designed to distinguish the two sides of each fragment.#p4Fragment A is by far the largest fragment and contains twenty-seven of the surviving thirty gears.There is a single additional gear in each of Fragments B, C and The fragments are heavily calcified and corroded after nearly two thousand years under water. Much of the material of the fragments appears to consist of bronze corrosion products with very little free metal surviving.Despite two thousand years under water, many of the surfaces of the fragments are rich in detail, showing mechanical features as well as inscriptions, which cover some of the surfaces.The remains of about a dozen gears are visible on the surface and the rest have been identified through X-ray studies. 3. Scientific InvestigationsThere have been three major X-ray studies of the Antikythera Mechanism since the early 1970s.6 In addition, the National Archaeological Museum in Athens has undertaken X-ray studies of some individual fragments.Historically, many of the most important scientific developments have come from X-ray investigations.The most recent scientific data gathering was undertaken in 2005 by the Antikythera Mechanism Research Project (AMRP)u2014an informal collaboration of academics from the universities of Cardiff, Athens and Thessaloniki; staff at the National Archaeological Museum in Athens; and two high-technology companies, Hewlett-Packard (USA) and X-Tek Systems (UK) (now part of Nikon Metrology).#p6Two non-destructive investigatory techniques were used: Polynomial Texture Mapping (PTM) to enhance surface details of the fragments and Microfocus X-ray Computed Tomography (X-ray CT) to examine the interiors of the fragments at high resolution.7 PTM enables a sample to be interactively re-lit in software to enhance the surface. It has the ability to factor out confusions of colour and texture to reveal the essential form of the surface.This dramatically improves the interpretation of surface details. X-ray CT makes possible the reconstruction of high-resolution 3D X-ray volumes of the fragments. X-ray viewing software, VGStudio Max by Volume Graphics, enables slices to be viewed at different angles through the sample. We have found that this is the most useful tool of analysis.In this way, the data in a single plane can be isolated, examined and measured.The software also enables the brightness and contrast to be adjusted.Both PTM and X-ray CT have proved invaluable in studying the Antikythera Mechanism.Though the X-ray CT was initially designed to probe the mechanical structure of the Mechanism, it has also enabled the reading of inscriptions inside the fragments, which are not visible on 2D X-rays. All 82 fragments were subjected to both techniques.Subsequent scientific analysis resulted in a new interpretation of the gears and their functions as well as a marked increase in the number of inscriptions that have been readu2014many discovered using X-ray CT.8 In recent years, the new data and scientific results have created considerable international research activity focused on the Antikythera Mechanism. 4. The Functions of the Antikythera Mechanism1.4.1.External ArchitectureThe Antikythera Mechanism was contained in a wooden box, which had bronze Front and Back Covers. A small portion of the wooden box, as well as a wooden sub-frame, survive in Fragments A, F and 14.9 We infer the existence of a wooden sub-frame from our own observations of the X-ray CT data.It appears to have encased all the gears, while the outer box carried the front and back plates. The evidence for the Front Cover is from Fragment G and a number of other small fragments.These establish that the Front Cover had inscriptions facing outwards.The Front Cover may have covered the whole of the front or just the central dialu2014the evidence appears to be insufficient to settle this issue.The Back Cover appears to have covered the whole of the back dials and to have been fixed to the Mechanism with sliding catches, since our observations of the X-ray CT of Fragment F establish that there was a sliding catch in the bottom right-hand corner of the Back Cover. Evidence for the Back Cover can be found in Fragments A, B, E, F and 19.The Back Cover had inscriptions on its inside face and none that we can find on its outside face.#p8The front plate was divided into three sections. A central dial system displayed outputs from the Mechanism on a Zodiac Dial, marked with 360u00ba scale divisions and a Calendar Dial, marked with 365 days.The Calendar Dial was designed to be moveable, so that the Mechanism could accommodate the fact that four Egyptian calendar years fall short of four 365.25 day solar years by one day.10 Above and below the dials, were plates covered in inscriptions in the form of a Parapegma (star calendar).11 At the right-hand side of the Mechanism there was an input, and we assume that this was turned by hand with some sort of handle or crank, though only the keyway for the input remains. Beneath the removable Back Cover, there were two major dial systems (top and bottom) in the form of spirals, divided into lunar months, with subsidiary dials inside them.12 The top dial showed a 19-year Metonic calendar, divided into 235 lunar months.13 Inside this dial was a subsidiary dial, showing the 4-year panhellenic games cycle and (conjecturally) a dial showing the 76-year Callippic cycle.14 The bottom dial showed a 223-month eclipse prediction dial, based on the Saros cycle.15 This dial included glyphs that indicated information about the predicted eclipse possibilities, including time of the eclipse.16 Inside this dial was a subsidiary Exeligmos Dial, designed to adjust the eclipse times for successive turns of the Saros Dial.17#p9The Antikythera Mechanism is an astronomical calculating machine that predicted phenomena involving the Sun, Moon, stars and probably the planetsu2014the latter being the focus of considerable debate and the subject of much of this current study. Our conclusion in this study is that the Antikythera Mechanism almost certainly calculated the motions of all five planets known in ancient times. 5.The Cosmos in the Antikythera MechanismImproved readings of an inscription that was on the Mechanism's back cover and that described its external features and displays leave little room for doubt that the front display incorporated revolving pointers bearing little spheres to represent all five planets known in antiquity making their apparent motions around the Earth.18#p11An outermost sphere of the fixed stars, represented visually by symbols for the twelve zodiacal signs, encloses spherical shells for the five planets, Sun, and Moon, with the terrestrial globe at the centre. Each sphere is said to move through a circle belonging to the planet, strongly suggesting that a certain feature of the front display that the inscription calls the cosmos was in fact the entire front dial, portraying in cross-section the Aristotelian conception of the universe as a system of nested geocentric spherical shells.Meaning of the Cosmos, this is part of the Back Cover Inscription as seen in an X-ray CT slice of Fragment No specific explanation has been given previously for the presence of this word here. 1.6. Overview of the New Model One of the key questions that arises from the Cosmos theory about the front face of the Mechanism is whether mechanisms for all five planets can realistically be included, using similar design and mechanical principles to those found in the surviving gear trains.The first person to interpret the Mechanism's fragments as the remains of a planetarium and to propose that it displayed the five planets known in antiquity as well as the Sun and Moon was the classicist Albert Rehm, though his prescient research notes, written in 1905-1906, were never published.19 His idea was that the five turns of the dial in Fragment B, which we now call the Upper Back Dial, represe ted the five planets. This idea could only make sense prior to 2004, when Wright established that the dial does not consist of concentric rings, but is in fact a spiral.There is now ample evidence that this dial was a 19-year Metonic calendar and had nothing to do with planets.20 In 2002, Wright showed through a working physical reconstruction of the Mechanism that it was possible to include all the planets at its front, though, in our view, at the expense of avoidable complication and insufficient correlation with the evidence from the fragments.21 This modelu2014with its eight coaxial pointers at the front of the Mechanismu2014was a remarkable view of the possible capabilities of ancient Greek technology. It was an exercise in showing what might have been possible: essentially a demonstration of principle.We discuss this model in more detail in 3.5.This present study aims to show how all five planets can be included in the Antikythera Mechanism in a way that conforms to the observed data and explains several puzzling pieces of evidence that have been previously unresolved.The solution is economical and elegant and is in complete harmony with the design virtuosity that has already been uncovered in the existing gear trains. Despite the lack of physical evidence in the form of surviving gears, we believe that the close match of our model with other physical evidence as well as its intimate conceptual association with the known gear trains create a compelling case that this was in essence the way that the Mechanism was originally constructed.The inferior planets are those whose orbits are inside the Earths orbitu2014namely Mercury and Venus. The superior planets have orbits outside the Earths.Those known in ancient times were Mars, Jupiter and Saturn.All the planets appear from the Earth to orbit nonuniformly, with a periodic alternation of prograde and retrograde motion.Ancient Greek models of planetary motion prior to Ptolemy were based on the idea that these anomalistic motions could, at least in first approximation, be modelled using a combination of two circular motionsu2014the so-called deferent-and-epicycle and eccentre models.22 This theory apparently originated in the early second century BC with Apollonios of Perga and his contemporaries, though an earlier date cannot be ruled out.23 Using these ideas, the motions of the inferior planets can be mechanized fairly easily with just two gearsu2014a fixed gear on the central axis and an epicyclic gear that engages with this fixed gearu2014combined with a pin and slotted follower.24 The superior planets have proved more difficult to model in a way that fits the mechanical constraints of the Mechanisms design. Our reconstruction proposes mechanisms for the superior planets based on the known mechanization of the lunar anomaly at the back of the Antikythera Mechanism.Surprisingly, these models look exactly the same as the lunar anomaly mechanism.They have just four gears, including an epicyclic gear with a pin on its face and a second epicyclic gear, which rotates on an eccentric epicyclic axis and has a slot in its face that engages with the pin. They provide an elegant solution to the long-standing problem of how the superior planets might have been shown in the Antikythera Mechanism.It is noteworthy that similar mechanisms can serve both to model the lunar anomaly and the synodic phases of the planets.Though the physical evidence is sparse due to the great loss of material in the fragments, our new model explains the existence of bearings and fittings on the Main Drive Wheel, b1, as well as the mysterious pillars attached to its circumference.25 The model also accounts for the dimensions of the pillars. All of our planetary mechanisms are contained in the space in front of b1 that is defined by the support pillarsu2014a circumstance that could also help explain how all the planetary gearing could have fallen out before the Mechanism's rediscovery.It is surprising that all these mechanisms can be crammed into the relatively small space in front of b1.Price proposed this nearly forty years ago, without any details as to how it might be accomplished.26 Alternatively there is a possibility that this space... may have held a gearing system, now totally vanished, which served to exhibit the rotations of all of the planets other than the Sun and Moon. If such gearing was to be part of the device it would be most appropriate at this place where annual and monthly rotations were available just under the front dial plate.It is not clear to us why the monthly rotation might be relevant to the planets, but the rest of this idea is preserved in our model.Our model also retains the simplicity in the outward design of the Mechanism as a rectangular box that Price proposed. As previously mentioned, Wright has demonstrated the feasibility of including all five planets in the Antikythera Mechanism using essentially the same technology and engineering that we see in the surviving fragments.We discuss this important model later in 3.5.In Wright's model, the solar anomaly was mechanized as well.In the light of the subsequent discovery of the mechanization of the lunar anomaly in the Antikythera Mechanism, we believe that it was very likely that the solar anomaly was also included. A recent careful study has demonstrated that the graduation of at least one of the two extant front dial rings, the Egyptian calendar ring and the zodiac ring, had a small apparently systematic nonuniformity, which can be explained as a deliberate nonuniform spacing of the degrees on the zodiac ring so that a uniformly revolving mean Sun pointer would simultaneously indicate both the true Sun's longitude and the Egyptian calendar date.27 On this hypothesis, the motion of pointers representing the motions of the Moon and planets would incorporate a solar anomaly component (a not inconceivable notion, though contrary to known ancient theories) unless the pointers revolved around an eccentric axis. An alternative planetary display also explored in that study hypothesizes that there were no pointers for the planets revolving around the zodiac dial, but instead a system of five subsidiary dials with uniformly revolving pointers indicating the planets' synodic cycles.We believe that the inscriptional evidence examined below rules out such subsidiary dials.Moreover, the division of circles into ostensibly equal arcs elsewhere in the Mechanism is sometimes evidently nonuniform, for example in the spacing of teeth on gears,28 the holes for mounting the Egyptian calendar dial,29 and the divisions of the Saros eclipse dial, as we have confirmed from observations of the X-ray CT data. Hence we are not convinced that the Mechanism's designer intentionally represented solar anomaly through nonuniform graduation of the zodiac ring instead of by epicyclic gearwork and we have reconstructed all the pointers as radiating from the central axis.Computer model generated in the 3D animation software, Newtek Lightwave.The central dials display Sun, Moon and all five planets, with graduated rings for the zodiac and the Egyptian calendar months. Above and below these dials are the Parapegma inscriptions, listing dates of appearances and disappearances of the stars.The form of this display is conjectural, based on the Back Cover Inscription.The Back Cover Inscription indicates that the Sun, Moon and planets were almost certainly represented at the front of the Antikythera Mechanism using little spheres (as mentioned in the Back Cover Inscription, 2.3.2) in a geocentric picture of the heavenly bodies. There are mechanical difficulties in creating this image of the planets, since the lunar phase mechanism requires that the solar output is adjacent to the lunar output in the coaxial output system.30 This is because the lunar phase mechanism acts as a differential system to calculate the Moons phases from the difference between the lunar and solar rotations.The lunar phase mechanism must therefore have access to the solar rotation. The lunar output is carried by a central axle from the back of the Mechanism and the Sun must therefore be the first tube in the coaxial system.This would naturally place the Sun next to the Moon in the output display, leaving no room for Mercury and Venus between Moon and Sun.However, there is a way round this problem.Our conjectural solution is to retain the pointer system and to mark the pointers with little spheres at different distances along the pointers to indicate their orbits. The solar pointer is marked by a little golden sphere (as mentioned in the Back Cover Inscription, 2.3.2) and the planetary pointers with appropriately coloured spheres for the planets.These spheres are placed at distances, which represent their geocentric orbits in the prevailing ancient Greek order of proximity to the Earth: Moon, Mercury, Venus, Sun, Mars, Jupiter, and Saturn.In this way the Cosmos idea is preserved, whilst the lunar phase mechanism has access to the Sun rotation. Rehm's idea to display the planets on concentric rings would not work for exactly this reason.In a coaxial system with outputs as rings, the order of the rings must follow the order of nesting of the coaxial outputsu2014so the Sun would have to be adjacent to the Moon, which would contradict the standard order of the bodies in the Aristotelian cosmology.The idea of small marker spheres on pointers circumvents this problem. In our Cosmos proposal for the front of the Antikythera Mechanism the stars are represented in a more conceptual manner by the fixed graduated dial inscribed with the names of the zodiacal signs and with key letters referring to the list of dates of first and last risings and settings of constellations in the Parapegma Inscription above and below the central dials.Visual representations of the ancient geocentric cosmology in medieval and Renaissance manuscripts and art commonly use the zodiac in this way to stand for the sphere of fixed stars. 2. Evidence & Models 2.1.Introduction None of the gears for additional planetary mechanisms have survived (though there has been some debate as to whether the unassigned gear in Fragment D might have been part of this systemu2014see 3.6.1).We must therefore be cautious about making claims for our proposed model.However, a body of indirect evidence not only suggests that these mechanisms existed, but also supports the idea that they might have had the structure proposed here. This evidence is in the form of testimony about similar mechanisms from the classical literature, inscriptions about the planets on the Front and Back Covers, and surviving physical evidence from Fragment 2.2 Astronomical Mechanisms in Classical Literature Allusions to mechanical representations of astronomical phenomena turn up intermittently in ancient Greek and Latin literature; unfortunately most are vague and do not reflect first-hand experience of such devices.31 An important exception is Cicero, who refers in his De Natura Deorum 2.34-35 (87-88) to a mechanism constructed by u2013 or perhaps more plausible to say at the commission of u2013 his philosophical teacher Posidonios in Rhodes, probably in the 80s or 70s BC. Cicero does not say explicitly that he had seen Posidonios' device, but it is likely enough that he had, and in the worst case his direct connection with Posidonios renders it unlikely that his information is inaccurate.All that he tells us, however, is that Posidonios' mechanism translated a single rotary input into a display of the diverse motions of the Sun, Moon, and five planets.The description of the mechanism forms part of an a fortiori philosophical argument for the existence of a divine designer of the cosmos: the claim is that the complexity of the mechanism's displays, though far inferior to that of the real heavens, would suffice to convince any viewer that it had been constructed by an intelligent mind. In this context, any explanation of the concealed mechanical workings of Posidonios' mechanism would have detracted from the analogy he is drawing between it and the cosmos.In two other works, the Tusculan Disputations 1.63 and De Re Publica 1.14 (21-22), Cicero makes similar claims (for the sake of the same argument from design) concerning a mechanical sphaera constructed by Archimedes in the late third century BC. In the latter work, a dialogue whose dramatic date is 129 BC, one of the interlocutors asserts that he remembers having seen Archimedes' sphaera back in 166 BC; it was made of bronze and it showed the Earth, Moon, and Sun in the correct configurations at the appropriate stages of the lunar month for solar and lunar eclipsesu2014though we are not told whether it actually predicted which conjunctions and oppositions could have eclipses. In any case, Cicero is not likely to have himself seen Archimedes' sphaera, and he may be attributing to it the characteristics of Posidonios' mechanism.We thus consider Cicero to be a credible witness that mechanisms simultaneously displaying the revolutions of all five planets as well as the Sun and Moon existed in the early first century BC, but we are wary of relying on his testimony to backdate such mechanisms to Archimedes in the third century BC. In the second half of the second century AD, the Alexandrian astronomer Ptolemy wrote a technical description of his planetary theories, the Planetary Hypotheses, partly with a view to providing the basis for mechanical representations of the theories.32 Whether anyone in antiquity, or even Ptolemy himself, attempted to construct mechanisms closely following the complex specifications in this work may be doubted. But Ptolemy must be referring to devices that actually existed in his time when he speaks disparagingly of the customary manner of sphairopoiein (literally sphere-making), that is, making mechanical simulations of the heavens, which he says displayed the apparent rather than the true motions of the heavenly bodies.This probably means that the mechanisms that he knew made visible the changing apparent speeds and directions of the Sun, Moon, and planets but not the combinations of uniform circular motions that were supposed to be the causes of the apparent motions. No ancient account of an astronomical mechanism speaks of graduated dials or schematic display of calendrical or chronological data, and none identifies the means of its operation. 2.3.Inscriptions on the Antikythera Mechanism Inscriptions in ancient Greek have been found in many of the fragments of the Antikythera Mechanism.Practically all of them were originally on or around the dials on the exterior of the Mechanism itself, or on the detachable cover plates (the exceptions are letters or numerals on a few interior components, which likely served the mechanician to identify parts). The shorter inscriptions on the dials consist of single words, numerals, and symbols, and give information necessary for the reading of information off the dials, for example the year numbers and month names on the spiral Metonic calendar dial.The longer inscriptions, none of which survives in its entirety, were generally expressed in complete sentences, and provided detailed information about the Mechanism and the astronomical phenomena that it displayed, probably intended for the benefit of the operator and spectators of the Mechanism in action. The inscriptions are engraved in skilfully executed serifed capital letters very similar to the lettering of inscriptions on stone from the last three centuries BC.The letter forms are most characteristic of the second half of the 2nd century BC,33 though a dating as early as the end of the third century or as late as the middle of the first cannot be excluded.Even by the standards of this period, when stone inscriptions with letter height about 5 mm were not uncommon, the lettering on the Mechanism is tiny, with the letter height ranging from about 2.7 mm in the parapegma inscription down to about 1.2 mm (i.e. smaller than modern 4 point type) in the inscriptions on the back spiral dials. The layout is stypical of contemporary stone inscriptions, with no space between words (but occasionally a bit of space before and after numerals and at the start of new sections of text) and no punctuation.At the ends of lines, words that are too long to be completed on one line are divided syllabically according to the standard rules for ancient Greek.Errors in the inscriptions are rare; it is likely that the text was first painted on the bronze plates as a guide to the inscriber, though of course no trace of such preparation survives. The text is in the standard koinu00ea Greek of the time, with no characteristics of local dialects except for the Doric features of the Corinthian month names on the calendar dial.34 The inscriptions that have some relevance for the reconstruction of the Mechanism's front dial include those inscribed on the fixed graduated ring that, together with the movable Egyptian calendar ring, constituted the periphery of the dial, and the extended texts inscribed on the so-called front and back cover plates (see 2.4.2). The surviving portion of the fixed graduated ring is divided by radial lines into sectors of approximately 30u00b0, which each comprise thirty approximately equal subdivisions marked by shorter radial marks.35 The surviving sections are labelled with the Greek names of signs of the zodiac in order running clockwise: Virgo (Parthenos), Libra (Chu00ealai), Scorpio (Skorpios), Sagittarius (Toxotu00eas).This shows that the dial displayed celestial longitude, the principal coordinate of the apparent motion of the Sun, Moon, and planets through the zodiac. (Greek astronomy took over from Babylonian astronomy the convention of dividing the zodiac into twelve equal signs comprising thirty degrees and only approximately coinciding with the constellations for which they were named.) The zodiac ring also has alphabetic letters inscribed next to certain of the degree markers, which keyed to a so-called Parapegma inscription listing first and last visibilities of bright stars and constellations that were supposed to occur annually when the Sun was at the degrees in question. This fact shows that the dial must have had a pointer indicating the Sun's longitude.The inscription on the front cover plate (chiefly surviving on Fragment G) is extensive but badly preserved, and as yet its contents are only partially understood. A provisional transcription, greatly augmenting the one provided by Price, was published in 2006.36 Despite uncertainties of reading and interpretation, it is clear that this text contained lists of intervals in days separating events in the synodic cycles of phenomena of heavenly bodies. References to stationary points (stu00earigmos), i.e. dates when a heavenly body reverses the direction of its longitudinal motion, show that the text concerned planets, since the Sun and Moon exhibit only prograde motion.The term greatest elongation (megiston apostu00eama) also occurs, meaning a date when a body's distance in longitude from the Sun reaches a maximum to either the east or the west; this phenomenon is only applicable to the apparent motion of Mercury and Venus. One of the Greek names for Venus, Aphroditu00ea, was tentatively read in 2006.37 No direct reference to the Mechanism has been identified, though the inclusion of planetary synodic phenomena in an inscription accompanying the Mechanism only makes sense if the Mechanism somehow displayed nonuniform planetary motions or cycles of synodic phenomena. 2.3.1.The Back Cover Inscription Small parts of the inscription of the back cover plate are preserved on isolated surviving pieces of this plate (most of which has been lost), in Fragments 19, B, and E; much more of it exists in the form of offsets, that is, mirror-reversed impressions on a layer of material composed of sedimentary accretions mixed with corrosion products from the Mechanism's bronze, preserved on Fragments B, E, and The mirror writing on Fragments A and B was noticed, and a few letters were transcribed and their significance hotly debated, at the time that the main fragments of the Mechanism were discovered in the National Archaeological Museum in 1902.38 Fragment 19, which had been attached to A with its inscribed side concealed, was detached and its text published in 1905;39 it was ultimately to prove of great value for the reconstruction of the lunar gearwork and the back displays of the Mechanism. The transcriptions published by Price in 1974 gave what was legible on the exposed surfaces of Fragments A, B, and 19;40 Fragment E was rediscovered in 1976, just too late for that publication.41 The most recent transcription, published in 2006, drew on all the relevant fragments including text visible only through CT, and marked a substantial advance with respect to both the extent and the accuracy of the readings.42 Research since 2006 based on CT and PTM data has resulted in further improvements of detail as well as a fuller understanding of the structure and purpose of this inscription. Fragment B bears legible offsets of parts of 28 consecutive lines of text, with slight traces of another line at the top.The left margin of the text, which was apparently very close to the edge of the inscribed plate, is partly preserved.Fragments E, A, and 19 have remains of a further 25 lines, which were immediately below those on Fragment B, with no preserved margin.The average line spacing is about 3.6 mm, with letter height about 2.0 mm for letters of normal height and interlinear space about 1.6 mm; a few letters, such as u03a6, are taller, while u039f is usually shorter. The widths of different letters vary.The average letter width in the better-preserved lines 15-23 on Fragment B, over stretches of between 19 and 31 letters (legible or restored with certitude), is about 2.3 mm/letter, but the average width in an individual line can be as much as ten or fifteen percent greater or less than this.The tersest plausible restorations we have been able to devise for the lost text in lines 16, 22, and 23 require lines of 75-84 letters, consistent with a line width about 170 mm. Since the width of the Mechanism is estimated to have been 184 mm, there cannot have been much wasted space on the plate.The fact that the offsets on Fragment B show the edge of the plate more than 20 mm to the left of the right edge of the fragment indicates that the plate, or at least a piece of it, had become displaced during the time that the Mechanism was under the sea.Although less than half survives of even the best preserved lines, this is enough to reveal the inscription's content and structure. It was an item-by-item inventory and description of the external features and displays of the Mechanism, dealing first with the front face, then in turn with the upper half and the lower half of the back face.The switch from describing the front to describing the back appears to coincide with the break between the part of the text on Fragment B and the part on the other fragments.Components, chiefly dials and pointers, are described according to their location, appearance, and meaning, but no explicit instructions for the use of the Mechanism seem to have been provided, such as would be marked for example by verbs in the imperative mood. The surviving text also makes little reference to the internal mechanism.The vocabulary does not seem to have included any specialized astronomical terminology that would have been unfamiliar to a lay reader, but there are several instances of technical vocabulary from mechanics.43 2.3.2.The Planets and the Cosmos in the Back Cover Inscription.We offer here a new transcription and translation of a series of eleven comparatively well preserved lines belonging to the portion of the inscription on Fragment B describing the front dial. The transcription follows the Leiden conventions for presenting ancient Greek and Latin inscriptions.Square brackets enclose lost letters, and the open square bracket at or near the end of each line marks the end of the preserved text.Angle brackets enclose letters omitted in error by the engraver.Dots under letters indicate that they are not identifiable with certitude from the visible traces, although most are beyond doubt from their context; sublinear dots without letters represent visible traces that cannot be identified. Names for the planets are highlighted in red. 15little pointer projecting from itu2026 rings, the adjacent belt?u2026 Stilbu00f4n?, and the [little sphere] moving through itu2026 Phu00f4sphoros, the star of Aphroditeu2026 ring of Phu00f4sphorosu2026 20pointer lies a golden little sphereu2026ray of the Sun.And above the Sun is a circleu2026 Pyroeis, the star of Ares, and the [little sphere] travelling throughu2026 Phaethu00f4n, the star [of Zeus], and the [little sphere] travelling throughu2026circle of Phainu00f4n, [the star of Kronos], and the little sphere25u2026 Alongside the Cosmos liesu2026Lines 12-28 of the offsets adhering to Fragment B, in a mirror-reversed composite image combining parts of several layers of CT. Key phrases are highlighted in red in the bottom inscription.Before discussing this passage in detail, we draw attention to the presence of key terms for our argument: the names of planets, and the word Cosmos.Aphroditu00ea, one of the names of the planet Venus, in line 18, and the word kosmos in line 25 were fully read in the 2006 transcription, whereas the other planet names were not recognized.The planets are denoted by twofold names, as was common in Greek astronomical and astrological texts, reflecting two different systems: so-called theophoric names associating a planet with a deity, and names descriptive of the visual appearance of the planet. The complete systems of names are as follows:Modern nametDescriptive nametTheophoric name MercurytStilbu00f4n (glittering)tstar of Hermes VenustPhu00f4sphoros (light-bringing)tstar of Aphrodite MarstPyroeis (fiery)tstar of Ares JupitertPhaethu00f4n (radiant)tstar of Zeus SaturntPhainu00f4n (shining)tstar of Kronos In the inscription, both kinds of name are preserved for Venus and Mars, while the (partly) preserved descriptive names of Jupiter and Saturn were probably preceded too by their theophoric names. Line 17 begins with the final letters of a word, -tos, which is likely to be the end of the descriptive name of Mercury in the genitive case, Stilbontos.There would not have been sufficient space in the lost parts of lines 18-24 for inclusion of Mercury.The order in which the planets appear is not random.We have the sequence Venus, Sun, Mars, Jupiter, Saturn.Mercury, as pointed out above, is likely to have come before Venus, and, although the word selu00eanu00ea (Moon) is not found in the very fragmentarily preserved lines preceding line 15, there are good reasons for believing that the Moon, with its elaborate display incorporating a revolving half-black, half-white ball to show the Moon's phases,44 was referred to in those lines. Thus we have the most common ordering of the seven heavenly bodies in ancient Greek astronomical texts, reflecting their presumed distances from the Earth, from the nearest body (the Moon) to the furthest (Saturn), beyond which are the fixed stars.This order was based partly on observable facts, in particular that the Moon can eclipse the Sun and can occasionally occult planets and stars, and partly on the assumption that the longer a planet takes to make a circuit of the zodiac, the further it must be from the Earth. In making sense of a fragmentary inscription of this character, a fruitful strategy is to look for parallel passages that appear to be repeating similar words or ideas, for example the repeated references here to pointers, circles, and movements characterized as moving through, revolving, and travelling through.This is clearly the description of a system of pointers bearing little spherical or circular emblems on them to represent the heavenly bodies, revolving around a dial or dials. The first pointer mentioned, in line 15, belonged (as we hypothesize) to the Moon.For each of the planets, the text appears to have spoken of a circle having a stated positional relation to the previously mentioned body, and a little sphere that moved or revolved through this circle.The space available for the lost portions of the lines is just great enough for this information to fit, along with a one-word characterization of the little sphere; there is little freedom to restore the lines in any other consistent way. For example, line 22, if conjecturally completed as follows, is just within the plausible letter-count range: [2-3 lett. u03c4u03bf]u1fe6 u1f0cu03c1u03b5u03c9u0323u03f2 u03a0u03c5u03c1u03ccu03b5u03bdu03c4u03bfu03f2, u03c4u1f78 u03b4u1f72 u03b4u0323u03b9u03b1u03c0u03bfu03c1u03b5[u03c5u03ccu03bcu03b5u03bdu03bfu03bd u03b1u1f50u03c4u03bfu1fe6 u03f2u03c6u03b1u03b9u03c1u03afu03bfu03bd u03c0u03c5u03c1u03c1u03ccu03bd. u1f51u03c0u1f72u03c1 u03b4u1f72 u03a0u03c5u03c1u03ccu03b5u03bdu03c4u03ac u1f10u03f2u03c4u03b9u03bd u03bau03cdu03bau03bbu03bfu03f2 u03c4u03bfu1fe6] Pyroeis, the star of Ares, and the [little sphere] travelling through [it is fiery-red.Above Pyroeis is a circle belonging to] In 1.6 we have alluded to a recent conjecture for the arrangement of the Mechanism's front displays, according to which each planet had a separate small dial with a uniformly revolving pointer showing the current stage of the planet's synodic cycle rather than a nonuniformly moving pointer showing its longitude.45 One might be tempted to see the circles of the inscription as a reference to such subsidiary dials; but then it would be difficult to make sense of the order in which the heavenly bodies are discussed, with Mercury and Venus coming between the Moon and Sun, although the pointers for the Sun and Moon were certainly using the same dial. The order is clearly based on the presumed geocentric distances.Thus we infer that the circles were concentric rings inscribed or imagined within the dial, representing the spherical etherial shells that contained the visible heavenly bodies according to the ancient Greek so-called Aristotelian cosmology.Each pointer, radiating from the centre of the zodiacal dial, as in Wright's reconstruction,46 would have had its little spherical marker representing the planet at a different distance from the common axis, so that the sphere would appear to be in the appropriate shell. Thus when the text speaks of Mars's circle being above the Sun in line 21, it means further out from the centre rather than towards the top of the Mechanism.We further believe that the description of each little sphere is most likely to have been a specification of its colour, by analogy with the surviving reference to the golden sphere, which in all probability described the Sun. A dial constructed in this manner would have elegantly combined two functions of the Mechanism: as an analogue computer, permitting quantitative read-off of the longitudinal positions and motions of the heavenly bodies, and as an educational wonder-working device, portraying the cosmos and its constituent parts in their hierarchical structure and intricate movements. The entire complex of dial and pointers on the Mechanism's front thus could by metonymy be itself called the cosmos, and we are convinced that this is what the word kosmos in line 25 referred to.Though kosmos had a range of possible meanings outside of scientific contexts, in Hellenistic astronomy it always meant either the aggregate of the heavens and the Earth or the heavens as distinct from the Earth (as in the expression, daily revolution of the kosmos). The nested sphere cosmology had wide acceptance in Greek science from the fourth century BC on, and it was one of the parts of astronomy that an educated layman could be expected to know; it figures, for example, in the first chapter of Geminos' Introduction to the Phenomena, a popularization of astronomy from the first century BC.47 Although no pictorial representations of it survive from before late antiquity, diagrams showing the cosmos in cross section as a series of concentric circular rings surrounding a circular Earth frequently occur in medieval manuscripts and even in Renaissance paintings (Fig. 2). The outermost sphere of the fixed stars is very often represented in these pictures as a ring containing the names, symbols, or pictures of the twelve zodiacal signs, just as we find in the Antikythera Mechanism. 2.4.Mechanical Features of Fragments 2.4.1.Internal Architecture All the following remarks are founded on close observation of the scientific evidence and extrapolation from this evidence. Because of the great loss of material, much of the reconstruction of the planetary mechanisms can only be conjectural, but we believe that our proposed model is well-founded because it complies closely with the surviving evidence, both in its conception and its mechanical realization.Gears in black are those for which there is evidence in the fragments.Gears in red are conjectured in order to make the model work. Our reconstruction of planetary mechanisms is in the space in front of b1, labelled Lost Epicyclic Gearing.When the input of the Antikythera Mechanism is turned, a complex gearing system calculates each of the outputs, which are displayed on the dials.The Mechanism is constructed from plates, dials, gears, bearings, arbors, pins, rivets, nails and sliding catches.There are no screws or nuts and bolts. The plates are parallel and are held in place by a wooden sub-frame and an external box.The gears are very closely packed together and it often appears that their faces are in contact with neighbouring gears.This is not modern engineering or horological practice and it may well have caused problems with friction.The larger gears run close to the plates and are supported by spacers, consisting of narrow curved strips of bronze under the perimeters of the gears.48 These appear to be designed to prevent the gears rocking on their axes. In addition, the Main Drive Wheel, b1, is constrained by four clips attached to the Main Plate, which hold the gear parallel to the Main Plate.49 Again, this arrangement would be unlikely in modern practice because of the additional friction involved.In order to overcome friction, it is likely that the surfaces of the gears were highly polished and well lubricated. 2.4.2.Engineering The device is very well made, without any evident mistakes. A number of prototypes of this particular model might have been made previously in order to get all the parameters and measurements correct, since the machine is very complex. For the mechanism to have worked, it must have been made to very close tolerances: in some parts it appears to have been constructed to accuracies of a few tenths of a millimetre.It is evidently the product of a sophisticated and mature engineering tradition and must surely have been preceded by a long history of development of similar devices.This is likely to have started with much simpler instruments before reaching the extraordinary complexity of the Antikythera Mechanism. It is surprisingly smallu2014presumably being designed for portability.The small size increases the engineering difficulties and previous instruments may have been made at a larger scale.The development of such sophisticated mechanisms is likely to have taken place over a considerable time-scaleu2014at least decades and possibly centuries.By the era of the Antikythera Mechanism, Greek mechanicians had reached a remarkable level of fluency in the use of gear trains to make complex calculations, using highly advanced techniques such as epicyclic gears and pin-and-slot devices to model variable motion The Mechanism would have been very difficult to make without an array of toolsu2014including files, hammers, pliers, dividers, rulers, drills and lathesu2014some of which we associate with later engineering traditions. The unevenness of some of the divisions of some of the gear teeth suggests that a dividing engine was not used for the gears and that they were hand-cut with a file.50 The surviving features of the Antikythera Mechanism, particularly the lunar anomaly mechanism, support the idea that our proposed planetary mechanisms were within the engineering capacity of the makers of the Antikythera Mechanismu2014but only just. Many aspects of the design of the Antikythera Mechanism suggest that it was essentially a mathematicians instrument.The design has a purity of conception and an economy that is based on arithmetic cycles and the geometric theories current in the astronomy of its time.These theories had not yet attained the sophistication of Ptolemy's models, which enabled prediction of apparent positions of most of the planets to an accuracy on the order of magnitude of a degree. Though the engineering was remarkable for its era, recent research indicates that its design conception exceeded the engineering precision of its manufacture by a wide marginu2014with considerable accumulative inaccuracies in the gear trains, which would have cancelled out many of the subtle anomalies built into its design.51 The output of the lunar anomaly mechanism is a notable example of this.In the Antikythera Mechanism, the thickness of the gears varies between 1.0 mm and 2.7 mm. As might be expected, the largest gears and the gears which take most mechanical stress tend to be thicker, with b1 at 2.7 mm, b2 at 2.3 mm and m1 at 2.0 mm.The rest of the gears range from 1.0 to 1.8 mm, with an average thickness of 1.3 mm.The mean module (pitch diameter of the gear in mm/tooth count) is 0.47.Fig. 7 X-ray CT showing cross-section of gearing in Fragment u00a92005 Antikythera Mechanism Research Project. All rights reserved. (A) The gears are hard to identify in cross-section. (B) The gears are identified in the same colours as Fig. 6.In cross-section, the features of the Antikythera Mechanism are difficult to understand.In many parts, the gears are very tightly packed in contiguous layers with little or no air gap between the faces of the gears.In the part of the cross-section of the Mechanism shown here, five layers of gears from e1 to e6 are packed into a distance of about 7 mm. (It is not six layers since e4 shares a layer with e5 and k1.) So the front-to-back gear spacings appear to be about 1.4 mm per gearu2014though we must be careful not to exclude the possibility that these dimensions have changed during the shipwreck or while the Mechanism was submerged for nearly 2,000 years. For our model of the superior planetary mechanisms, we have assumed a gear spacing of 1.5 mm per gearu2014so this is within the parameters suggested by the surviving layers of gears.Reconstructions of the extant gear trains and their functions have been published previously and the functions of twenty-nine of the surviving thirty gears are now generally agreed52u2014the sole exception being the gear in Fragment D (see 3.6.1). Of particular interest for the present study is the lunar anomaly mechanism. 2.4.3.Lunar anomaly mechanism The lunar anomaly mechanism is the most remarkable part of the surviving gearing.It has two input gear trains.The first calculates the mean sidereal rotation of the Moon as calculated from the Metonic cycle that 254 mean sidereal months are almost exactly the same as 19 years.The second input gear train calculates a rotation, which is the difference of the rotation of the sidereal Moon and the anomalistic Moonu2014in modern terms, this is the same as the rotation of the Line of Apsides of the Moon. This parameter can be calculated from a combination of the Metonic and Saros cycles as (9 x 53)/(19 x 223).53 Fig. 8 Diagram of the lunar anomaly mechanism (from Freeth et al. 2006, 590). u00a92005 Antikythera Mechanism Research Project.All rights reserved.The diagram is superimposed on a false-colour X-ray CT slice through Fragment Gears e5, e6, k1, k2 all have 50 teeth.Gear e5 turns at the rate of the mean sidereal Moon, as calculated by the Metonic cycleu2014in other words, 254/19 rotations per year. e5 meshes with k1, which is mounted epicyclically on e3. Gear k1 has a pin on its face that engages with a slot on k2.54 The gears turn on axes that are eccentric to each other by just over a millimetre.The result is that k2 turns with a variable motion.This variable motion is transmitted to e6 and thence to a pointer on the Zodiac Dial.55 The period of the variable motion is mediated by the epicyclic mounting of k1 and k2 on e3, which rotates at a rate that is the difference between the sidereal and anomalistic month rotations. The effect of this is to make the variability of the motion have the period of the anomalistic month.This means that the system models the ancient Greek deferent and epicycle model of lunar motion or the kinematically equivalent eccentre model (both of which were known in the mid 2nd century BC).It is difficult to understand how this superbly economical mechanical design was conceived.It is by no means the obvious way of modelling the deferent and epicycle theory of lunar motion. Fig. 9 Fragment A-2, showing the lunar anomaly mechanism. u00a92005 Antikythera Mechanism Research Project.All rights reserved.Part of its original support bridge can be seen to the right of the gears.The pin on gear k1 and the slot on k2 can just be seen in the lower left-hand corner.Mechanically, the gears in the lunar anomaly system appear to have little or no gaps between them.They were apparently held in place by a bridge, since part of this survives along with a pierced lug and pin for attachment to e3.56 It is this system that provides the essential modelu2014both mechanically and conceptuallyu2014for our proposed superior planet mechanisms. The large four-spoked wheel is the Main Drive Wheel and it turns on average at the rate of the mean Sun.On the spokes of the wheel and on its periphery are many mysterious features that look like the remnants of bearings, fittings and pillars.The physical evidence from the Main Drive Wheel suggests that a complex system was mounted on this wheel, as Price noted in a previous publication:57 This main drive wheel preserves clear evidence of some sort of superstructure mounted over it. The spoke in the ten o'clock position has a lug mounted on it 8.3 mm long, 3.9 mm wide and standing 6.3 mm above the surface of the wheel.The three other spokes contain holes indicating that they may also have had similar lugs on them and in addition there is a square depression on the spoke in the one o'clock position.Furthermore, on the rim, exactly midway between each of the spoke positions, there are traces of former fixtures. In the eleven o'clock position is a rectangular depression with a rivet hole at the center; in the eight o'clock position just the rivet hole remains, and the other two corresponding places are obscured by debris.The evidence seems to suggest that pillars rising from these four places on the rim and another four on the spokes supported some sort of plate above and parallel with that of the drive wheel, turning with it. Following Wright,58 we believe that the likely functions for this system were to calculate the variable motions of the Sun and the planets and to display their ecliptic longitudes on the Zodiac Dial.First we examine the physical evidence. 2.6.Fitments and bearings on the spokes of the Main Drive Wheel Fig. 11 PTM of Fragment A-1 using specular enhancement. u00a92005 Antikythera Mechanism Research Project. All rights reserved.This technique reveals the essential form of the surface and highlights the fittings on the spokes of the Main Drive Wheel, b1.In our examination of the evidence, features were identified using the photographs, PTMs and X-ray CT.Measurements were made using reference scales in the photographs and using Volume Graphics VGStudio Max software on the X-ray CT.This software includes very accurate measuring tools. We give our measurements to the nearest tenth of a millimetre.Due to corrosion, it is not always possible to be confident of measurements to this degree of accuracy.We estimate that most of our measurements are probably accurate to a few tenths of a millimetre.The reason that we give this rather imprecise overall estimation of errors for our measurements is that we do not believe that anything more precise is meaningful. The features that we are measuring in the fragments are invariably heavily corroded, they are often affected by heavy calcification and they are sometimes broken (and in places glued back together).So we do not believe that it is helpful to try to give more precise error estimations.Throughout this discussion, we make what we believe are plausible inferences about the functions of the features described. However, due to lack of evidence, it is not possible to be dogmatic about our reconstruction and we are open to other ideas about interpretation of the evidence.In addition, there are some features, which do not have a function in our model and whose purpose we do not understand.Despite these uncertainties, it is our view that the spokes of b1 are very likely to have carried gearing for the solar anomaly and the inferior planets. On b1, there are apparent bearings on some of the spokes as well as areas where there appears to have been attachments and a pierced lug.We refer to the spokes and features as being at the 1 oclock, 4 oclock, 7 oclock and 10 oclock positions.There is a depressed flattened area in the 1 oclock position of dimensions 19.0 mm x 15.5 mm (the full width of the spoke).Its edges are 22.1 mm and 41.1 mm from the central axis. It appears that there was some fitment attached here with a rivet and possibly also solder.In our model, we reconstruct a bearing here for the epicyclic gear of the Venus mechanism.In addition, there is a circular feature outside the flattened area, which might have been for a rivet.It might have provided some additional support for the bearing of the large Venus epicycle and carrier disk, but we have not used it in our proposed model. Fig. 13 Apparent bearing in the 4 oclock position. u00a92005 Antikythera Mechanism Research Project.All rights reserved.In the 4 oclock position, there is a prominent hole, which looks like the remains of a bearing.Its outer diameter is 9.7 mm and its inner diameter is 6.6 mm.It is 27.1 mm from the central axis.In our model, we reconstruct a bearing here for the epicyclic gear of the Mercury mechanism. Fig. 14 Apparent bearing in the 7 o'clock position. u00a92005 Antikythera Mechanism Research Project.All rights reserved. (A) Photo of bearing and flat area on the 7 oclock spoke. (B) Close-up photo of bearing. (C) X-ray CT slice of bearing and flat area on the 7 oclock spoke. (D) Close up of the bearing, showing a ring and a small hole drilled within the body of the spoke; (E) orthogonal section, showing the hole. In the 7 oclock position, there is another apparent bearing.This has a central hole of 4.3 mm in diameter, with an outside ring of 18.1 mm diameter.The central hole has a light streak across its diameter.On examination of this feature in the X-ray CT, it does not appear to have any mechanical significance.The outside ring is not visible from the front surface of the spoke, though it goes right through the rest of the spoke from 0.6 mm below the surface to the back of the spoke. It appears to be a bearing set into the spoke.Drilled from the outside of the ring, towards the outside of the wheel, is a small hole of length 4.1 mm and diameter 1.1 mm, which is not visible on the surface.It is possibly part of a lubrication system, though we advance this idea with some diffidence.This small hole is drilled accurately within the body of the spoke, where the only access for drilling would have been through the hole in which the ring is set. This must surely have been a difficult achievement for the technology of the time.In our model, we reconstruct the main feature on the 7 oclock spoke as a bearing for the middle epicyclic idler gear of the solar anomaly mechanism.M and X-ray CT slice.There is a raised flattened area on the spoke in the 7 oclock position, which is 17.8 mm long and 15.0 mm wide (the full width of the spoke).This starts at 38.2 mm from the centre and extends to the circumference ring. The X-ray CT suggests that it had a rivet near its centre.We reconstruct this as the place of attachment of a bearing for the second epicyclic gear in the solar anomaly mechanism.In addition to the rivet, the bearing may have been soldered to the spoke, though we have no direct evidence for this.The way that the spoke is dovetailed to the circumference ring is clear in the X-ray CT.In the 10 oclock position, there is a pierced lug. The dimensions, including the corrosion, are about 7.3 mm long, 2.2 mm wide and 5.7 mm high.Its inner core is a well-defined tapered block, with length 5.6 mm tapering to 5.1 mm; width 1.5 mm; and height 4.9 mm.It is difficult to be precise about its original dimensions because of the corrosion.The diameter of the hole is 1.4 mm.This lug does not feature in our model and we do not understand its function. 2.7 Pillars on the periphery of the Main Drive Wheel There are three pillars on the Main Drive Wheel (b1). One of these is bracketed to the periphery of the wheel and attached with rivets.The other two are simply attached directly to the wheel, with the bottom part of the pillar shaped to form an oval rivet.The surviving evidence shows one long support pillar and two short pillars.Their function has long been a subject of debate, but no satisfactory and detailed explanation has so far been offered.59 Yet they are a very striking feature of the Main Drive Wheel and demand a good explanation. They play a critical role in our proposed model, so we shall examine them in some detail.Fig. 17 Fragment A-1, showing the support pillars attached to b1. u00a92005 Antikythera Mechanism Research Project.All rights reserved.The two short and one long support pillars, near the input gear a1.From top to bottom, we shall call them pillar 1, 2 and 3.The pillars are all close to the input crown gear and one of them has in fact merged with this gear as a result of corrosion and calcification. We shall label them from top to bottom as pillar 1, pillar 2 and pillar 3.Pillar 1 is longer than the other two.Fig. 18 Pillar 1 on the Main Drive Wheel. u00a92005 Antikythera Mechanism Research Project.All rights reserved.Two orthogonal views of Pillar 1, as seen in X-ray CT. (A) The input crown gear can just be made out in the background. (B) The teeth of the input gear can be seen adjacent to the pillar. Measurements of the pillars were made in VGStudio Max.In general, measurements were taken relative to the front surface of the Main Drive Wheel.Precise measurement of the heights of the pillars is difficult.In the left-hand image, the height was measured at 27.7 mm, but this does not include the broken-off top of the pillar that is evident in the right-hand image.In this image, the main body of the pillar was measured as 25.2 mm and the broken-off portion as 3.5 mm. If these were simply joined together directly, this would make a total height of 28.7 mm.However, there may be some material missing here, since there is no evident join between the broken-off top and the main body of the pillar, though it is difficult to see in the X-ray CT.We estimate that the uncertainty is at least 5 mm and that the total height of the pillar was probably in the range 28.7 u2013 33.7 mm. For our model, we have adopted a measurement of 32.0 mm.Evidence from the other pillars shows that they had shoulders near the top and the top was pierced to accommodate a pin.In the right-hand image, it appears that the top of pillar 1 was also pierced.We have adopted a model for all the pillars, which includes a shoulder (at height 27.5mm for pillar 1) and a pierced end with a 1 mm diameter hole, intended for a fixing pin. The top of pillar 3 appears to have broken off.We shall assume that it originally had shoulders similar to those of pillar 2.The height of pillar 3 was measured at about 21.5 mm.Pillars 2 and 3 are both short pillars.Based on earlier less accurate measurements, for our model, we have adopted a total height of 20.5 mm with a height to the top of the shoulder of 16.2 mm.There is a discrepancy of a millimetre between these parameters and our current measurements, but this could be seasily accommodated in our model without in any way affecting the basic design. To summarize, we estimate that the height of this pillar is 20.5 mm u00b1 1 mmu2014the wide error range being caused by the fact that the top of the pillar is broken.In our reconstruction, there are six layers of gears between the Date Plate and the Superior Planet Plate and each gear has a thickness of 1.2 mm.So at the maximum estimated error of 1 mm each gear would have to be adjusted in thickness by 0.17 mm. This would mean that all the gears are still in line with the range of normal gear thicknesses found in the Mechanism of 1.0 to 1.8 mm.So the precise height of the surviving long pillar is not critical for our reconstruction. X-ray CT slices seen from the front of the Mechanism. (A) The crown input gear can be seen as well as cross-sections of all the surviving support pillars. (B) Places for four brackets for four long pillars can be faintly seen on the periphery of the wheel at 45u00b0 angles from the spokes. PTMs of the fixing points of the long support pillars. (C) Pillar 1. (D) fixing point 90u00b0 clockwise from Pillar 1. (E) fixing point 180u00b0 clockwise from Pillar 1. (F) fixing point 270u00b0 clockwise from Pillar 1. In addition to the surviving bracket and rivet for the long pillar on the circumference of b1, there are, as Price observed, traces of three additional brackets and rivets in symmetrical positions at 45u00b0 angles relative to the spokes of b1.Based on this evidence, we reconstruct four long support pillars, equally spaced round the circumference.From the evidence of the shoulders on the pillars and their pierced ends, it appears to be almost certain that they were designed to carry a circular plateu2014as Price suggestedu2014and that this plate was attached to the pillars with pins. 2.7.3. Short Pillars AFig. 22 Short pillar attachments on the Main Drive Wheel. u00a92005 Antikythera Mechanism Research Project.All rights reserved. (A) The Main Drive Wheel, showing the pillars on the right-hand side. (B) Front view of the two short pillars. (C) The symmetrically opposite position on the Main Drive Wheel. (D) The X-ray CT shows holes in these positions, which suggest that rivets might originally have been there. The short pillars are riveted directly to b1, rather than attached with brackets.In the symmetrical position on the opposite side of b1, possible rivet holes can be seen in the X-ray CT.In our model, we reconstruct four short pillars consisting of two pairs on opposite sides of the Main Drive Wheel.Why these pillars are offset from a symmetrical position relative to the spokes is not clear, though it may be designed so that their rivets avoid the dovetail joints, which attach the spokes to the rest of the wheel. Like the long pillars, the short pillars also appear to be designed to carry a plate.Our reconstruction of the Main Drive Wheel shows four long pillars, arranged round the circumference ring of the wheel, and four short pillars, arranged in two pairs opposite to each other.We also reconstruct the fittings and bearings on b1, which will carry an extensive epicyclic system in our model. (A) The Metonic pointer.(B) The hub of the broken-off Exeligmos pointer. The final component of our new model will be the pointer system on the Front Dials, so we here examine the sparse evidence for pointers in the Antikythera Mechanism.There are only two incomplete pointers that survive in the fragments.The first is the Metonic pointer.The surviving part of this pointer is 55.0 mm long, 4.2 mm wide and 2.2 mm thick.The second is part of the Exeligmos pointer, which we identify here for the first time. This is 5.4 mm across and about 1.0 mm thick.Its end is broken off.We have modelled our planetary pointers on the Front Dials with dimensions 68.7 mm long, 2.0 mm wide and 1.2 mm thick. 3.Building the New Model 3.1.Babylonian Astronomy & Period Relations The discovery that many astronomical phenomena are periodic was one of the foundations of the Babylonian astronomy of the first millennium BC.60 Through records of dated observations beginning in the seventh century BC if not earlier, astronomers in Babylonia identified time intervals, generally shorter than a century, which separate very similar occurrences of a single kind of phenomenon, for example the Saros comprising 223 lunar months, which separates lunar eclipses of almost identical magnitude and duration, and the Metonic cycle comprising 19 solar tropical years and 235 lunar months, which separates full or new Moons at which the Moon is at almost identical longitudes. For the planets, the most important set of intervals was the so-called Goal-Year periods, which were used to forecast repetitions of phenomena such as first and last visibilities and stationary points; these are sub-century intervals approximately comprising whole numbers of solar years and whole numbers of a planet's synodic cycles, so that after one Goal-Year period a planet will repeat its phenomena at very nearly the same longitudes. Besides the Goal-Year periods, many other approximate periods are attested in Babylonian texts, including longer and more accurate periods (of the order of centuries) that were built up out of the shorter ones to serve as the basis for advanced methods of predicting planetary motion.61 For the purposes of forecasting future occurrences of phenomena one-to-one from observed past occurrences, it sufficed to know the duration of a suitable period for the planet in question without having to take account of the planet's behaviour during the period. As a basis for mathematical modelling of a planet's apparent motion, a period relation took the form of an equation of a whole number x of synodic cycles, a whole number z of revolutions of the planet around the ecliptic, and a whole number y of solar years; for example, Saturn's Goal-Year period of 59 years becomes: 57 synodic cycles = 2 longitudinal revolutions = 59 years.Greek astronomers' records of dated planetary observations began only about 300 BC, and were never as systematic as the Babylonian records, so that their knowledge of period relations, beyond the crudest periods, was derived from Babylonian sources; thus we are informed by Ptolemy that Hipparchos, in the mid second century BC, had a set of planetary period relations that we recognize as the Babylonian Goal-Year periods. The Greeks also applied observational evidence and mathematical algorithms to obtain other period relations as modifications of the Babylonian ones.In some cases these were more astronomically accurate, but some were preferred for other reasons, for example so that one could have a simultaneous repetition of the phenomena of all the planets in a single vast Great Year period running to tens of thousands of years or more.62 3.2. Geometrical theories of planetary motion During the second century BC, Greek astronomers seeking geometrical models to describe the motions of the Sun, Moon, and planets employed geocentric models that may be described anachronistically as representing a heavenly body's position relative to the Earth as the sum of two uniformly rotating vectors of constant length.63 When a planetary model of this kind is translated into a heliocentric system, one of the vectors turns out to represent the planet's mean revolution around the Sun (i.e. treating its orbit as perfectly circular), and the other represents the negative of the Earth's mean revolution around the Sun. Since the vectors can be added in either order, each body's motion can be effected by two geometrical models that result in identical paths for the body while suggesting distinct physical interpretations.Taking the longer vector as the primary revolution around the Earth, and the shorter vector as a secondary revolution superimposed on the primary revolution, we obtain the deferent and epicycle model, where the body revolves uniformly along an epicyclic circle whose centre revolves uniformly along a deferent circle concentric with the Earth. Reversing the role of the vectors, we obtain the eccentre model, where the body revolves uniformly along a circular orbit that encloses the Earth but is not concentric with it, while the centre of the orbit revolves uniformly around the Earth.Greek astronomers appear to have preferred the deferent and epicycle model for the two inferior planets, Venus and Mercury (see Fig. 26), probably because it gave an intuitive explanation of the fact that these planets alternately run ahead and behind the Sun without ever surpassing a certain maximum elongation from it. Fig. 25 Deferent and epicycle model for an inferior planet. u00a92011 Tony Freeth, Images First Ltd.All rights reserved.The planet P revolves uniformly in the sense of increasing longitude (counter clockwise as seen from north of the system) around the centre E of the epicycle, while E revolves uniformly in the same sense around the Earth The direction from T to E is identical to the direction of the Mean Sun S from For the superior planets, the Greeks employed both varieties of model (Fig. 26). Assuming deferent and epicycle models for the superior planets resulted in a system in which all five planets revolve on epicycles, whereas assuming eccentre models resulted in a system in which the mean Sun plays the same role for all five planets.(The eccentre models can be thought of as extreme epicyclic models in which the epicycle has become so large that the Earth is inside it.) In the epicyclic model, the planet P revolves uniformly in the sense of increasing longitude (counter clockwise as seen from north of the system) around the centre E of the epicycle, while E revolves uniformly in the same sense around the Earth The direction from E to P is identical to the direction of the Mean Sun S from In the kinematically equivalent eccentre model, the planet revolves uniformly in the sense of increasing longitude around the centre C of an eccentric orbit while C revolves uniformly in the same sense about The direction from T to C is identical to the direction of S from Because these models translate into a heliocentric system in which all the planets revolve uniformly on circular orbits concentric with the Sun, they successfully explain the planets' synodic cycles with their alternations of prograde and retrograde motion, but they fail to predict the variations in a planet's successive synodic cycles that result from the fact that the true orbits are not uniform and circular but elliptical and subject to Kepler's Second Law .Passages in Ptolemy's Almagest (12.1 and 9.2) indicate that they were employed by Apollonios of Perga in the early second century BC, whereas during the third quarter of that century Hipparchos showed that invariable synodic cycles were inconsistent with observational evidence. 3.3.Mechanisms for planetary and solar motion Our focus is on geared mechanisms for the planets that are based on the ancient Greek deferent and epicycle theories that combine two circular motions. Prior to this study, to the best of our knowledge all attempts to build such mechanisms into the Antikythera Mechanism took a direct form. A gear is turned at the rate of the deferent and a second gear mounted epicyclically on the first gear is turned at the rate of the epicycle. A slotted follower, turning on the deferent axis, follows a pin attached to the epicyclic gear.The follower is connected to a tube and a pointer is attached to the tube. This outputs the variable motion.This is the obvious way to model the theory with gears. 3.3.1.Choices of period relations for planetary mechanisms Our reconstruction is based almost entirely on period relations from Babylonian astronomy, which were certainly known to Greek astronomers.The tooth counts in our planetary mechanisms exactly reflect the period relations.The surviving gears in the Antikythera Mechanism all have tooth counts in the range 15 to 225 teeth, so we have restricted consideration of period relations to numbers that fall within this range. We believe that it is reasonable to restrict our attention to periods shorter than a century for two reasons beyond the purely mechanical convenience of avoiding large tooth counts or compound gear trains.First, we have no evidence that Greek astronomers before the middle of the first century BC possessed longer and more accurate planetary periods; on the contrary we have Ptolemy's testimony (Almagest 9.3) that Hipparchos, the preeminent astronomer of the last three centuries , used the Babylonian Goal Year periods for the planets, and a set of planetary period relations embedded in the roughly contemporary astronomical inscription from Keskintos (Rhodes), while different from the Goal Year periods, are about equally inaccurate.64 Secondly, the periods on which the lunisolar gearwork of the Mechanism was entirely based, namely the 19-year Metonic cycle, the 223-month Saros eclipse cycle, and the 365 u00bc day solar year, are all short, and among them only the Metonic cycle has, by an accident of nature, an accuracy significantly exceeding the norm for the planetary Goal Year periods. The following table is adapted from a previous publication.65 The period in years for the period relations of the superior planets is entered as a negative figure, since this means that a unified mathematical theory can be proposed for all the planets and the calculated period of the planet can be derived from a single formula for all the planets.Period relations in red are those attested in Babylonian astronomy. The error in the calculated period is defined as 360*|1/r u2013 1/r|.We shall denote a period relation as a simple ordered pair (x, y), where y is positive for an inferior planet and negative for a superior planet.The reason for this negative number is so that a single unified mathematical theory can be developed for all the planetary mechanisms.The table lists the reasonably accurate period relations, where the numbers fall within our tooth-count range. Mathematical analysis shows that this list is comprehensive, except for the period relations (147, 235) for Venus and (96, -205) for Mars.Since the large numbers 235 and 205 are unsuitable for our application, we have discarded these possibilities.There are several choices for Mercury.We have chosen (104, 33), despite the fact that it is not attested in any known ancient source, because it means that the epicyclic gear, with a reasonable module, can have its bearing on the spoke in the 4 oclock position, where there are remains of a suitable bearing. We would have preferred a period relation that is attested in Babylonian astronomy, but have not been able to match such periods to the features on b1.For Venus, only one period relation offers itself with reasonable numbersu2014so there is really no choice.However, there is a choice of a multiplication factor to create reasonable gear sizes.We have chosen (40, 64) since this means that the epicycle of Venus is in the right position to use the attachment area on the 1 oclock spoke and the carrier disk for the pin falls within the area defined by b1. For Mars, we have chosen (37, - 79) since it is a very accurate period, which results in suitable tooth counts for gears.For Jupiter, all the period relations are suitable, so we have chosen the most accurate.For Saturn, the 59-year period is far more accurate than the 29-year period so we have chosen this one.Our preference for the more accurate periods is partly because we believe that the designer would have preferred greater accuracy and partly because of the calibration process (see 3.9), which is sufficiently difficult that it would be better not to have to re-calibrate too often. 3.3.2. Inferior Planet Mechanisms X has x teeth and is fixed. Y has y teeth and meshes with Ys axis is carried by an epicyclic carrier gear (not shown) which rotates at the rate of the mean Sun. A slotted follower follows a pin attached to a bar that is rigidly fixed to the gear The slotted follower is free to rotate on an axis at the centre of X, and is rigidly linked via an axle to a pointer that shows the longitude of Venus. In this mechanism, x = 40 and y = 64.Simple proposals for inferior planet mechanisms for the Antikythera Mechanism have essentially been of this form (though Wright has chosen to use compound gear trains, which are not discussed here).66 For an inferior planet, such as Venus, the central gear X is fixed and the axis of the epicyclic gear rotates at the rate of the mean Sun as it is carried round on an epicycle carrier gear, which is not shown here. In the Antikythera Mechanism the epicyclic carrier is b1.The epicyclic gear rotates at the rate determined by the number of teeth in the two gears.The tooth counts exactly reflect the Babylonian period relations.This mechanism uses the 8-year cycle of Venus, with 5 synodic periods, which we shall refer to as (5, 8).This is scaled up to make the tooth counts reasonableu2014in this case x = 40 and y = 64. Following the example of Wright's model, the bar that carries the pin is replaced with a disk to ensure smooth running of the assembly.These mechanisms track the planets very well in a Simplified Solar System, where the planets all orbit the Sun in circles in the same planeu2014their accuracy being limited in this context only by the accuracy of the period relation.In fact, the systems are equivalentu2014though there are considerable errors by comparison with the actual Solar System. We shall measure all rotations as rotations per year.It is worth pointing out that there are two inputs to this system: the fixed gear, which turns at 0 rotations per year, and the rotation of the epicycle carrier, which turns at the rate of the mean Sun at 1 rotation per year.This will be true for all our planetary mechanisms.We shall refer to these as the 0-input and the 1-input to the planetary mechanisms. Let r be the rotation of the planet round the Sun in rotations per year.Let p be the distance of the planet from the Sun in Astronomical Units (AU).Let d be the distance of the pin from the centre of Let d(X, Y) be the inter-axial distance between the gears, then it is easy to establish the basic equations of the mechanism:67 1/r = 1 + x/y or r = y/(x + y) d = p * d(X, Y) For our Venus mechanism, r = 8/(5 + 8) = 0.615385 years. This compares with the actual figure for the mean rotation period of Venus round the Sun of 0.615185 years.Note that the pin is outside the face of the gear.If we make the assumption that the radius of a gear is proportional to its tooth count, it can easily be established from Keplers Third Law that this must be true for every inferior planet mechanism.This is clearly a heliocentric way of viewing these mechanisms. For the ancient Greeks, the period relation would almost certainly have been obtained from Babylonian astronomy or from direct observation of dates of synodic phenomena, and the pin distance from observation of the maximum elongation of the planet from the Sun.Previous studies have proposed how such inferior planet mechanisms might have been included in the Antikythera Mechanism at the front of b1.68 Mechanically, this is comparatively easyu2014though even here the planetary mechanisms must be interleaved, rather than simply stacked adjacent to each other. From back to front, we have Mercury fixed gear, Venus fixed gear, Mercury output, Venus output.So the process is not entirely straightforward.The reason that the solar anomaly and the mechanisms for Mercury and Venus can all be included here is that they go with the Sun, so their anomalies are limited to a fixed number of degrees of elongation from the mean Sun.They can therefore be mounted on different spokes of the wheel without their slotted followers interfering with each other, as we shall see later. Historical parallels for these pin-and-slot devices occur about a millennium and a half later with the remarkable Astrarium by Giovanni de Dondi (1348-1364), an astronomical clock, which implemented the full Ptolemaic system for the planets.69 In this device, the Sun, Moon and planets each had their own individual dials, so avoiding the complexities of coaxial outputs.Anomalies in the de Dondi instrument are generated by pins and slotted followers and similar clocks flourished in the centuries afterwards, such as the magnificent Dresden Planetenlaufuhr by Eberhard Baldewein (c. 1565).70 3.3.3. Solar Anomaly Mechanism Following Wright's model, we include a solar anomaly mechanism in the Antikythera Mechanism, since the subsequent discovery of the lunar anomaly mechanism strongly supports the idea that the solar anomaly was also mechanized.The solar theory attributed to Hipparchos by Ptolemy (Almagest 3.4) models the solar anomaly with an eccentre model equivalent to a deferent and epicycle model, where the deferent turns at the rate of the mean Sun and the epicycle is fixed in its orientation. The epicycle model can easily be modelled with two equal gears, separated by an idler gear.The central gear is fixed, the middle gear and the idler gear are both epicycles, where the carrier is b1, turning at the rate of the mean Sun.Relative to b1, the fixed gear and the epicycle must turn at the same rate (since the middle gear is an idler gear).Therefore they must also turn at the same rate in the real world, since the property of turning at the same rate is invariant under change of frame of reference. Since the centre gear is fixed, the epicycle must also have a fixed orientation. 3.4.Superior Planets 3.4.1.Problems of incorporating the superior planets Previous attempts at incorporating the superior planets into the Antikythera Mechanism have all followed one form. A carrier gear is turned at the mean rate of rotation of the planet round the Sun.Attached to this is an epicyclic gear that turns at the rate of the mean Sun. A pin is attached at a distance of 1/p times the inter-axial distance of the gears, where p is the mean distance in AU of the planet from the Sun. In our experience, incorporating the superior planets into the design of the Antikythera Mechanism has always been the hardest problem.Unlike the inferior planets, the superior planets are not restricted to a fixed number of degrees from the Sun.This creates one set of difficulties if attempts are made to model these planets with slotted followers on the central axis.The addition of the inferior planet mechanisms to b1 also creates more difficulties in arranging for both the 0-input and the 1-input to the superior planet mechanisms, since the inferior planet mechanisms get in the way. In 3.5 we discuss a model that circumvents these difficulties but does so in our view at the considerable cost of extra complexity and a lack of conformity with the surviving evidence. 3.5.Wright's Planetarium Display for the Antikythera Mechanism Before assembling our new model, we examine Wright's model.71 We cannot emphasize its importance too strongly.Until its appearance, the prevailing assumption was that any planetary display on the Mechanism could have shown only mean motions.72 Wright's model gave the first solid grounding to the idea that it might indeed be feasible to make a model of the Antikythera Mechanism that includes pointers displaying appropriate cycles of prograde and retrograde motion for all five planetsu2014both conceptually and mechanically. The author made a working model of this scheme with eight coaxial outputs, ...entirely by simple methods available to the original workman.This proved in principle that such a scheme could not only work but could have been made in the era of the Antikythera Mechanism.From the inside of the central axis outwards, the eight coaxial outputs are: Moon, Sun, Mercury, Venus, Date, Mars, Jupiter and Saturnu2014as they are in our model as well. In our view, the main objection to seeing this model as an actual reconstruction of the lost planetary gearwork is that it does not conform sufficiently to the physical evidence from the fragments and that it is not in harmony with the design simplicity that has been revealed in the surviving gearing. (In fairness we should point out that Wright states that, This reconstruction is not significantly more complicated than the original fragments; it is simply more extensive.73) Our current study is aimed at tackling both of these problems. Because of the importance of this model, we will examine it in some detail to discuss whether it matches the physical evidence.Images of Wrights Planetarium model can be seen in Wright 2002, pp. 171, 172.Wright observed that b1 turns on a bearing attached to a central pipe, fixed to the Main Plate, which ends in a squared boss.74 He suggests that fixed gears were attached hereu2014and these might very plausibly have been the fixed gears for inferior planetary mechanisms. These gears provide the 0-input to the inferior planet mechanisms in this model, as they do in other models that include the inferior planets.In most cases, b1 is the epicyclic carrier and single epicyclic gears are attached to b1 for each inferior planet. b1 provides the 1-input to the mechanisms.The inferior planets are arranged on b1.Some of the arbors turn on bearings on the spokes of the wheel and some do notu2014meaning that they must be supported between the spokes. With this scheme, it is not easy to understand why the wheel had spokes, rather than being a simple disk.Once the inferior planets and the solar anomaly have been added, there is a problem with mechanizing the superior planets.Because the mechanisms already attached to b1 get in the way, a fixed gear for the 0-input cannot be added to the squared boss on axis b and a mean solar input for the 1-input apparently cannot be contributed directly by b1. Wright's model solves these problems, by adding a separate module for each superior planet, where the module is fixed to the side of an extended case for the 0-input and an auxiliary axle provides the 1-input.This axle is at the side of b1 and takes its rotation via a small gear that meshes with b1.This rotation is then transmitted to the planet module via another small gear of equal size and a gear the same size as b1 for each module. In our view, it is a cumbersome arrangement.Indeed Wright has considered ways of dispensing with this arrangement.75 From the 1-input to each superior planet module, gearing calculates the mean rotation of the planet around the Sun, and an epicycle is attached, which is geared to have the rotation of the mean Sun.Hence the module directly models the deferent and epicycle model.Each module uses seven or eight gears for each superior planet, leading to a system of considerable complexity. Our study of the pillars on b1 strongly supports the idea that there was a circular plate attached to these pillars (see 3.6).Wright reconstructs these pillars, but an attached plate here appears to be redundant.In summary, this model was an important evolutionary step in understanding how the Mechanism might have included the planets, but it cannot be considered to be a reconstruction of the Antikythera Mechanism. Our model uses a different design, which circumvents these problems.It is described in 3.6. 3.6.Building the New Model Fig. 29 Computer reconstruction of b1 with plates carried by the pillars. u00a92011 Tony Freeth, Images First Ltd.All rights reserved. (A) The Date Plate is attached to the short pillars.The input crown gear can be seen on the right. (B) The Superior Planet Plate (SPP) is attached to the long pillars. Our proposal is that a mechanism for the solar anomaly and mechanisms for all five planets were contained within the space in front of the Main Drive Wheel, b1.In our model, mechanisms for the solar anomaly and the inferior planets are attached to the spokes of b1; and mechanisms for the superior planets are attached to the rear side of the circular plate carried by the support pillars.To enable our model to work this circular plate is annular and we shall refer to it as the superior planet plate (SPP). Between these two distinct assemblies, our model includes a rectangular plate carried by the short support pillars.This plate has three functions: its primary use is to carry the rotation of b1u2014the mean sun rotationu2014to the Date Pointer on the front Calendar Dial; in addition, it supports the outputs from the superior planet mechanisms and serves as a bearing for the output tubes from the mechanisms attached directly to b1. We shall refer to it as the date plate (DP).Our new model explains all the observed evidence from b1, including all the bearings, the support pillars and their dimensionsu2014except for the pierced lug on the 10 oclock spoke of b1, whose function we do not understand.In our model, the distance from the front of b1 to the back of the Date Plate is 16.2 mm and the space between the front of the Date Plate and the SPP is 9.7 mm. These distances determine the number of layers of gearing that can be accommodated.If the layers of gears of the solar anomaly and inferior planet mechanisms were at a similar spacing of about 1.5 mm as they are in some other parts of the surviving mechanism, then they would take up just over half the space between the front of b1 and the SPP.If this is all that was contained in this space, it is hard to understand the function of the long support pillars and why they are so long. So it is very plausible that there was a plate attached to the long pillars and that the rest of the space was taken up with superior planet mechanisms attached to the back of this plate.In our model, these just fit into the remaining space between the Date Plate and the SPP: there are six layers of gears for the superior planets at 1.5 mm intervals (1.2 mm gears and 0.3 mm gaps), using up 6 x 1.5 mm = 9.0 mm of space out of the 9.7 mm available. b1 with the bearings and arbors for the solaranomaly and inferior planets. (B) The gears for the solar anomaly and inferior planet mechanisms with Venus on the 1 oclock spoke, Mercury on the 4 oclock spoke and the Sun on the 7 oclock spoke. (C) The solar and inferior planet mechanisms. (D) The solar and inferior planet mechanisms. b1 has been rotated so that Mercury is at 1 oclock; the Sun at 4 oclock; and Venus at 10 oclock. Assembling the inferior planets and the solar anomaly mechanisms on the spokes of b1 is now fairly easy.The mechanisms do not interfere with each other because they all go with the Sun.The output levels of the slotted followers are chosen in our model so that their output tubes are in the order, Sun, Mercury and Venus.The Sun tube must be next to the Moon output arbor, since these two outputs are subtracted in the lunar phase mechanism.76 It is notable that there is a spoke that is not used in our model, with a fitting that must have had some function. It would certainly put significant stress on the engineering constraints to include another function.It is also not clear what that function might be.It could possibly have been an output that showed both nodes of the Moon on the Zodiac Dialu2014a double ended pointer or Dragon Hand, as the Chinese called it.This was fairly common on astronomical clocks from mediaeval times onwards.77 However, it is very hard to see how this might be arranged in the context of the Antikythera Mechanism, though the gear ratio of 12/223 for the rotation of the nodes (derived from the Saros and Metonic cycles) looks possible to achieve. 3.6.2. The question arises as to whether the gear in Fragment D, whose function is unknown, might have been part of a planetary mechanism.Fragment D was first recorded in a picture taken in 1902-1903.78 Price writes about it as follows:79 This is a detached fragment of mechanism (Svoronos, fragment D) which was seen by Rehm, but then misplaced in the museum and not refound until March, 1973.It is a highly calcified mass about 40 mm in diameter and 5 to 8.5 mm thick which appears in the radiographs to contain a single gear wheel which Karakalos counts at 63 teeth. Just possibly the great thickness and the blur which gives a double row of teeth might indicate that we are dealing here with a pair of identical or nearly similar wheels.The center shows a round hole with a wedge and pin fixing as in the axes of C and There are also three fixing (?) rivets or axes arranged in an equilateral triangle on the gear face.All subsequent tooth counts have asserted a count of 63 teeth.80 Three parallel slices through Fragment The 1st and 2nd slice are 2 mm apart and the 2nd and 3rd 1.5 mm apart. Two orthogonal slices through the hub of the gear.The X-ray CT reveals some interesting features of the gear in Fragment Measurements are given to the nearest tenth of a millimetre, but the decimal component cannot be regarded as being reliable.The first X-ray slice shows a disk of radius 21.4 mm, with three rivets and a squared centre; the second shows the gear in Fragment D, with pitch radius 16.0 mm, and the third shows a plate with a semi-circular end. The rivets pass through both disk and gear.The disk is about 1.0 mm thick and the gear 1.5 mm.Because there are two sets of teethu2014seen on the right hand side of the second CT sliceu2014it has sometimes been thought that Fragment D might contain two gears.81 However, looking at the first orthogonal slice, a pin can be seen end-on going through the arbor, just below the level of the gear.The same pin can be seen side-on in the second orthogonal slice. It is clear that this pin has split the hub of the gear, causing one side of the gear to shift laterally, as can be seen by direct observation of the 3D X-ray CT volume. A strip of teeth has come away from the main body of the gear, giving the illusion of two gears.So we believe that there is only one gear in Fragment On both the surface of the gear and of the disk the letters ME are clearly inscribed. This stands for 45 in the ancient Greek letters-for-numbers system.It may have been a gear number, but we cannot find any other significance in this inscription.Since (63, 20) is a period relation for Mercury attested in Babylonian astronomy, the first question that arises is whether this gear is the fixed gear on the central axis in a mechanism for Mercury.However, this cannot be the case, since this gear evidently had a pin through its hub and this would exclude the lunar output that comes through the middle of the central axis. From the X-ray CT slices it can be seen that the gear had a circular disk riveted to one of its faces and the gear ran in a circular bearing in a plate on the other side of the gear.This is exactly the same structure that we are proposing for the epicyclic gears in our inferior planet mechanisms, where a disk is attached to the gear and a pin is attached to the disk.Might this gear be an epicycle for an inferior planet mechanism? The only plausible planet would be Venus with period relation (5, 8), which multiplies to (40, 64) for reasonable tooth counts.Is it possible that this gear had 64 teeth?The X-rays have a false-colour scale to enhance the teeth tips for counting.Two alternative counts are shown in red for 63 teeth (on the left) and 64 teeth (on the right).In these X-Ray slices the tips of the teeth have been identified for counting. These have been marked on the remnants of the teeth, which are still attached to the gear, since the other teeth have broken away and so their original positions are not evident.There are 61 surviving teeth with a small gap of 16.9u00b0.The 61 teeth represent 60 gaps over a total of 360u00b0 - 16.9u00b0 = 343.1u00b0.This means an average of 5.7u00b0 per gap.The 16.9u00b0 should therefore represent 16.9/5.7 = 2.96 gaps.It is therefore natural to infer that there are 3 gaps, meaning 2 teeth are missing. This would imply a gear count of 63.The mean angle between teeth is 5.7u00b0 with standard deviation 0.273u00b0.The minimum and maximum angles are 5.1u00b0 and 6.6u00b0.Even if all the missing teeth were at the minimum observed angle relative to each other, the number of gaps would only be 16.9/5.1 = 3.3 gaps.In the right-hand image, four gaps have been inserted at regular intervals of 4.23u00b0 to show the consequence of a 64-tooth count. For this to be correct, we would have to believe that the gaps between the missing teeth all just happened to be significantly less than the minimum surviving gap.This is not plausible.It could be argued that the gear was made with 63 teeth by mistake, when it should have had 64 teeth.However, a 64-tooth gear is very easy to lay out by repeated halving of the sectorsu2014much easier than a 63-tooth gear. In addition, it would be expected that the gear would show the symmetry of its layout, which the gear in Fragment D does not display.There is another argument that supports the idea that the gear might be the epicycle for a Venus mechanism.Measurements of the gear and the disk attached to it suggest that the size of the disk is within the permissible range to include the pin for the epicycle of Venus. However, the tooth count of 63 makes it very difficult to accept this hypothesis. A further question arises.Is it possible that the designer used a 63-year cycle of Venus?The associated period relation would be (39, 63).However, this implies a mean rotation for Venus of 0.617647 years.This compares with the figure implied by the 8-year cycle of Venus of 0.615385 years and the actual figure of 0.615185 years. So the period relation (39, 63) is considerably worse than the usual period relation.In addition, we know of no ancient source that uses a 63-year period for Venus.In conclusion, it is difficult to interpret the gear in Fragment D as being part of an inferior planet mechanism.Its function remains a mystery to add to the mystery of the unused spoke on b1. 3.7.The New Superior Planet Mechanisms We here describe new mechanisms for the superior planets, which will complete our proposed Cosmos model. Some key questions arise.Is our model consistent with the evidence?Do the dimensions of the gears fit the spaces available?Is the front-to-back spacing of our proposed gears consistent with the surviving layers of gearing?Is the conception and design of the planetary mechanisms in accord with the surviving gear trains?Are the parameters of the planetary mechanisms consistent with the astronomical knowledge of the era? Are the engineering requirements feasible for the era of the Mechanism?No previous model has been able to meet all these challenges.For our model, we give evidence for positive answers to all these questions.The superior planet mechanisms for our proposed model are unlike any previous mechanisms in that they do not model the deferent and epicycle theories in a direct way.They are based closely on the lunar anomaly mechanism. This mechanism is hard to understand and these new planetary mechanisms are equally difficult and surprising.It is very unexpected that essentially the same design works for both the lunar anomaly and the planets.Though the anomalies of the Moon and planets have distinctly different causesu2014the elliptical orbit of the Moon and the heliocentric orbits of the planetsu2014the deferent and epicycle theories provide a unified solution (to a first order approximation). This unity is reflected in the forms of these new mechanisms.The numbers refer to the tooth counts of the gears.All the mechanisms use period relations from Babylonian astronomy.Taking Mars as an example, each superior planet mechanism contains four gears: the fixed input gear G1, the pin gear G2, the slot gear G3 and the output gear G4.The tooth counts of G1 and G2 directly reflect a Babylonian period relation for the planet. The pin gear G2 is mounted epicyclically on a carrier, turning at the rate of the mean Sun. G2 meshes with G1 and is induced to turn by the rotation of the carrier. G3 is also mounted on the epicyclic carrier on a different axis than G2.The slot on G3 engages with the pin on G2 at distance d from the centre of G2.This induces a variable motion in G3.With an offset of d/p between the axes of G2 and G3 (where p is the mean distance of the planet from the Sun in AU), this models the synodic phases of the planet. G3 engages with the equally-sized output gear G4, which reverses the output and carries it to the planets pointer on the Zodiac Dial via a tube. A geometric proof that these mechanisms exactly generate the deferent and epicycle models is given at the end of these notes in 4.1. The lunar anomaly mechanism is shown for comparison.The blue gear on the left turns around axis e at the rate of the sidereal Moon, 254/19 rotations per year.The gears on the right are mounted epicyclically on eccentric axes on e3, which turns at the rate of the Line of Apsides of the Moonu2014(9 x 53)/(19 x 223) rotations per year.The tooth counts of the first two gears in the system, G1 and G2, exactly reflect the assumed planetary period relation. The tooth counts of the last two gears have no special meaning: they are simply chosen so that two equal gears with much the same module fill the space between the central axis and the axis of the gear with the slot.First, we look in detail at a practical embodiment of these ideas for the planet Mars, then we build all the superior planets onto the SPP in our new model. 3.7.1.Mechanism for Mars Fig. 35 Computer Reconstruction of Mars Mechanism. u00a92011 Tony Freeth, Images First Ltd. All rights reserved. (A)On the left is the 37-tooth fixed input gear for Mars and on the right the 79-tooth pin gear.The pin is attached to a ring on the gear, which is designed to support the slot gear.The thickness of the ring is chosen so that the Mars output is at the right level.The gear turns on a stepped arbor that allows the slot gear to rotate on an eccentric axis, while following the pin. The hole in the input gear allows the lunar and planetary outputs to pass through to the Front Dials. (B) On the right is the slot gear and on the left the equally-sized output gear with its tube attached.As the slot gear turns on its eccentric axis it generates the synodic phases of Mars and this is then transmitted to the output gear. (C)A bridge holds the Mars mechanism to the SPP.It is modelled on the bridge for the lunar mechanism, part of which survives in Fragment The bridge is held onto the SPP by pierced lugs and pins, so that it can be removed for calibration. (D) On the left is the pin gear, which rests on a disk attached to the SPP. On the right, the output gear with its tube passes through the fixed gear.Attached to the tube is the pointer, where Mars is represented by a red onyx sphere.Translating the geometric design for these mechanisms into a physical design is fairly straightforward.Care must be taken to make sure that the fixed input and the output are at the right front-to-back levels and that the output can pass back through the input gear for display on the Front Dials. This latter design is exactly analogous to the way that the output of the lunar anomaly mechanism goes back through the epicycle carrier, e3, and the input gear, e5, in order to reach the Front Dials.82 Everything about the design closely mirrors existing principles in the surviving mechanism.The Mars mechanism is made to the largest module (0.58) that will fit onto the SPP.This is because Mars stretches the design parameters in two ways. The input gear must be large enough so that a hole through its centre can accommodate all eight outputs from the systemu2014the lunar output and seven coaxial tubes for the Sun, Date and planetary outputs.In addition, the slot of the Mars mechanism goes very close to the axis of the slot gear, so it is best mechanically to have the gear as large as possible.The pin gear has a ring on its face to separate the input layer from the output layer, which must be at the correct level for the coaxial tube system. The pin is mounted on this ring.Just as in the lunar anomaly mechanism, there is a stepped arbor that enables the pin gear and the slot gear to turn on eccentric axes relative to each other.The slot gear and the output gear have the same number of teeth, so thatu2014relative to b1u2014the output gear mirrors the anomaly generated by the slot gear.The bridges that hold the planetary mechanisms to the superior planet plate are modelled on the similar bridge for the lunar mechanism. A broken-off part of this can be seen at the back of Fragment Before putting this mechanism into our proposed model, we discuss why this design works in our virtual model. (A more formal proof can be found at 4.1.) We shall use Rot (X) to mean the absolute rotation of X and Rot (X | Y) to mean the rotation of gear X relative to gear All rotations are measured as number of rotations per year. If we imagine sitting on b1 observing the system, the gears all turn on fixed axes.In this frame of reference, the input gear turns at the rate 37/79 and the slot gear follows the input gear with a cycle of variability determined by its apogee, when the pin is pointing at the central axis.So the cycle of variability of the slot gear is 37 cycles in 79 years, which is what we want for the synodic cycle of Mars. When this variable motion is mirrored back into the real world to the output gear, the period of variability is maintained (being invariant under the change of frame of reference) and the mean period of the output becomes 1 u2013 37/79 = 42/79u2014again what we want for the mean rotation of Mars about the Sun.It is tempting to think that these mechanisms are a direct analogue of the eccentric equivalents of the standard epicyclic models. However this is not the case: Rot (G2) = Rot (G2 | b1) + Rot (b1) = 37/79 + 1 = 116/79 This means that we cannot view the system as simply reflecting the standard eccentre model for a superior planet because the rotation of the pin gear is completely wrong for this idea.However, to an observer sitting on b1 the gear systems and the eccentre models (suitably scaled) will appear as mirror-reflections of each other, so that it is conceivable that the ancient inventor arrived at the pin-and-slot mechanism by way of an eccentre model imagined in the frame of reference of its apsidal line. Similar mechanisms can also be constructed for Jupiter and Saturn.(A) Jupiter Mechanism based on the period relation (76, -83). (B) Saturn mechanism based on the period relation (57, -59). 3.8.Assembly of Superior Planet Mechanisms One great advantage of these mechanisms is the simplicity and economy of their design.Another advantage is that they take the anomaly generation away from the central axis and this means that they can work together without interfering with each otheru2014just as the inferior planetary mechanisms do. This in turn means that we can place them all on the same plate and avoid the auxiliary axle of Wright's model, which was necessary to provide the 1-input to each mechanism.In our model, the fixed inputs to the planetary mechanisms are all attached to a Front Sub-Plate that fixes to the wooden Sub-Frame.This provides the 0-input to the mechanisms.The input gears are stacked in size order, with the biggest closest to the plate, and they all have a hole of 14.4 mm diameter to allow the planetary outputs to pass through on their way to the Front Dials. The rest of the planetary mechanisms are attached with bridges to the back of the SPP.Fig. 37 Computer Reconstructions of the Superior Planet Module. u00a92011 Tony Freeth, Images First Ltd.All rights reserved. (A) The fixed gears for the superior planets are attached to the Front Sub-Plate.The fixed gear closest to the plate is for Jupiter, since it is the largest gear.This is followed by Saturn and Mars. The gears must be in size order so that they can be inserted through the hole in the SPP and engage with the pin gears of the planetary mechanisms.The hole through the centre of the fixed gears is for the lunar output and the planetary output tubes. (B) The SPP, showing the hole for the inputs and outputs.The gear on the left is the pin gear for Mars.The gear at the bottom is the pin gear for Saturn and on the right a few teeth of the pin gear for Jupiter are just visible. The gear in the centre is the output gear for Saturn. (C) The superior planet mechanisms are attached to the SPP with bridges.On the right is Mars, on the left Jupiter and at the bottom middle, Saturn.The pins and slotted followers can be seen for all three planets.In the centre is the output gear for Mars. (D) The superior planet mechanisms from the other side, with the SPP removed.On the left, the pin gear for Mars, on the right the pin gear for Jupiter and at the bottom the pin gear for Saturn. In the centre are the output gears and tubes for the superior planet mechanisms.Once the basic design of the superior planet mechanisms is adopted, their inclusion at the back of the SPP follows a logical framework with few options for the overall design but some options regarding the details.For example, the angles of the planetary mechanisms relative to each other are immaterial, so long as they do not interfere with each other mechanically. The obvious options are to set them either at 120u00b0 or at 90u00b0.We have set the mechanisms at 90u00b0, with Saturn between Mars and Jupiter because of a particular mechanical constraint, which is described below.The order of the outputs at the front of the Mechanismu2014from front to backu2014is Moon, Sun, Mercury, Venus, Date, Mars, Jupiter, Saturn.This means that the output tube for Saturn is the outermost of the coaxial tubes. This in turn means that, among the superior planets, its output gear is closest to the front of the Mechanism, followed by Jupiter and then Mars. A consequence is that the bridges for the superior planet mechanisms vary in height with Saturn being the lowest, followed by Jupiter and Mars.The position of the Date Plate on the front-to-back axis is fixed from measurements taken in the X-ray CT of the short pillars on b1. With the dimensions that we have adopted for the gears, the bridges for Jupiter and Mars are too high to fit within the space allowed by the Date Plate. (For Jupiter, the bridge only fails to fit in our model by 0.7 mm.) So we have arranged that Saturn is the mechanism that fits right in front of the Date Plate.The fixed gears for the superior planet mechanisms are attached to the Front Sub-Plate. After the assembly of the planetary mechanisms on the SPP, this plate is placed in the device and each fixed gear engages with the pin gear for its planet.The fixed gears must be attached to the Sub-Plate in size order, with the largest being closest to the plateu2014otherwise, the Sub-Plate cannot be inserted into the Mechanism properly.The Sub-Plate needs to be small enough so that it can be placed into the Mechanism when the Dial Plate is removed and it needs to be robust enough to hold the static gears in the superior planetary mechanisms sufficiently firmly. The plate must also be attached to the wooden Sub-Frame, which we infer from observations of the X-ray CT of Fragment There do not appear to be any other size constraints on this conjectural plate.Our proposed superior planet system includes four gears for each planetu2014making just 12 gears in all.The inferior planets and the solar anomaly use 6 gears, so the total number of gears in the space in front of b1 is 18. (A) The planet module disassembled from b1. Superior planet mechanisms for Mars, Jupiter and Saturn attached to the SPP with bridge pieces.Attached to b1 are the inferior planet mechanisms and the date plate.The SPP attaches to the pillars on b1 with pins. (B) The planet module, showing the output tubes with pointers attached.In our model, the fixed gear for Jupiter is the largest, since we have chosen the period relation (76, -83).We could have chosen (65, -71) or (54, -59), but these would have been less accurate. So the fixed inputs, from front of the Mechanism to back, are in the order Jupiter, Saturn, Mars.The output gearsu2014again from front to backu2014are Saturn, Jupiter, Mars, since we want the planetary order of the pointers to reflect the ordering (from front to back): Moon, Sun, Mercury, Venus, Mars, Jupiter, Saturn.Note that the order of the pointers is the inverse of the order of the output gears because of the way that the co-axial tube system must work. The different orders of the fixed Sub-Plate gears and the output gears is not a problem: it is just a matter of arranging mechanically for the slot gear to be the right distance from the pin gear so that the output gear is at the right level.We achieve this with the help of spacer rings attached to the pin gears.The coaxial outputs on the Zodiac Dial are enabled by a system of concentric tubesu2014as will be familiar with the minute and second hands of a modern clock or watch. There is a precedent in the Antikythera Mechanism for a rotation being carried by a tube in the lunar anomaly mechanism, where the input to the system of the mean sidereal month is carried via a tube through gear e3 to the epicyclic system.For our model of the Antikythera Mechanism, we have outputs for the Moon, Sun, Date, Mercury, Venus, Mars, Jupiter and Saturn.In engineering terms, the manufacture of seven coaxial tubes surrounding the lunar output would have been one of the hardest challenges in the whole design. The total width of this tube system is constrained by the fixed input gear for Mars.This is one of the reasons that we have increased the module of the Mars gears, so that the fixed input gear is as large as possible.In our model, its inner radius is 10 mm.We have left a margin of 2.8 mm between the inner radius of the gear and the hole for the output system.Our output tube system has an external radius of 7.0 mm and this passes through a hole in the superior planet input gears of radius 7.2 mm. The output shaft of the lunar anomaly mechanism has a radius of 2.1 mm.So we have 7.0 u2013 2.1 = 4.9 mm for all seven output tubes.We have made the tubes with thickness 0.5 mm and a clearance between the tubes of 0.2 mm.The lengths of the tubes vary between 19.9 mm for Saturn and 54.4 mm for the Sun.To make an accurate 54.4 mm tube of external diameter 2.8 mm and internal diameter 2.3 mm in the 2nd Century BC would have been a difficult achievement. Without the discovery of the Antikythera Mechanism, it would have been hard to conceive that this might have been possible. A similar system of tubes is used in Wright's model.83 Wright cites the ancient aulos (flute), with its concentric sliding tubes, as evidence that the ancient Greeks had this capability.84 There is no doubt that the Antikythera Mechanism was made in a culture with a very advanced engineering capacity. 3.9. Dismantling & Calibration As with all the surviving parts of the Mechanism, our proposed model for the planetary mechanisms is designed to be taken apart for calibration and maintenance.To reach the planetary mechanisms, the Moon Phase Mechanism (one pin) and the other pointers are removed. (How these pointers attached to the output tubes is not clear.In our model, they are simply attached to rings, which are a firm push-fit onto the tubes. This enables them to be set at any angle for calibration.) The four sliding catches of the Front Dial Plate are then slid back and the plate is removed. (Evidence for one of these catches is contained in Fragment C,85 and there is another almost identical catch for the Back Cover in Fragment F, as is seen in our direct observations of the X-ray CT of Fragment Then the Front Sub-Plate with the fixed superior planet gears is taken out. This then gives access to the four pins holding the SPP.Once these are removed, the module containing the superior planet mechanisms is pulled forwards and taken out of the machine.To calibrate each superior planet, the two pins holding the bridge are removed.The gear with the slot is then taken off.Calibration consists in moving the gear with the pin to the correct phase for the planet for that date. This can only be done to an accuracy of a gear tooth, because the pin gear must be set at an angle where it will mesh with the fixed gear, attached to the Front Sub-Plate.This gear, for example for Mars where it has 79 teeth, can only be set in steps of 360u00b0/79 = 4.6u00b0. (It is just possible that the fixed gear was adjustable, though this would have been difficult.) Given the inherent inaccuracy of these mechanisms, this is not a real problem. The slot gear is then engaged with the pin and the output gear meshed with the slot gear.The pointer would then be set on the output tube at the correct ecliptic longitude for the calibration date for that planet. 3.10.Accuracy of the Planetary Mechanisms The designer might have hoped that, after going through the immense trouble of building the Mechanism and calibrating it, the outputs would stay accurate for many years. However, neither the science nor the technology of the era of the Antikythera Mechanism could really be described as exactu2014both the science and the mechanical realization of its predictions were very inaccurate.Fig. 39 Errors in deferent and epicycle theory for the planet Mars, middle seven retrogrades in 1st century BC.The magenta graph shows the positions of the retrogrades.The blue graph shows the error in the ecliptic longitude of Mars compared with its actual position, as determined from NASAs ephemerides website. The graph assumes a perfect period relation for Mars.We compare the positions of Mars, as reconstructed by NASA with the Mechanisms predictions over the middle seven retrogrades of Mars in the 1st Century BCu2014a period of about 13 years.86 Serious error spikes can be seen, amounting to nearly 38u00b0u2014more than a zodiac signu2014at the retrogrades.The deferent and epicycle theories, on which the mechanisms depended, might be regarded as an adequate first-order approximation but were completely inadequate for accurate prediction at the retrogrades, particularly for Mars. More accuracy would have to wait for more sophisticated theories such as those employed by Ptolemy in the second century AD.Added to these inherent theoretical errors were significant mechanical inaccuracies because of the way that the rotations were transmitted through the gear trains.87 In short, the Antikythera Mechanism was a machine designed to predict celestial phenomena according to the sophisticated astronomical theories current in its day, the the sole witness to a lost history of brilliant engineering, a conception of pure genius, one of the great wonders of the ancient worldu2014but it didnt really work very well! 3.11. Markers for the planets The Back Cover Inscription that describes the Front Dials mentions the little golden sphere, presumably referring to the Sun.In addition, there was a tradition of using magic stones as markers for the planets.88 This paper cites the following extract from a 2nd or 3rd century AD papyrus (Wash.Univ.inv. 181+221) about an Astrologers Board, where the astrologer lays out particular stones to represent the Sun, Moon and planets:89 ...a voice comes to you speaking. Let the stars be set upon the board in accordance with [their] nature except for the Sun and Moon.And let the Sun be golden, the Moon silver, Kronos of obsidian, Ares of reddish onyx, Aphrodite lapis lazuli veined with gold, Hermes turquoise; let Zeus be of (whitish?) stone, crystalline (?)...Fig. 40 Computer model of geocentric display of Sun, Moon and planets. u00a92011 Tony Freeth, Images First Ltd. All rights reserved.Our model includes pointers for all five planets on the Zodiac Dial.In order to be consistent with the little golden sphere inscription on the Back Cover, these pointers include conjectural spherical marker beads in different metals and semi-precious stones, which are placed at different distances along the pointers, so that they create a cosmos for Sun, Moon and planets in the order: Moon (silver), Mercury (turquoise), Venus (lapis lazuli), Sun (gold), Mars (red onyx), Jupiter (white crystal) and Saturn (obsidian). 3.12. Historical Context and Significance The last three centuries BC were a period during which mechanical technology and astronomy both developed rapidly in the Greek-speaking world.The surviving Greek technical literature on mechanical devices attests to intense activity especially with respect to military technology (artillery and the like) and wonder-working devices employing pneumatic and hydraulic principles, whereas we possess scarce written evidence for gear-based technology, none of which goes beyond the basic principles of employing toothed gears and worm gears to multiply rates of rotation up and down, as in simple odometers. The Antikythera Mechanism shows that Greek gear technology was far in advance of the level we would infer from the written record, having attained mastery of differential gearing (as in the Moon ball apparatus) as well as the translation of uniform into nonuniform rates of motion by means of epicyclic gearing and pin-and-slot couplings.While the modelling of astronomical phenomena provided an obvious motivation for the development of such contrivances, it is interesting to speculate about other possible applications they might have had in antiquity, for example in purely mathematical calculating machines and in automata. In the astronomy of this period certain trends stand out: the investigation of kinematic models built up out of nonconcentric uniform circular motions as explanations of the observable behaviour of the heavenly bodies; the integration of Babylonian astronomy, with its emphasis on quantitative prediction, into this geometrical framework, and the public presentation of astronomy as a discipline capable of explaining not only natural phenomena but also social conventions of time-reckoning. The Antikythera Mechanism, if we have correctly reconstructed its front display, turns out to embody all these aspects.Its gearwork invisibly mimicked the kinds of geometrical model whose theoretical validity was among the chief research questions of the time; through its front display it gave a graphic demonstration of how models based on eccentres or epicycles could account for the varying apparent speeds of the Sun and Moon, the limits of Venus' and Mercury's elongation from the Sun, and the retrogradations of all the planets. Babylonian period relations underlay many, if not all, of the gear trains, and the readout of the heavenly bodies' longitudes on a zodiacal ring graduated in degrees was also a fundamentally Babylonian conception.What is especially remarkable, however, is that the front display could combine this function of generating technical data with a didactic function of portraying the standard Greek cosmology in motion in a form that would have been comprehensible to the educated layman. Given the paucity of scientific artefacts surviving from Greco-Roman antiquity, we are extremely fortunate to have the remains of one of such encyclopaedic complexity.Appendices 4.1.Proof that the Superior Planetary Mechanisms work in principle The Main Drive Wheel, b1, rotates at one revolution per year. G1 is a fixed gear with g1 teeth. G2, with centre g and g2 teeth, is mounted epicyclically on b1. p is the pin on G2, which is d mm from g. The pin engages with a slot on G3. G3 is also mounted epicyclically and rotates on an axis, g, which is d/p mm from g on the bg radius, where p is the mean distance of the planet from the Sun in AU.It engages with the gear G1 and is turned by the rotation of b1. m is the mirror of the pin p in a line half-way between b and g and orthogonal to the bgg radius. (This will be referred to this as the bg-mirror.) s is the mirror of pin p in a line half way between b and g and orthogonal to the bgg radius (the bg-mirror). As G2 is induced to turn by the rotation of b1, it in turn forces the variable rotation of G3 via the pin-and-slot mechanism with eccentric axes. G3 then transmits this variable rotation to the equal-sized G4, which is the output of the system.The point s is fixed to G4.The argument of the proof shows that s is the resultant of two vectors, seen by the red and green arrows.Reversing the order of addition of these vectors produces a (d/p)-scale model of the deferent and epicycle theory of planetary motion. The proof is essentially the same as the proof for the lunar anomaly mechanism in a previous publication.90 The proof is expressed in the language of vectors because it is the easiest way to understand it in a modern mathematical framework.This mathematical language was not available to the ancient Greeks, though they essentially understood the concept of the commutativity of vector addition, a + b = b + a, which is a key concept in the proof. The proof can easily be translated into a purely geometric proof, which would have been accessible to the ancient Greeks.In a geocentric Simplified Solar System, the Sun rotates round the Earth at a rate of 1 rotation per year and the planets rotate in circles around the Sun at their mean distances and mean rates of rotation.If the solar system bodies all moved at constant rates in circular orbits, then the deferent and epicycle models of the planets would be an exact model (with the right parameters). We shall show that our new superior planetary mechanisms model the motion of the planets in our Simplified Solar System, limited only by the accuracy of their period relations.In our model, (g1, -g2) is a period relation for the planet, where g1 and g2 are positive integers.This means that the mean period of the planet round the Sun is, r = u2013g2/(g1 u2013 g2) and its rotation is 1/r = 1 u2013 g1/g2 rotations per year. If s is a unit vector in the direction of the Sun and m is a unit vector in the direction of Mars from the Sun, then the vector defining Mars (from the Earth) is s + pm, where p is the mean distance of Mars from the Sun in AU.The ancient Greek deferent and epicycle model for a superior planet essentially describes its position in the reverse order as pm + s, which is equivalent by the commutativity of vector addition. The description xy mirror will refer to a plane that passes through the mid-point of xy and is orthogonal to xy.The point s is fixed to G4, since it is the mirror of p in the bg-mirror and the gears G3, G4 have equal numbers of teeth.We want to show that it is the sum of two vectors.Obviously proofs can also be devised using elementary trigonometry or complex number theory, but they do not really give clear geometric insights into why the mechanisms work and they would not have been accessible to the ancient Greeks. We are still not clear as to exactly how the ancient Greeks would have arrived at the idea for these mechanisms.They are so brilliant, but very hard to conceive.Our proof of the correctness of these models is justified in terms of a heliocentric view of the solar system.It is remarkable that the ancient Greeks invented these models in the likely absence of an accepted heliocentric theory.It is clear that the Antikythera Mechanism is an entirely geocentric conception. 4.2. Parameters for Planetary Module All the following parameters refer to our computer reconstruction of the planetary mechanisms.No physical model has yet been built and we look forward to the knowledge and adjustments that will result from this. 4.2.1.Short Pillars & Date Plate (DP) 4.2.3.Inferior Planets & Solar Anomaly The following are the parameters that we have used in our model for the inferior planets and Sun. They are designed so that the dimensions match the evidence on b1.The pins are 1 mm in radius.The slots are taken as minimum length + 0.2 mm to allow for clearance.Fig. 42 Inferior Planets & Sun: gear, pin and slot parameters.The gears have triangular teeth with rounded tips and pits.The pitch radius is taken as the mean of the inner and outer radii.The inter-axial distance between two gears is assumed to be the sum of their pitch radii + 0.2 - 0.3 mm, since triangular-toothed gears cannot mesh too closely. The module (Mod) of the gears is the pitch diameter / tooth count.The length of the teeth is about 1.5 mm, depending on the module. 4.2.4.Superior Planets The following are the parameters that we have used in our model for the superior planets.There are some options but most of the parameters are essentially determined by the design constraints.The thickness of the gears is 1.2 mm, with gaps between them of 0.3 mm. The pins are 1 mm in radius.The slots are taken as minimum length + 0.2 mm to allow for clearance.Fig. 43 Superior Planets: gear, pin and slot parameters.The gears have triangular teeth with rounded tips and pits.The pitch radius is taken as the mean of the inner and outer radii.The inter-axial distance between two gears is assumed to be the sum of their pitch radii + 0.4 mm, since triangular-toothed gears cannot mesh too closely. The module (Mod) of the gears is the pitch diameter / tooth count.The length of the teeth is about 1.5 mm, depending on the module.The module of Mars has been chosen to be as large as possible for reasons explained in 3.7.1.The fixed gears have a 14.4 mm diameter hole through their centres, so that all the outputs can pass through."
}