{
  "articleId": "isaw_paper7_26",
  "text": "ARTICLE_ID: isaw_paper7_26\nISAW Papers 7.26 (2014)Linked Open Data for the UninitiatedRebecca SeifriedConcepts like linked and open data are old hat for a handful of specialists working with archaeological data, but for the rest of us u2013 those scholars who have never built a web page or coined a URI u2013 the world of linked open data seems a shadowy and impenetrable veil.The data I encounter on a weekly basis violate so many best practice guidelines that it is frightening to even consider publishing the data online, let alone connecting it to the semantic web. Nevertheless, the amazing things that can be done with linked open data, the connections and meaningful relationships, the benefits to the public and scholars alike, are reason enough to encourage us uninitiated archaeologists to reconsider how we create, manage, and publish our data.#p1This short essay represents the personal musings of a non-technical web user, who sees the benefits of publishing archaeological data in a linked, open way, but who cannot (yet) speak the language of HTML or SPARQL. I have worked with born-digital data existing in different levels of technical sophistication, from projects as large and well funded as the Ku00f6ru00f6s Regional Archaeological Project in Hungary, to my own ongoing dissertation research project in Greece, the Byzantine and Ottoman Settlement Study. While many of the contributors to this online volume demonstrate the wealth and variety of linked open data, my focus is turned toward the initial difficulties that will inevitably face the uninitiated, who see the potential for disseminating their data to a worldwide community but simply dont know how to begin.#p2Although data recording has almost entirely shifted from a manual process to a digital one, many of the uninitiated fail to live up to best practice guidelines for born-digital data (e.g., [ADS and DA 2011]). It is imperative that even if we have no intention of coding RDF triples ourselves (see [RDF Working Group 2013]), we prepare for data to be archived in an online, open-access format.The issue isnt just about using the proper file format; it is also about determining which specific types of data will be relevant to a broader audience. A file may contain thousands of entries, but oftentimes metadata is recorded for the entire file, rather than for individual records. Wouldnt it be nice to know when each individual record is modified, and by whom?Aside from thinking ahead toward potential online publication, the uninitiated should try their best to understand the basic premises of linked open data.While we may not be skilled enough to created linked open data on our own, we can structure our datasets so that later on, specialists can do so in a relatively easy and painless process.#p3Present Options for Disseminating Archaeological DatasetsFor case studies, I will mention a few specific archaeological projects and how they are currently disseminating their data. Information about the Ku00f6ru00f6s Regional Archaeological Project is disseminated primarily on a subsidiary webpage of The Field Museum ([The Field Museum 2013]), although a more significant site is planned for the future.The current site includes blog entries, photos, and videos, but almost no original data.The project hasnt even earned itself one star, according to the Berners-Lee ([Berners-Lee 2006]) framework, although there is potential to use the server to publish the FileMaker Pro databases (to earn 2 stars) or non-proprietary versions of the data (to earn 3 stars). Online data depositories are a second option for archaeologists who do not have access to institution servers.The Shala Valley Project provides an excellent example of online data dissemination, using the Archaeology Data Service ([Galaty et al. 2009]), although the Digital Archaeological Record ([Digital Antiquity 2013]) is another depository for projects to consider.Shala Valley data are available in the form of images, non-proprietary database files, scanned field notes and drawings, and an interactive GIS. A third option is to secure a non-institutional, non-depository, but reliable website of ones own, such as a domain powered through WordPress. Data hosting is limited on these sites, but interactive maps can be powered through third-party software like MapsMarker and TileMill. A great example of this type of site is the Documenting Cappadocia project ([McMichael 2013]).#p4The type of online data hosting offered in these examples is a good way for the uninitiated to disseminate archaeological data; by and large, someone else does the work of website-building, allowing archaeologists to make their data somewhat accessible without getting lost in an utterly foreign world of languages they dont know. The drawback of this approach is that the data can remain stagnant and isolated, unconnected from the myriad sources on the web that could highlight relevant and meaningful relationships u2013 if only they were linked.#p5As I structure the databases for my own dissertation research and think ahead to the ideal way to publish them online as linked open data, I see two alternatives for achieving the coveted 5 stars of Berners-Lees Linked Open Data guidelines. The first is to use a data depository, like OpenContext.org ([OpenContext 2013]), that issues individual URIs for each item within a dataset (see [Kansa 2013], this volume).This option would give me peace of mind to know that, so long as I follow best practice guidelines for data acquisition and compilation, a technical expert will be able to help me later on to get my data online in a meaningful way. The second option is to create my own website using RDF triples and cool URIs ([W3C 2008]).At the 2013 LAWDI gathering, a number of individuals u2013 many of whom were never formally trained in web languages u2013 showed off their successes after attempting this task on their own.As one of the many archaeologists foreign to HTML coding and the like, the experience tore down the veil that made linked open data seem obscure and impenetrable. I came away realizing that linked open data is not only possible, but that it is, in fact, the future of archaeological research and data dissemination."
}