{
  "articleId": "isaw_paper20_5",
  "text": "ARTICLE_ID: isaw_paper20_5\nResearch in the third dimension has increased significantly in the last 20 years.Before, 3D scholarship was relegated to institutions with large amounts of funding, but as 3D technology becomes increasingly more economical, more and more institutions and researchers are conducting and producing their research as a 3D expression.1As with many new kinds of research, the approaches and methodologies are tested in ways not anticipated before. New rules have to be created on the fly and new ways of sharing and distributing said research begin to pop up in unexpected and, generally, unorganized ways.As with many disciplines, structures emerge to support the maturing methodology and 3D is at the juncture of innovation and the necessity of structure.In order to support the continuation of 3D research, innovation and new knowledge creation is only possible if it can be shared, disseminated and ultimately, live beyond the velocity of technological obsolescence.Recalling myriad museum exhibits utilizing 3D like The Mourners: Medieval Tomb Sculptures from the Court of Burgundy, which was a traveling exhibit between the Dallas Museum of Art and Musu00e9e des Beaux-Arts funded by the French Regional American Museum Exchange in 2010, or recall the impact of Adobe's Flash platform and its impact on 3D animation,2 or the rapid turnover of augmented reality apps that contained 3D experiences.3 Today, the majority of these projects and platforms are no longer supported or the technology has changed such that these platforms no longer function, leaving the 3D orphaned and unattainable and relegated to individual memory. If you're anything like me, your memory, perhaps, is not the most reliable research methodology.4One need not rely on the lifespan of a piece of rendering software in order to interact with, or view 3D scholarship.The visualization of the data is not the only product that lends itself to Linked Open Data. 3D research need not be bound by the technology as it has been in the past.Linked Open Data has the potential to not only aid in the discovery of 3D research, but also aid in the creation of new relationships that provide context to 3D data, provide pathways for viewing and interaction (should appropriate metadata be captured) and therefore provide an extension on a much too short lifecycle for 3D by supporting reuse and revitalization of these data.The potential and integrity of 3D research would be increased significantly if we think of these data as linked for the purposes of reuse and reimagining beyond (what typically turns out to be) a 2D rendering or video fly-through as the de facto final product for 3D research. The visualization of the data, while useful for presenting the culmination of research, is likely to continue to advance rapidly changing the resulting quality of the rendering.The product of 3D scholarship is not, in fact, the rendering of the 3D model, or the rotating virtual 3D object, but the data itself (the x, y, z coordinate, the color measures and bitmaps that reconstruct surface texture, the capture details u2013 camera settings, etc. u2013 and the measurements and decision trees made by the creators). These data are what make it possible to interrogate and regenerate the data.It is important to understand that Linked Open Data (LOD) not only creates access to data, but [provides] relationships among data...(as opposed to a sheer collection of datasets) (Linked Data).Being able to find 3D scholarship is one hurdle, certainly, but being able to establish, leverage, and build upon existing relationships between cultural heritage data is essential to building context, conversation, and connection between one scholarly dataset and another. 3D has the history of existing on its own as a separate experience from contextual data (like a scholarly article or museum plaque) because of the limitations of technology. The benefit of incorporating LOD and 3D and leveraging the connections of datasets is that these connections between experience (3D) and context (traditional scholarly outputs u2013 e.g. monographs) may be married such that there is a boon to both.It is important to remember that the connection between lived-in space, cultural identity, and information exchanged happened much more often in 3D space than it did (or does) in 2D. The possibilities inherent in Linked Open Data combined with the need for contextual, complex and diverse data for 3D research have the potential to develop into a robust way of interacting, teaching, and learning with 3D ancient scholarship that is provided in no other medium of research expression.Where We Are Now u2013 Current Methods to LOD and 3DAt the time of writing, however, the development of cross-institution, cross-discipline use of Linked Open Data for 3D is still in the beginning stages. There are some foundational principles and examples that one can draw upon when approaching their 3D dataset for integration with linked open data requirements.Of particular note are projects like the Archaeological Data Service work on Digital Antiquity and the Guides to Good Practice, the 3DICONS project, that ADS draws heavily from and one that is especially relevant to European practices of data collection, the London Charter and, more recently, the PARTHENOS project. To take these initiatives in turn may be the best way to understand where we are currently in supporting Linked Open Data for 3D research.Details regarding specific recommendations for 3D data capture methodologies (3D photogrammetric scanning for example) are out of scope of this paper, as it would take a much longer paper to address the many modes of 3D data creation.This instead provides an overview of the state of 3D data and discuss the possibilities.Relevant Resources for 3D Data Creation and Record KeepingLondon CharterThe London Charter provides a set of high level principles that are meant to make not only the creation of 3D research data more accessible, but to facilitate the dissemination and access of these data for the purpose of supporting intellectual transparency and long term computer-based virtual cultural heritage research. The main purpose of these principles is to uphold the academic rigor in 3D research by providing benchmarks for academic or intellectual transparency by allowing others to see how a virtual representation or reconstruction was created.In order to situate the subsequent benchmarks, the London Charter provides this analogy for context:The challenge of the scholarly validation of heritage visualization can most simply be illustrated by considering how one evaluates scholarly print publications: authors are expected, as a minimum, to situate their questions and arguments in relation to prior scholarship; to present and assess their sources, duly referenced in footnotes and bibliographies; and to remain within a range of currently acceptable logical and stylistic norms. (The London Charter, Commentary on The London Charter, 2.1, paragraph 1)Linked Open Data will allow a much more robust form of 3D research citation. In an ideal world accessible 3D research data may be integrated into other 3D research projects thereby contributing in a substantial way to 3D research more broadly.Linked Open Data will allow for the reflective and reciprocal use of project data to make reference to previous work, situate arguments in an ongoing dialogue of 3D scholarship that reflect the same kind of academic rigor print scholarship enjoys. This linking extends to non-3D research data u2013 connecting 3D and 2D LOD u2013 creating a connection that has been mainly achieved by proximity.By placing 3D research alongside 2D counterparts like a journal article,5 for example, allows for a descriptive link between 3D and other scholarship through traditional text citation.In-text citation with accompanying 3D, though decentralizing the 3D, is the most used method of linking 3D scholarship.6The principles outlined in the London Charter are not specific to a type of virtual cultural heritage product or a certain methodology, which is extremely useful when conceptualizing how and why Linked Open Data may apply to 3D scholarship. The charter is built to be technologically agnostic.The charter falls short only in its intentional vagueness.The purpose of this work is to provide principles for the creation and application of virtual cultural heritage scholarship.It is, as mentioned, not focused on any methodology and data collection practice.As such, many find this to be too vague to put into practice whilst conducting 3D research. However, I would advocate for its use when planning a 3D research project as it sets a set of ground rules for data production and also sets the tone for data dissemination.Not only does it provide this grounding, it also is the most generalizable and relatively holistic guide that is currently available.Still, the London Charter sets the stage for the creation of Linked Open Data and 3D scholarship.For reference, the London Charter Principles (as found on the Charter website) are:Principle 1- ImplementationThe principles of the London Charter are valid wherever computer-based visualisation is applied to the research or dissemination of cultural heritage. Principle 2 - Aims and MethodsA computer-based visualisation method should normally be used only when it is the most appropriate available method for that purpose.Principle 3 - Research SourcesIn order to ensure the intellectual integrity of computer-based visualisation methods and outcomes, relevant research sources should be identified and evaluated in a structured and documented way.Principle 4 - DocumentationSufficient information should be documented and disseminated to allow computer-based visualisation methods and outcomes to be understood and evaluated in relation to the contexts and purposes for which they are deployed. Principle 5 - SustainabilityStrategies should be planned and implemented to ensure the long-term sustainability of cultural heritage-related computer-based visualisation outcomes and documentation, in order to avoid loss of this growing part of human intellectual, social, economic and cultural heritage.Principle 6 - AccessThe creation and dissemination of computer-based visualisation should be planned in such a way as to ensure that maximum possible benefits are achieved for the study, understanding, interpretation, preservation and management of cultural heritage.The Charter does not prescribe a method of capturing this data. Again, this was an intentional choice in order to be as adaptable as possible.As such, there are many ways one may approach cataloging this information or metadata.One such way to record this information is a README text file that outlines the decision of the data creator and the connections between resources.Text files are a basic filetype that is easily migratable and therefore much more persistent than other proprietary file types like Microsoft's Word files (.doc). These data may also be captured through spreadsheets with metadata fields (see below: Moving Forward: Towards Linked Open 3D Data) and file paths or URIs to the data, or XML (eXtensible Markup Language), or other like hierarchical markup languages that is human and machine readable.The Archaeological Data Service (ADS)Though the Archaeological Data Service's (ADS) Guides to Good Practice is focused on the creation, use, and reuse of especially archaeological data, the principles therein are transferable to data preservation projects in other contexts. Even if the 3D research is not specifically archaeological, some of the workflows and methodologies can be used or re-tooled in order to effectively manage and organize these data so they can be used beyond their initial creation.The assumption for ADS is that one is generating data in a number of different mediums typical in archaeology; databases, images, Computer Aided Design or CAD graphics, Geographical Information System (GIS) files, spreadsheets, and word-processed files. These file types are also rather typical in 3D research projects as CAD and GIS also have the capability to interface nicely with 3D technologies and have some built in 3D functionalities.Database structures are not only helpful in cataloging the data used or consulted to create 3D research, but also may be a product of the 3D modeling processes, and images, as you might imagine, also play a large role in provided reference and textures to 3D models and have been one of the ways to create a record of 3D research.3D models are typically not only comprised of 3D data, the x, y, z's that create the visualization. They are usually a combination of the aforementioned datatypes and resources.Linked Open Data would provide a mode to link these datatypes into a digital representation of the relations it takes to generate the research so that one can trace the research processes.As already mentioned, this has been a relatively informal process by linking the data to additional resources by proximity (i.e. journal article with downloadable 3D dataset) or in a README text file packaged with the 3D data. Being able to retrace the 3D research process allows for the evaluation and validation of the 3D product.Being able to preserve these ties and relations also aid preservation possibilities of these data so they can be discovered and used to further research.The more used a dataset is, the more likely it is to be perpetuated beyond initial publication.That said, one must have an understanding of data capture methodology [which] is key to interpreting the final 3D product (Trognitz et al., 1.2). With this, we can begin to set up 3D data in a way that can be more easily integrated into LOD practice.This is where the ADS Guides to Good Practice really helps with some concrete suggestions on best practices for integrated datasets that provide and require additional (albeit archaeological) context.Of use and relevance are the sections dedicated to The Project Lifecycle and Data Analysis and Visualisation. These sections provide an overview of various relevant topics including how to plan for the data your digital project will create, how to properly curate your data by selecting appropriate file formats, where and how to archive your data, and some specifics on how to collect and maintain 3D archaeological data (more specifics regarding 3D data will be addressed later in this paper).3DICONSEstablished in 2012 as a joint effort funded by the European Commission, the three-year project culminated in 3DICONS, among others, to support the development of Europeana, the European digital library. 3DICONS is divided into two parts: guidelines and case studies of 3D scanning and remote sensing of cultural heritage sites and artifacts. The metadata schema that this methodology employs is CARARE u2013 a schema in service to monumental management and protection and integration into Europeana, the European digital library and predecessor to the United States' Digital Public Library of America (DPLA) which has yet to accommodate 3D research data integration.3DICONS assumes a cultural heritage focus for 3D data but the data are not specifically archaeological. 3DICONS focuses on typical data capture methodologies including remote sensing and 3D scanning. Insofar as ancient 3D research is concerned, it is entirely possible that there will be some kind of 3D scanning or remote sensing involved in the final research product.7 As was discussed in the consideration of ADS guidelines, 3DICONS is extremely helpful in setting up a 3D research project by clearly defining appropriate approaches to 3D data capture that will facilitate the use of any metadata for Linked Open Data applications.Researchers collaborating with scholars across Europe may find this resource particularly helpful when generating 3D research data that must interface with already established metadata records or repositories. Keep in mind that 3DICONS is intended for European monumental and archaeological sites, so 3D research on, say, the scanned remains of a Fayum mummy may not be easily captured if following these guidelines.Still, some considerations of 3D scanning methodologies and strategies, as well as documenting the process are useful elements from the 3DICONS guidelines to consider for any type of scanning project.At this stage, there is no one size fits all guideline for 3D data curation nor for distribution or linking. There are many types of 3D data creation methodologies that require many types of expertise that impact many different scholarly pursuits and disciplines which is why we see so many bespoke localized solutions for 3D data.With foundations provided by the London Charter, the Archaeological Data Service's Guides to Good Practice and 3DICONS, additional work has been made to address the broad impact and application of 3D research by outlining a set of principles one should uphold when conducting said research. These principles and pursuits have implications for the application of Linked Open Data as well.As the following efforts progress, there will be opportunity for the creation of a standardized, broadly applicable system that will integrate 3D research with Linked Open Data.The endeavors below build upon the availability of the technology and the willingness to create standardization that will ultimately facilitate LOD and the proliferation of connected 3D scholarship that builds upon previous work, reduces duplicated efforts whether unknowingly or due to data loss or lack of access. The groundwork is there, we only need guidance.Moving Forward: Towards Linked Open 3D DataIn 2016, PARTHENOS, a European consortium, produced a whitepaper outlining the major hurdles to 3D scholarship adaptation and dissemination.Concerns previously noted, such as quality assessment, repeatability, feedback and critique, nonlinearity, multimodality, scalability, registration, reliability, interoperability, and preservation are all surfaced again in the PARTHENOS whitepaper. The discussion of linking 3D data is relevant to our needs here (Alliez, p. 24) as it outlines where we currently are in terms of LOD and 3D research.Much of the discussion centers around annotation potentials using various technologies and visualization packages like 3DHOP in order to build a more robust 3D reconstruction or representation by inserting relevant annotations to cite and expound upon sections of a 3D model in 3D space. 3D annotation allows researchers to clearly mark aspects of a 3D model for further expounding or as foci for users. The annotations have the potential to include links to other resources whether 2D or 3D and embed additional contextual prose.These are meant to provide a more academically robust 3D model by effectively providing in-situ citation.Such links, through spatial correspondences, yields an information continuum between different media (3D, 2D)... where annotations could be performed just on one mediaitem and then propagated to many other mediaitems (Alliez, p. 27).Potential 3D annotation technologies that exist as a stop gap for LOD and 3D are (not exhaustive and currently an area of development):3DHOP 3D Semantic Annotation (3DSA) Agata Arrigo CityEngine, ESRICultlab3D ShapeAnnotator Sketchfab's 3D web viewer VSim These technologies all have their own restrictions of use and limitations such as not being able to interface with other media types (like images) though such annotation may be essential to the point of the annotation or the relative clunkiness of the navigation and positioning of annotations in 3D space, but this is indeed progress. Though we still lack the technical, institutional and cultural frameworks required to support such open data access of 3D research, we should strive to avoid the inevitable shortfall in the sharing of data by researchers because we do not anticipate these data's use and reuse beyond the immediate creation (Data's Shameful Neglect, p. 145).Though the context of this quote is focused on scientific data creation, it is motivation for us to think more seriously about the potentials of LOD and 3D research.In order to begin supporting LOD creation in our work with 3D, there are several required data categories and datatypes outlined as part of the PARTHENOS 2016 whitepaper.Different types of metadata relevant to the discussion of 3D research:Project level metadata u2013 the data about the project overall including the subject matter, the creators, dates etc. that would provide an overview of the 3D research product. This may include some provenance information regarding the who and how of 3D data creation.May also be referred to as paradata.Resource metadata u2013 data that focuses on the assets and resources used to create the 3D product including bibliographic records, photographs, GIS data u2013 think of this as your citation record or bibliography of monographic andor digital resources that support your 3D research.File level metadata u2013 this is the data associated with the 3D product files and any automated 3D model file types. These data are sometime generated automatically by 3D scanning processes and are something that communities are actively pursuing to integrate into 3D creation processes.File level metadata may also be referred to as paradata in some contexts.Data that should be also be collected to facilitate data reuse, recovery and dissemination are:Temporal data that reflects the date or timeline for the 3D product(s), or the joint analysis of spatial and temporal data is clearly of particular importance for visualizing object histories, for conveying temporal distribution of categorized events, as well as for addressing spatiotemporal data distribution issues (Alliez, p. 27).Provenance data which record the changes, migrations and permutations of the 3D research product as it moves from different technologies or versions.Authority record data fields identify the original creators and level of confidence or completeness of the 3D research product.Paradata (or data about data), which are also referred to as project level metadata, may encompass some of the provenance data genealogy andor the file level metadata, as well as the automated 3D processes that generate a 3D model.In the past, these data were captured in articles and books, and typically lived in a word processing document. This mode of recording is useful, but not ideal.Instead, set up record keeping and metadata creation within a spreadsheet or database.This may feel foreign at first, but spreadsheets are the mode of metadata transfer for librarians and archivists and are industry practice.As the standards for 3D metadata emerge and are adopted, it will be much more efficient and therefore much more likely that your 3D research will be catalogued and preserved because of your efforts to generate your metadata records in a spreadsheet rather than a word processing document u2013 or indeed in any other proprietary software.8At the time of writing, the metadata recommendations provided by ADS are the most succinct examples to follow. However, there is a more robust and discipline-agnostic set of recommendations currently being developed by a set of multi-institutional, international, and interdisciplinary experts in 3D to find a set of common needs across 3D research which you may find much more useful and applicable to your work u2013 the Community Standards for 3D Data Preservation.For the sake of providing a place to start, however, 3D metadata should capture the following:Figure 1: ADS Project Metadata; (Table 1 from Niven, 2011).The title (and any alternatives) for the dataset.DescriptiontA brief summary of the main aims and objectives of the research project (or alternative process) from which the data collection arose together with a brief summary description of the content of the dataset.SubjecttKeywords for the subject content of the dataset (qualified using e.g., the English Heritage NMR Monument Type Thesaurus or the MDA Object Type Thesaurus).CoveragetThis is both spatial and temporal coverage.For spatial coverage it should include the current and contemporary name(s) of the country, region, county, town or village covered by the data collection and, where possible, a standardised reference such as the Getty Thesaurus of Geographic Names should be used.If names or administrative units were different during the time period covered by the data they should be recorded separately.Site coordinates can also be entered as a National grid reference in a number of different ways e.g., as a point (useful to describe a small project area via a central coordinate); as a line (e.g., at least 2 coordinates to represent the linear limits of the site); as a polygon (for a more complex site area, 3 or more coordinates are used to describe the boundaries). If applicable, the full postal code for the site can be included.For temporal coverage it should include the datesperiod covered by the dataset (using existing thesauri where possible such as the RCHME Period List).CreatorstDetails of the creator(s), compiler(s), funding agencies, or other bodies or people intellectually responsible for the data collection.Information should include forename, surname, affiliation, address, phone, fax, email, or URL.PublishertDetails about any organisation which has published this data.ContributorstOther individuals or organisations who have contributed to the resource.IdentifierstProject or reference numbers used to identify the dataset.SourcetAny important earlier work(s) from which this resource is derived.DatestDates indicating when the dataset was created, when the archaeological project was carried out, processing dates, or computerisation dates as appropriate.CopyrighttThe name of the copyright holder for the dataset. If the collection was created during work by an employee, the copyright holder will normally be the employer.If the material is covered by a specific copyright (e.g., Crown copyright) please indicate this.RelationstIf the data collection was derived in whole or in part from published or unpublished sources, whether printed or machine-readable, this element should include references to the original material, details of where the sources are held and how they are identified there (e.g., by accession number). If the collection is derived from other sources include an indication of whether the data represents a complete or partial transcriptioncopy and the methodology used for its digitisation.Also include full references to any publications about or based upon the data collection.LanguagetIndication of which language(s) the dataset is in (e.g., English, French, Spanish).Resource TypetWhether the dataset is best described as primary data, processed data, an interpretation of data, or a final report.FormattThe format the data is saved in (e.g., WordPerfect 5.1, HTML, AutoCAD). Figure 2: ADS File Level Metadata; (Table 3 from Trognitz et al., 2016).ElementtDescriptionNumber of VerticestThe number of vertices (points) in the model.Number of Triangles or PolygonstThe number of triangles or polygons in the model.Geometry TypetThe type of geometry used within the model (wire frame, parametric, CSG, B-Rep etc. if applicable).ScaletWhat scale is existent, resp. what is represented by 1 unit.Coordinate SystemtDoes the model use a real world or arbitrary coordinate system?Master model or processed modeltIs the model the master model produced just after raw data processing, or is it a derived model produced from the master (e.g. after hole filling, simplification, smoothing, etc.)?Level of Detail (LOD); ResolutiontHow detailed is the model, what is the resolution of the scan.LayerstDoes the model use layers? How many?Colour and TexturetDoes the model contain colour or texture information?How is this stored?If raster texture files are used then these have to be archived separately.MaterialtInformation about the material properties of the model and whether they match the physical properties of the actual object.Light Source(s)tNumber and accuracy of light sources used in the model.ShadertHave special or extended shaders been used?AnimationtWhether animation is used in the model along with description of type (keyframe, motion capture).External FilestList of external files that are required in order to correctly open the 3D model (e.g. texture or material files and images for OBJ files).These fields may most easily be captured and recorded via spreadsheets or Comma Separated Value (.csv) files. These file types are simple enough to be fairly persistent throughout the years and data migrations.The titles in the example above would correspond to a column in the spreadsheet and the values would be recorded below with a reference to the unique identifier for the digital object.You have the flexibility to record what fields are most relevant to you and your intended users.Affordances Over Non-LOD 3D DataLinked Open Data will provide a platform for citation, creation, and integration of 3D research into a larger context of academic scholarship. As it is, 3D stands alone as a singular product of research of a particular state in time.The current state of 3D scholarship does not take advantage of what the rest of digital humanities research does by allowing citation, and linking to other projects and resources within the digital product such as TRISMEGISTOS,9 or The Orlando Project10 as examples which use multiple LOD resources to develop and supplement the project databases to make a holistic resource. As it is, much of that work is done outside of the 3D research product in a journal article or book u2013 thereby translating a 3D research project into a 2D representation defeating the purpose of 3D in the first place.The most successful full-production adaptation of linking 3D to the scholarly counterparts is the Journal of Digital Application in Archaeology and Cultural Heritage but that linking is by proximity in publication and does not take advantage of LOD. Linked Open Data has the potential to free 3D research from its 2D constraints allowing for referential practices, the further development of 3D scholarship discourse and a more refined, transparent and robust scholastic product that can be evaluated and critiqued in a way analogous to a book review.Basic Steps to FollowDocument the project planning and processes, including decisions made that resulted in the 3D research product. As you probably already do with other projects, set up and maintain a project workflow.What may separate these processes is that you should document this project workflow to be included with the final product including details on file formats and relations between data.This extra step of documentation, if new to you, will help anyone coming to your project with fresh eyes to follow your logic, guiding principles, and explain the ultimate digital product. This work will also help anyone trying to migrate, reuse, or make available your data after you've moved on u2013 think of your poor archivists and librarians!Maintain the 'original' or 'raw' data, that which is the first iteration or expression of the research be it the original unedited output of a 3D scanning process, the versions of a human modeled 3D asset, so that, if possible, the 3D creation process can be recreated for posterity. It is also a good idea to have a record of the final output be it, a set of still images or video as documentation.The final output 3D model is, contraire to what one might think, not as important to save as a research product than the data that are used to create it.Reproducibility and preservation for posterity are considered much more important than the pretty picture at the end, not only by cultural heritage and research stewards, but by those who will encounter your data and wish to make use of it u2013 again, the data is the research product here.As the technology continues to develop, an entire 3D environment may change this idea because the final product may not be just a digital rendering of a complete model, but may include embedded annotations, multiple model states that represent multiple hypothesis, details related to degree of certainty of the 3D recreation or crowdsourced input that would change how we approach 3D research interaction and therefore preservation. As it is now, save the 3D data (recommended file formats listed below) and the associated metadata (as a spreadsheet, Comma Separated Value text file, JSON, or XML file) so that, as the technology advances, so too will these data and your research.11 Other relevant datatypes for preservation can be found at Library of Congress' list of dataset formats (https:www.loc.govpreservationdigitalformatsfdddataset_fdd.shtml). Make a record of your work that will serve as a stand-in for your 3D research until 3D preservation practices expand to include a more linked, nuanced, and complete way of archiving 3D research.These surrogates are typically in the form of a collection of file types including the 'raw' data (typically a .ply, .obj or .stl file), the versions of modified data files (again, probably one of those three aforementioned file types) and, at the very least, a documentation of data modification and provenance captured in a README .txt file or spreadsheet. Additional types of files to consider are still-images of your 3D model as TIFFs and JEPGs andor video files .wav and .mp4 formats for preservation and access respectively.12 This will allow any subsequent researcher to evaluate your methodologies and permutations of the 3D data and potentially reconstruct the processes if needed.Should they not have the appropriate software to view the data, at least they can see an image of what they are missing. Involve data specialists, archivist andor librarians as you plan how to effectively capture and preserve your data.These experts will not only influence how you approach your own data, but will also allow for a smoother transition to LOD as workflows and methodologies develop from these communities for 3D research data.Additionally, there are many ways to transform your data and they will know how to most effectively access your data's long term viability and integration with other datasets (PREMIS Editorial Committee).Setting the Stage for LODIn addition to the projects already mentioned which have set the foundation for 3D research, there are additional initiatives including Building for Tomorrow, LIB3DVR, and Community Standards for 3D Data Preservation, that are attempting to push 3D research beyond simple creation to a more stable future underpinned by appropriate preservation practices. The research life cycle is not a linear process of creation and preservation, these are just two points in an ever-replicating wheel.Without preservation, there is no innovation, without innovation, there is no new research and so on and so on.With that in mind, there are new initiatives that are specifically focused on the development of 3D research preservation so as to support the research life cycle. The impacts of these initiatives are multifold, they are focused on building a foundation for novel 3D research, but also working towards building an ecosystem that impacts and provides space for LOD as LOD has the potential to seriously impact the 3D research ecosystem.In the spirit of LOD, all of these efforts are working together in order to not only solve their individual concerns, but to make sure that the outcomes are compatible across projects, and across discipline u2013 which thus far has been one of the major hurdles to 3D preservation (Moore and Kettler).Building for Tomorrow: Collaborative Development of Sustainable Infrastructure for Architectural and Design DocumentationThe Building for Tomorrow project is concerned with the preservation of design and development project assets associated with architectural projects. With the shift towards digital project outcomes and electronic signatures, architectural practice is grappling with how to track and preserve their assets for the longer term.To preserve the records of significant building projects completely, all of this digital information should be captured and linked or packaged together into a collection that can be easily searched, navigated, and preserved over time (Building for Tomorrow).The process of producing architectural plans necessitate the production of various types of outputs, like 3D CAD models, 2D drawings, photographs, communications between client and architect etc., yet the problems are not unique to the architectural discipline. Many virtual cultural heritage 3D research relies on the same types of information like 'object', 'rights statements', 'creator', etc.Following the outcomes of this project will inform the packaging and indeed the linking of these digital assets.Building upon the ideal of a Semantic Web and the necessity of Linked Open Data to support it, this project will help clarify the specific requirements for 3D data curation and data linking.Developing Library Strategy for 3D and Virtual Reality Collection Development and Reuse (LIB3DVR)The Developing Library Strategy for 3D and Virtual Reality Collection Development and Reuse project focuses on how effectively and ably libraries and archives are able to adapt to 3D data preservation based on the outcomes of various 3D modeling and scanning methodologies. They are also focusing on how to effectively influence and inform industry of research needs and standards for data atomization of metadata collection during certain 3D creation processes.The people contributing to this project are mainly those from the industry building and promoting 3D technologies as well as a select number of representatives from the CS3DP project (see below) and more established 3D repositories like tDAR and Morphosource. This project anticipates creating a roadmap on how to make data collection and metadata creation much less of a burden to users (i.e. you).Community Standards for 3D Data Preservation (CS3DP)The Community Standards for 3D Data Preservation project is specifically focused on the preservation of these data regardless of methodology or discipline.The impetus of this project is the realization that as the practice is currently, researchers and data professionals (should they not be the same person) have not been discussing the needs and asserting their workflows cross these professional boundaries. The community participants represent members from the aforementioned projects, as well as individuals from for and nonprofit organizations like the Walt Disney Company, CyArk, Library of Congress, and the Smithsonian as well as scholars from large and small universities and academic institutions.Scholars generating 3D data, by and large, have not been in close collaboration with local librarians or archivists and as a result, scholars have been recording their data in ad hoc ways and libraries have created bespoke methods to cope with local needs for 3D research. The practice stands now as one that is not only reinventing infrastructures and technologies to support 3D research, but also building unintentional barriers to sharing these data, or making these data more discoverable.There are islands of 3D research data that cannot talk with each other, and researchers who knew nothing about what other research is out there because there is no common way to find, search, and share 3D data.The CS3DP project is focused three objectives (Community Standards for 3D Data Preservation Team):Create a community of 3D researchers and data professionals thereby crossing the disciplinary and professional boundaries.Evaluate current 3D preservation practices that impact longevity of 3D data, sharing and discovery.Develop new practices and standards for 3D curation and preservation where they are lacking.The point of this project, and of the others is to facilitate the development of shared understanding, goals and foundations for 3D data preservation. Once we have the necessary requirements of engaging with and lengthening the life of 3D research, we can build into these preservation systems and practices to support Linked Open Data and 3D research.All this, for a world of connected 3D contexts that allow old and new scholars to immerse themselves in a time in space reconstructed again in three dimensions.It is not only the newest wave of research methodology, but it is also a new and equally important way of conveying scholarly information. The recipes may not have been worked out just yet, but there are people working on them.This work will provide for new learners so that they may interact and engage with scholarship that has been typically (and sometimes for these learners, cryptically) locked into a textual format. 3D and LOD frees the research to new modes of seeing and doing, teaching and learning.Can you imagine being greeted by the enigmatic smile of 3D scanned Bust of Nefertiti13 and wanting to learn more. Luckily, that 3D image of her is linked via LOD to details on the possible workshop she was made in14 and to relevant 3D reconstructions of one such workshop (with the bust in situ?!) which in turn is linked to other reconstructions or interactive museum exhibits or popular culture to examine how her bust, or Egyptian labor or spaces15 has been represented over time.Now imagine someone playing the Assassins Creed video game, which encourages the player to learn more (as part of it's new 'educational mode' to engage with scholarship around Egyptian space, moving from the video game back along the same LOD pipeline to the 3D bust of Nefertiti. This kind of research rabbit hole is one such exciting possibility for LOD u2013 imagine others!Acknowledging that LOD is not commonplace across academia, even given the connectedness many would like to see in their own work, these initiatives are still actively building the infrastructure to enable more projects to participate in this shift to digital research products.Not only would this work be a boon to discoverability of our work, but it provides greater access and transparency to the work that we do. As a bonus, it follows basic archival practice so it's more likely to be preserved longer term so that it may be integrated into a much larger 3D LOD ecosystem.It allows for broader audiences to engage with their cultural heritage and our collective history.It's an ideal, but an ideal worth chasing."
}