{
  "articleId": "isaw_paper18_2",
  "text": "ARTICLE_ID: isaw_paper18_2\nISAW Papers 18.2 (2020) Across the wide span of Mesopotamian textual history, from the late third to the late first millennia bce, the figure of the witch appears as one of a large number of antagonistic, if not outright malevolent, beings. Many of these occupy profiles akin to monsters and demons and are described with masculine traits or explicitly stated to be neither male nor female. The witch, however, along with such threats as the demon Lamaštu and the succubus-like ardat lilî, is represented in terms of her feminine qualities. Lamaštu is characterized as an inversion of the figure of the mother and wet nurse, preying on infants in particular, nursing them with her poisonous milk.1 Similarly, the ardat lilî, who was the ghost of a woman who died unmarried, drifted in from the Netherworld on the wind, disturbing men while they slept.2 Although the witch is not necessarily as deliberate a seductress as the ardat lilî, her demonic and chaotic power is still often couched in terms of her sex. From these examples, it seems apparent that connections between women and magic in Mesopotamia are overwhelmingly negative in nature. Despite the dominant presence of these antagonistic figures, there are others who do not conform to this pattern of malevolent magic wielded by similarly malevolent women, though these are scarce and often isolated exceptions.3 Indeed, in contrast to the prolific appearances of the witch as an antagonistic figure, she appears benevolently only once within the entire corpus of Sumerian literature, as the “wise woman” Sagburu in the Old Babylonian text Enmerkar and Ensuhkešdanna.4 Even classifying Sagburu as a witch is difficult, yet the witch is our only other major avenue for the practice of magic – albeit aggressive magic – by women in Mesopotamia.5 A number of terms in Akkadian and Sumerian may be used to describe the witch, but Sagburu is not directly connected to any of them. The most common equivalence among terms for “witch” is between the Sumerian uš7-zu (or munus-uš7-zu) and the Akkadian kaššāptu.6 The male version of this term (kaššāpu) does exist, but he is often found paired with his more popular female counterpart, rather than appearing alone. The word “witch” may cover a range of semantic grounds in different cultural contexts; however, the Mesopotamian figure is defined by her malevolent appearance and actions.7 These are represented through particularly evocative imagery, as seen in the following text excerpted from an Old Babylonian incantation against the attack of several witches: 1 hul-ĝal2 igi nu-sa6 dumu u4 šu2-šu2-ke4 2 uš7-zu lil2 bu-bu dumu dereš-ki-gal-la-ka-ke4 3 amalu ama uš7-zu imin-na-ne-ne 4 buru5mušen uš7-zu uš7 ki tag-tag-me-eš 1 The evil one, the wicked eye, the child of the overwhelming storm; 2 Witch, fluttering lil-demon, the child of Ereškigal. 3 The goddesses, the arch-witches, the seven of them; 4 They are the swarming witches who inflict witchcraft on the earth.8 The incantation further describes the actions of the witches, who practice “sorcery against a man” (lu2-ulu3 niĝ2-ak im-mi-in-ak-ak-ne) by “casting a spell on [his] food” (u2-e uš7 bi-in-du11), which the afflicted individual had then consumed.9 In literal terms, the witch speaks (du11) poison or spittle (uš7) onto the food. Here, “witchcraft” is consistently written as niĝ2-ak, as is common in other texts.10 These terms are all indicative of the witch in Mesopotamia, who is less a uniquely identified figure and more an amorphous entity that can cause all manner of harm in addition to threatening the underlying cosmic order of the universe itself.11 Although she may be creatively and vividly described, she is neither named nor individually personified, and the language – in regards to both general imagery and specific vocabulary – is consistent across a variety of texts. All of these conditions, however, are violated if not wholly inverted by the magical contest seen in Enmerkar and Ensuhkešdanna. Sagburu occupies a benevolent role that adheres more closely to the traditionally male figure of the exorcist, while another figure within the text, a male sorcerer, is representative of many of the qualities more often connected to the witch, irrespective of gender. Though descriptions of the witch and her actions are closely tied to her gender in Mesopotamia, Sagburu is allowed to exist as an exception: a female figure who nevertheless performs benevolent magical acts. The Enmerkar Epics and the Matter of Aratta The literary epic Enmerkar and Ensuhkešdanna is part of a set of four interrelated Sumerian literary texts from the Old Babylonian period, which includes the connected texts Enmerkar and the Lord of Aratta and Enmerkar and Ensuhkešdanna, as well as two texts concerned with the hero Lugalbanda, Lugalbanda in the Wilderness and The Return of Lugalbanda.12 These four texts all express, in different ways, a contest between the Mesopotamian city of Uruk and the foreign city of Aratta. An ultimately fictional location described as being situated to the east of Mesopotamia, Aratta exists within these texts as a foil for and rival to the city of Uruk, a rivalry that is emblematic of a deep division between native and foreign.13 Throughout the four texts, Enmerkar, the king of Uruk, and Ensuhkešdanna, the ruler of Aratta, fight to prove the dominance of their city and, more specifically, compete for the favor of the goddess Inanna.14 This battle may be conducted through more open military means, as in the Lugalbanda duology, where the armies of Uruk travel to besiege to Aratta. In contrast to this more overt opposition, the Enmerkar duology allows Uruk to triumph through non-militaristic means, and thus prove Uruk’s dominance in these areas as well. In Enmerkar and the Lord of Aratta, the contest is conducted through a series of riddles carried by messenger between the two kings.15 The riddles become too cumbersome for the messenger to remember and relay, so Enmerkar finally records one on clay, inventing writing in the process. As Ensuhkešdanna cannot read the text, Enmerkar is victorious by default, and Uruk triumphs over Aratta.16 While the messenger allows the two kings to challenge each other directly in Enmerkar and the Lord of Aratta, the contest in Enmerkar and Ensuhkešdanna is conducted via a more indirect proxy. The contest is a magical one, between a sorcerer (written in Sumerian as maš-maš) from the land of Aratta and the wise woman Sagburu, representative of Mesopotamia and identified specifically as coming from Ereš. These figures are each clearly representative of Ensuhkešdanna and Enmerkar, but the action has shifted locations and geographic foci.17 The text may open with challenges delivered from Ensuhkešdanna directly to Enmerkar and close with the former conceding defeat and acknowledging the supremacy of his rival, but the contest itself is conducted by their two representatives. The Wise Woman and the Sorcerer from Hamazu The sorcerer from Aratta instigates the entire affair, and his introduction establishes his the most critical aspects of his character. He first appears in the text as follows: 135 maš-maš dim2-ma-ni dumu ha-ma-zu-ke4 136 ur-ĝir3-nun-na dim2-ma-ni dumu ha-ma-zu-ke4 137 ha-ma-zu hul-a-ta arattaki-aš bal-a 138 e2-ĝi6-par4 nam-maš-maš-e da?-ga?-na na-mu-un-KU 135 A sorcerer, his witchcraft was that of a son of Hamazu; 136 Urgirnuna, his witchcraft was that of a son of Hamazu. 137 When Hamazu had been destroyed, he had crossed over to Aratta; 138 In the inner chambers of the Egiparra he practiced sorcery.18 The sorcerer is thus doubly foreign: not only does he owe his allegiance to and act on behalf of the foreign city of Aratta, but he originally hails from the land of Hamazu.19 Foreign even to Aratta, with his original homeland now destroyed, he is left without a place of origin of his own. The meaning of his name is not entirely clear: the current reading may suggest a pun on the word for dog, “ur-gir15,” thus suggesting “princely dog.” The reading “ur-alim-nun-na,” which would be closer to “princely bison,” has also been proposed as a reading of his name.20 Either reading is a jab at the foreign sorcerer’s own inflated sense of his magical abilities. Similarly interesting is the use of maš-maš to indicate a “sorcerer,” especially one with Urgirnuna’s clearly antagonistic aims. The maš-maš most often describes a ritual practitioner, one who in later periods occupies a similar position and shared context with the āšipu, or exorcist, traditionally set in direct opposition to the witch in incantation literature. Here, in one of the earlier appearances of the word in Sumerian literature, the term is divorced of ritual context and instead only references Urgirnuna’s magical abilities.21 Urgirnuna comes to Ereš and attacks the city’s resources and means of food production, using his magical abilities to stop the cows, goats, and sheep from producing milk. He commands each animal: “your cream to your glistening horn, your milk to your back!” (i3-zu si-muš3-zu-še3 ga-zu murgu-zu-še3), thus enacting his curse solely through the power of his speech.22 The livestock are devastated after his actions, to the point that “pen and byre had become a silent house, a ruin,”23 and this attack on the city’s means of food production prompts a shepherd and cowherd to plead to Utu, the sun god, for assistance.24 The plea is presumably answered by the arrival of Sagburu; unfortunately, her own introduction occurs in a fragmentary section of the text. She is first described as traveling to Ereš, a city located “on the bank of the Euphrates … the city whose fate was fixed by An and Enlil.”25 In characterizing Sagburu, terminology is the first hurdle. She may be most precisely, if clumsily, defined as a “non-antagonistic magic-wielding woman.” None of the terms commonly translated as witch or sorceress are applied to Sagburu, and her name offers no insight into her character.26 Sagburu is instead introduced by the Sumerian word “um-ma,” most often translated as “wise woman” or “old woman.”27 Attested as early as the Early Dynastic III period (2600–2300 bce) and found consistently in the Ur III period (2112–2004 bce), the term is most frequently used in literary texts from the Old Babylonian period and fades from the literary corpus afterwards.28 Limiting our attention only to the attestations of the um-ma found in the Old Babylonian Literary corpus, we see the following distribution of texts wherein it appears: Attestations of the Wise/Old Woman (um-ma) Text No. Connotation of Wisdom? Dumuzi’s Dream 10 Geštinanna described as the wise woman who knows the meaning of dreams; other attestations linked to elderly women without implication of wisdom Enmerkar and Ensuhkešdanna 9 References to Sagburu directly Inanna and Bilulu 5 Connection to descriptions of “old woman Bilulu” seen in Dumuzi’s Dream The Curse of Agade 3 Old women endowed with wisdom and council The Lament for Ur 2 Connotation of mother Enki and Ninhursaĝ 2 Absence of elderly in Dilmun indicates its paradisiacal nature Enlil and Ninlil 1 Reference to the “wise old woman of Nippur” The Marriage of Martu 1 Reference to the “old women of the city” The šumunda Grass 1 The um-ma is one of several antediluvian positions linked to wisdom Enmerkar and the Lord of Aratta 1 Used to describe Inanna Iddin-Dagan A 1 Reference to Inanna with association of wisdom Nanše A 1 Reference to Nanše, possible connotation of wisdom Nanše C 1 Reference to Nanše, preceded by “mother” (ama) Proverbs29 1 Fragmentary; context unclear This distribution represents a widespread but weighted frequency of the term: although it appears in fourteen texts, multiple attestations are principally found in only six of those texts. Even those cluster primarily in three texts, and the narratives of two of the texts (Dumuzi’s Dream and Inanna and Bilulu) are closely connected. In the other three texts that comprise the Aratta quartet, however, um-ma only appears one other time, in Enmerkar and the Lord of Aratta as a clear reference to the goddess Inanna.30 Although the term is most often connected to both wisdom and age, um-ma may also indicate the presence of either a wise or an elderly woman. In Sagburu’s case, the term is tied to both, and it is her wisdom in particular that makes her more than a match for Urgirnuna.31 Sagburu and Urgirnuna immediately engage in a magical battle, taking place over five consecutive exchanges of magical transformation. Each contest follows the same general format: the two throw fish spawn (agargara) into the Euphrates river and draw out the animal they have transfigured the spawn into.32 The general pattern is illustrated in the following two exchanges: 228 min3-na-ne-ne agargara id2-da i-ni-in-šub-[bu-uš] 229 maš-maš-e suhurku6 gal a-ta im-ta-an-[e3] 230 um-ma saĝ-bur-ru [hu-ri2]-inmušen a-ta im-ta-an-[e3] 231 hu-ri2-inmušen-e suhurku6 gal in-kar hur-saĝ-še3 ba-[an-ku4] 232 min­3-kam-ma-aš agargara id­2-da i-ni-in-šub-bu-uš 233 maš-maš-e u8 sila4-bi a-ta im-ta-an-[e3] 234 um-ma saĝ-bur-ru ur-bar-ra a-ta im-ta-an-[e3] 228 Both threw fish spawn into the river. 229 The sorcerer drew out a big carp from the water; 230 The wise woman Sagburu drew out an eagle. 231 The eagle caught the carp and fled to the mountains. 232 A second time they threw fish spawn into the river. 233 The sorcerer drew out an ewe with a lamb from the water; 234 The wise woman Sagburu drew out a wolf.33 Sagburu’s wolf subsequently catches and kills the sorcerer’s ewe and lamb on the open plain, and the remaining contests proceed in the same pattern. The magical acts themselves – the transformation of each animal from fish spawn – take place entirely within the waters of the river. Instead of any of the vocabulary associated more directly with antagonistic witchcraft (seen before as niĝ2-ak…ak and uš7…du11) the two cast or throw (šub) the fish spawn into the water and bring out (e3) the transformed animal. Overall, the contests feature the following animals set against each other: Match Urgirnuna’s Animal Sagburu’s Animal 1 Big carp suhurku6 Eagle hu-ri2-inmušen 2 Ewe with its lamb u8 sila4-bi Wolf ur-bar-ra 3 Cow with its calf ab2 amar-bi Lion ur-mah 4 Ibex and wild sheep šeg9 šeg9-bar Mountain lion nemur hur-saĝ-ĝa2 5 Young gazelle amar maš-da3 Tiger and NIM-lion ur-šub5 ur-nim In each instance, Sagburu’s animal is victorious: the lion drags his prey to the reed-marsh; the mountain lion disposes of his in the mountain ranges; and the tiger and NIM-lion finish their battle by dragging their prey to the woods (gištir-tir). The different contests also demonstrate the full range of Sagburu’s superiority over Urgirnuna. The sorcerer’s animals are defeated in different locations: the mountains to the north and east; the reed-marshes to the south; the open steppe beyond the city; and the woods, arguably to north and west. Each location connects to a space beyond the city itself, and when placed together, they represent the absolute and encircling dominion of Sagburu’s power. Overall, the battle is designed to test both the magical skill and cleverness of the two sorcerers. Urgirnuna’s animals, which are all prey or livestock, are easily overpowered by Sagburu’s predatory beasts. Just as Urgirnuna threatened the food production of the city, her animals consume his in turn. The mechanism of transformation is expressed identically for each combatant; Sagburu is simply more skilled in selecting and creating a creature designed to counter Urgirnuna’s own. Each choice demonstrates her superior knowledge and, in a sense, her greater tactical ability. Working Magic: The Fate of the Sorcerer Following Urgirnuna’s resounding and successive defeats at the hands of Sagburu, he is dejected, his “face darkened and his mind in turmoil.”34 Sagburu chastises him in a difficult but critical passage of the text, first upbraiding him for his lack of foresight in his actions, then reprimanding him for traveling to Ereš to work his magic, enumerating the qualities of the city as she speaks: 250 maš-maš nam-maš-maš-zu he2-ĝal2 dim2-ma-zu me-a 251 a-na-gin7-nam ereš2ki iri dnisaba-še3 252 iriki nam tar-ra an den-lil2-la2 253 iriki ul iri ki-aĝ2 dnin-lil2-la2 254 nam-maš-maš ak-de3 a-gin7 im-da-ĝin-ne-en 250 “Sorcerer, for all your magical knowledge, where is your common sense? 251 How, to Ereš, the city of Nisaba, 252 The city whose fate was decreed by An and Enlil, 253 The primeval city, the beloved city of Ninlil, 254 How could you have come (here) in order to work magic?”35 It is not the sorcerer’s own magical power that is lacking; instead, he fundamentally misunderstands his proper position in the world. This passage provides the terminology for the sorcerer’s own witchcraft, as “in order to work magic” is written as “nam-maš-maš ak-de3.” The phrase “nam-maš-maš-zu” is a clear reference to the sorcerer’s magical knowledge, contrasted with the knowledge Sagburu believes he should have demonstrated in line 250. This section of the text presents a consistent use of terms to describe Urgirnuna’s magic, terms that stand in contrast to “niĝ2-ak,” the word for witchcraft more commonly found in incantations. Instead, the construction “nam-maš-maš ak-de3” utilizes first the derivational morpheme “nam” to create an abstract concept from “maš-maš,” much as “lugal” would translate to “king,” but “nam-lugal” to “kingship.” The final de3 in the line stands as marking “-ed,” indicating the sorcerer’s purpose and intent, while the verb itself, “ak,” is a versatile verb meaning “to do” or “to make.”36 Much like “niĝ2-ak,” there is no sense of malevolence directly expressed by the phrase itself, and instead only develops through the context and conditions of its use. The sorcerer chooses to employ his talents (translated literally, his “maš-maš-ship”) for antagonistic aims, just as Sagburu employs her own abilities to counter his actions. Their own actions within the text, rather than any defining terminology or category, govern the roles played by each of them. The sorcerer pleads for his life, begging Sagburu to “set me free, my sister, set me free” (šu ba-mu-u9 nin9-ĝu10 šu ba-mu-u8), and promising to make Sagburu’s greatness known in all the lands.37 These pleas fall upon deaf ears, however, as Sagburu recounts his crimes and summarily decrees her verdict and his punishment: 270 nir-da i3-ĝa2-ĝa2 zi nu-mu-ra-ab-šum2-mu 271 um-ma saĝ-bur-ru maš-maš-e unken-ni imin-ma-ni mu-ni-in-sig3 272 ŝaga-a-ni gu2 id2buranun-na-ka i-ni-in-šub 273 zi nam-til3-la ba-da-an-kar iriki-ni ereš2ki-še3 ba-e-gur 270 “Therefore your sin is a capital offense: I cannot grant you life!” 271 The wise woman Sagburu confirmed her statutory verdict on the sorcerer; 272 She threw down her victim on the bank of the Euphrates, 273 Took away his vital force and returned this to her city Ereš.38 In her final action, Sagburu casts Urgirnuna into the river, much as she has cast fish spawn into the river throughout the five contests. This action and her seizing of his vital force is more representative of her magical abilities, but in passing judgment and enacting punishment, Sagburu has also acted as the arbiter of the local authority of the city. She has furthermore disposed of Urgirnuna in a way that echoes the legal repercussions of witchcraft accusations.39 Within the Code of Hammurabi, the River Ordeal is used to determine the guilt or innocence of an individual accused of the practice of witchcraft (kišpū).40 Sagburu’s actions emphasize her central position within the city’s established order and even its bureaucracy, setting her in contrast to Urgirnuna’s marked foreignness and his disruptive behavior. In the vast majority of texts it is the witch herself, a demonic and inherently chaotic figure, who is most often described as foreign.41 This trope is well represented across the body of anti-witchcraft incantations, which identify the witch in great detail so that she may be effectively combated. The longest of these, the eight-tablet ritual text Maqlû, provides some of the most detailed descriptions of the witch and her qualities.42 Although its date of composition is significantly later than Enmerkar and Ensuhkešdanna, this text remains a critical resource for information on the witch and her characteristics. The witch is referred to as foreign a number of times through the ritual, most extensively in one incantation found in its fourth tablet. Here, the witch, referred to as kaššāptu throughout, is described as an Elamite, a Gutean, a Sutean, a Lullubean, and a Hanigalbatean. It is only at the end of this list that the witch is described as non-foreign, as a native of the city.43 This well-established trope of the witch as foreign is inverted by Enmerkar and Ensuhkešdanna.44 By coming initially from Hamazu, the sorcerer is definitely marked as foreign-born, and that quality is further emphasized by his connection to Aratta. This foreignness stands in opposition with the emphasis placed upon Sagburu’s fully enmeshed position within the Mesopotamian heartland. The text creates a further disconnect between the role each figure plays in the narrative as opposed to those more typically and traditionally occupied by male and female magical practitioners in incantations and literary texts. Sagburu is native to Mesopotamia; named and clearly described as an individual; given authority and standing within the city of Ereš; works with the consent and at the behest of the gods; and is described in terms of her wisdom and age. All these qualities allow her to hold a clearly positive role, with her magic taking a very particular role. The witch, on the other hand, is often foreign; nameless and nebulous; disturbs order; functions against the divine sphere; and threatens humanity through a wide range of her possible actions. In each instance, Sagburu serves as a counter to the witch’s more commonly ascribed traits. Several of the traits of the witch, however, are seen in Urgirnuna, such as his foreign nature and his magical attacks on the animals responsible for the city’s food production – actions, principally, that upset the natural order of the city and in turn threaten the divine, and thus cosmic, order. His connection to the witch is not a perfect one, as he too is named and characterized as an individual, and the terms used for his magic diverge from those used for “witchcraft.” Neither of these figures exists in isolation, and both play very specific roles within the narrative of Enmerkar and Ensuhkešdanna, which have their own requirements. Urgirnuna’s position as the antagonist within Enmerkar and Ensuhkešdanna demands that he acquire a number of suitably malevolent traits to suit. Although the witch favors incantation literature over the corpus of Sumerian literary texts, the borders between the different textual categories within Mesopotamia are certainly malleable.45 Furthermore, the witch, though not entirely personified, is the most prevalent example of a figure who practiced antagonistic magic. Sagburu, on the other hand and despite her sex, is cast as the inverse to many of the witch’s key characteristics, reinforcing her positive role within the text. The battle of strength and skill between Uruk and Aratta that is central to these four literary texts becomes, within the narrative of Enmerkar and Ensuhkešdanna, a magical battle with clearly appointed champions. In defeating the chaotic and foreign malevolence that Urgirnuna represents and restoring order, Sagburu aligns herself more closely with the āšipu, a figure as enmeshed in the bureaucratic functions of the Mesopotamian city as she also appears to be. Urgirnuna, her antagonist, reaches instead for many of the traditional hallmarks of the witch in order to bolster his own malevolent image."
}