{
  "articleId": "isaw_paper20_11",
  "text": "ARTICLE_ID: isaw_paper20_11\nTo outsiders of either field, Linked Open Data and papyrology may not be an obvious pairing.However, the field of papyrology (that is, the study of ancient docouments written on papyrus) has been relatively lucky over the course of the last several decades such that it is not only already relatively well-represented digitally, but also has an established foundation for Linked Open Data which can be built upon. This foundation ultimately rests on social and institutional commitments to establishing and providing stable identifiers for the data which concerns the papyrological community at various levels.The main focus of this piece will be in describing the Linked Open Data for papyri.info, both the historical and institutional reasons for its current structure, as well as avenues forward for its use and development.1 Papyri.info is a searchable and user-editable online collection of papyrological resources (primarily transcriptions, metadata, images, and translations for papyri), born out of the collaborative aggregation of various pre-existing digital papyrological databases. Initially, these were the Duke Databank of Documentary Papyri (DDbDP), the Heidelberger Gesamtverzeichnis der griechischen Papyrusurkunden u00c4gyptens (HGV), and the Advanced Papyrological Information System (APIS).These databases were integrated in multiple rounds of development under the Integrating Digital Papyrology (IDP) projects (for more background on IDP and individual project history, see Bagnall 2010; Baumann 2013; Sosin 2010).As part of this integration process, the relationships between items in these and other databases needed to be mapped, in order that (for example) a transcription of text in the DDbDP could be associated with object and publication metadata in the HGV database, or image and curatorial metadata in APIS. As part of the IDP development project, an automated mapping process was developed which ingests the various XML files from each database and outputs associations as Research Description Framework (RDF) triples, where each triple is a statement of the form subject-predicate-object (Cayless 2011; Cayless et al. 2012; Lanthaler, Wood, and Cyganiak 2014).So, to translate the earlier example into an RDF triple, a DDbDP transcription subject would have a relation predicate to an HGV publication metadata object. Papyri.info in turn both uses these triples internally for its own mapping operations, as well as exposing them on the public web as RDF in a variety of available formats (see Figure 1).Figure 1: Top-level data flow for papyri.info, including the RDF mapping process.In the diagram, idp.mapping is the mapping process, while the Numbers Server is an Apache Jena Fuseki SPARQL server which stores and serves the resulting RDF triples (Cayless et al. 2012; image from Baumann 2013).Linked Open Data from Papyri.infoBefore describing the existing Linked Open Data from papyri.info, it may be useful to first discuss the types of problems it was designed to address. The DDbDP, since its creation in 1982, has been focused on digital transcription and encoding of papyrological texts, starting from print editions (mostly confined to documentary texts, i.e. letters, tax records, and the things of everyday life, in contrast to literary texts which would encompass poetry and prose). HGV and APIS, meanwhile, collect metadata (place of origin, date, keywords, bibliography, etc.) and images of much of the same material.2Since the DDbDP's items and identifiers are distinguished at the level of text orprint edition, while HGV and APIS constitute themselves around the physical object, there can be complex, many-to-many relationships between these records. As a straightforward example, the rectoverso of a single piece of papyrus may bear two completely different texts by different people, and be represented as two texts in the DDbDP, associated with a single HGV record.It's also possible that a single text could be split across multiple papyrus fragments now held by multiple institutions.As we can see, these definitions of what constitutes a single papyrological object can vary depending on what your goal is. Papyri.info also links out to identifiers minted and held by Trismegistos (Depauw and Gheldof 2014), a database which focuses on collecting metadata about texts from antiquity and which has a similar object-based principle for papyri.These relationships are often one-to-one with HGV, but even here, reasonable disagreements about what constitutes a single object can arise, resulting in one-to-many relationships. Another common scenario is that due to the DDbDP's original orientation around the print edition, multiple editions of a text (or at least, the identifiers for them) need to be related to one another, so that from a citation to an old edition of a text, the new edition can be discovered.Another artifact of the print world is the organization of multiple papyri into collections of papyri based on the print volume or series. Thus, for example, a DDbDB Oxy. collection may collect all DDbDB records corresponding to texts originally printed in the book series The Oxyrhynchus Papyri (Oxy. being the standard papyrological abbreviation for this series).3 At the top level, we can see all collections in the DDbDP by looking at http:papyri.infoddbdprdf,4 where each collection is represented in a Dublin Core5 hasPartisPartOf relation to the DDbDP:If we then look at e.g. http:papyri.infoddbdpp.masadardf, we'll see individual records in a similar hasPartisPartOf relation to their collection (other collections may have more hierarchy within them). Selecting the first of these, we can look at http:papyri.infoddbdpp.masada;;722sourcerdf to see the RDF data for an individual text:This expresses the relationships between this DDbDP record and corresponding HGV and Trismegistos records, as well as the relationship that Masada 722 replaces Ch.46 1365 because it is a new edition of the same text (see footnote 3 below for an explanation of these publication abbreviations). This specific relationship reflects an editorial decision rooted in the DDbDP's project history: that a newer edition of the same text added to the DDbDP should supersede an older edition, and the only text presented should be that of the newer edition.An alternative editorial practice may not express this as a relationship of replacement but simply of multiple editions living alongside one another, linked to the object metadata. But in any case, the data accurately represents DDbDP's current model of the relationships between multiple editions.Future DirectionsWhile these relationships between papyrological texts, objects, and their representations in various databases are relatively straightforward, it is hoped that by making them available as Linked Open Data we can act as good citizens of the web and of the papyrological community, enabling linking and discovery by other users. Of course, it's easy to imagine more complex relationships which we could express between records in papyri.info and other Linked Ancient World Data; findspots in Pleiades, periods in PeriodO, people in various prosopographical resources, provenance history in museums and collections, or even more generic data in Wikidata.Eventually, greater RDF support by Trismegistos may facilitate greater use of its own rich papyrological data of this sort in a linked data web as well. Images are another obvious avenue for development, where papyri.info currently exposes images from APIS in its linked data graph, but a much more ambitious integration with IIIF and a greater number of images across the internet can be envisioned.Despite a variety of projects, concerns, and focuses, papyrology as a discipline is well represented on the web u2014 something we all hope may continue and grow in the spirit of the amicitia papyrologorum."
}