{
  "articleId": "isaw_paper7_24",
  "text": "ARTICLE_ID: isaw_paper7_24\nISAW Papers 7.24 (2014)Mining Citations, Linking TextsMatteo RomanelloCanonical citations are the standard way of citing primary sources (i.e., the ancient texts) in Classics: the ability to read them, which requires knowing what numerous abbreviations stand for, is part of the early training of any classicist.Having an expert system to capture automatically these citations and their meaning is one of the aims of the project of which the research presented in this paper is part. The desire for such a system has existed for a considerable amount of time (Crane, Seales, and Terras 2009, 26) but has yet to be solved (Romanello, Boschetti, and Crane 2009; Romanello 2013).#p1Such a system has great potential both for scholars in Classics and for the study of Classics as a discipline: capturing the citations of ancient texts that are contained in journal articles, commentaries, monographs and other secondary sources, allows us, for example, to track over time how and how often texts were studied, essential pieces of information for a data-driven study of the discipline and its evolution.#p2Another possible use of the system is to display related bibliographic references within a reading environment for ancient texts. The examples that are used in this paper are taken from work that has been done to provide the GapVis interface of the Hellespont project1 with such a functionality (see Fig. 1).One of the goals of the project is to create an enhanced virtual reading environment for one specific section of Thucydides Histories, the so-called Pentecontaetia (Thuc. 1,89 to 1,118).The references that are displayed in the secondary literature view of the reading interface are mined automatically from JSTOR and are shown together with links to the full text of the journal article as well as to the cited passage in the Perseus digital library (Romanello and Thomas 2012).#p3Mining Citations: Extraction and DisambiguationExtracting citations requires performing two different tasks. First, the strings that constitute the citation are captured.Second, the referent of that citation is establishedu2014the specific section of text to which the citation refers.In Natural Language Processing (NLP) jargon these two steps are called respectively Named Entity Recognition (or extraction) and Named Entity Disambiguation.#p4My approach to citation extraction (see Fig. 2, no. 1 and 2) is essentially based on state-of-the-art NER techniques with the only difference being what it takes to adapt these techniques to the new domain (Romanello 2013). Instead of considering only the usual named entities (NEs)u2013such as names of people, places and organizationsu2013I treat as NEs the different components of a citation in addition to any mention of ancient authors and works occurring in the context that surrounds the citation itself.For this purpose four distinct entities were identified: aauthor, awork, refauwork and refscope.In its current definition, a citation is a relation between any two entities, where one is always the indication of the citations scope (i.e. refscope) and the other can be any of the other entities (i.e. aauthor, awork and refauwork).#p5Once captured, citations need to be disambiguated: this is done by assigning to each citation its corresponding CTS URN. What this means in practice is that, for instance, the citation Hell. 3.3.1-4 of the example showed in Fig. 2 (no. 3) is mapped to its corresponding URN, urn:cts:greekLit:tlg0032.tlg001:3.3.1-3.3.4.Designed to become the equivalent of canonical citations in a digital environment, CTS URNs are a kind of identifiers that follows the Uniform Resource Name standard and was developed within the Multitext Homer project as part of the CITE architecture to make it possible to identify and retrieve digital representations of texts (Smith and Blackwell 2012)2.#p6A Knowledge Base of Canonical TextsNER systems of this kind typically require and rely on a surrogate of domain knowledge, such as a gazetteer or a knowledge base, to support both the extraction and disambiguation of NEs. To support the disambiguation of canonical citations such a knowledge base needs to contain, for example, all possible abbreviations of the name of an author or the title of a work, possibly in multiple languages if working on multi-lingual corpora.Since the texts we are dealing with are canonical it is possible to use this knowledge base to store, in addition to abbreviations, detailed information about the citable structures of each text such as, for example, how many books are contained in Thucydides Histories, how many chapters are contained in book 1 etc. Being able to query this sort of information allows one to validate the automatically extracted citations, thus making it possible to identify, if not to recover, those citations that are just impossible.An example of this phenomenon is the string Thuc. 5. 14. 1. 41.: although it looks as a plausible citation, it is not a valid one as the work here referred tou2013Thucydides Historiesu2013is made of three, not four, citable, hierarchical levels, (i.e. book/chapter/section). Such errors are very common when working with OCRed texts where the lack of structural markup causes, as in this case, the footnote number to be mistakenly interpreted as being part of the canonical citation Thuc. 5. 14. 1.#p7The content in the knowledge base is structured mostly using a combination of CIDOC-CRM and FRBRoo ontologies3: the Functional Requirements for Bibliographic Records (FRBR) model, in particular, is suitable for modelling information related to Classical (canonical) texts, as was showed by Babeu et al. (2007, ref), and has influenced substantially the design of the CTS protocol. In those few cases where these ontologies did not suffice to model the data we have extended some of the classes they provide in what we called the HUmanities CITation Ontology (HuCit)4.#p8As shown in Fig. 3 our record is linked to a record in the Perseus Catalog; the CTS URN associated with the work as well as the abbreviations of its title are explicitly modelled by using respectively the CIDOC-CRM classes E42_Identifier and E41_Appellation. #p9Publishing Extracted Citations as Linked Open DataNot only are canonical citations important because of their function, they are also interesting artifacts in themselves. They were designed, well before the advent of digital technologies, to refer to texts in a very precise and interoperable way: precise because texts are the fundamental object of philological research, therefore a scholarly discourse about texts needs an accurate way of referring to them; interoperable because although texts may exist in different editions and translations, scholars need to be able to refer to specific sections of them without having to worry about the many possible variations in pagination or layout each single edition may present.#p10If we accept that canonical citations are already a way of linking objectsu2013i.e., the citing text and the cited textu2013extracting citations reconstructs and makes explicit links that already exist in the text. The act of transforming citations into hyperlinks, however, may lead to a misrepresentation of their nature and specifically of their being designed to be interoperable: a canonical citation should not be tied to the referenced passage in a specific edition, but should rather work as a resolvable pointer, that can be resolved to a given portion of text in any available edition or translation.#p11Let us now consider how extracted citations are stored and published online as Linked Open Data (Heath and Bizer 2011). By following an approach that was largely inspired by the Pelagios Project5, extracted canonical citations are represented as annotations as defined by the Open Annotation Data Model6 (see Fig. 4). A new annotation is created for each extracted citation: the string containing the citation becomes its label, whereas the citing and the cited texts become respectively its target and bodyu2013to use the OAC terminologyu2013as expressed by the oac:hasTarget and oac:hasBody properties. The property oac:motivatedBy is used here to clarify the reason for creating such annotations: I chose oac:identifying as, in fact, extracting citations can be seen as the act of making explicit what is the object (i.e. text section) that is identified by a given citation.#p8The RDF fragment that is returned when the body URI is resolved (see Fig. 5) shows how the citation is not linked directly to the digital text but points to an intermediate object called hucit:TextElement7. This abstract object identifies a citable element within the hierarchical structure of a text and is linked via the hucit:resolves_to property to digital representations of the cited passage, in this case the editions and translations available in the Perseus Digital Library and via the Classical Works Knowledge Base (CWKB) resolution service.It must be pointed out, however, that linking to these resources is not, strictly and technically speaking, LOD-compliant as these URIs do not resolve (yet) to an RDF representation of the resource identified by the URI. However, as it has emerged clearly during the LAWDI event at which this paper was presented, linking resources together is the first necessary step to LOD, that it is hoped will be followed by making the underlying technology compliant with the LOD principles. ISAW Papers 7.24 (2014)Mining Citations, Linking TextsCanonical citations are the standard way of citing primary sources (i.e., the ancient texts) in Classics: the ability to read them, which requires knowing what numerous abbreviations stand for, is part of the early training of any classicist.Having an expert system to capture automatically these citations and their meaning is one of the aims of the project of which the research presented in this paper is part. The desire for such a system has existed for a considerable amount of time (Crane, Seales, and Terras 2009, 26) but has yet to be solved (Romanello, Boschetti, and Crane 2009; Romanello 2013). #p1Such a system has great potential both for scholars in Classics and for the study of Classics as a discipline: capturing the citations of ancient texts that are contained in journal articles, commentaries, monographs and other secondary sources, allows us, for example, to track over time how and how often texts were studied, essential pieces of information for a data-driven study of the discipline and its evolution. #p2Another possible use of the system is to display related bibliographic references within a reading environment for ancient texts. The examples that are used in this paper are taken from work that has been done to provide the GapVis interface of the Hellespont project1 with such a functionality (see Fig. 1).One of the goals of the project is to create an enhanced virtual reading environment for one specific section of Thucydides Histories, the so-called Pentecontaetia (Thuc. 1,89 to 1,118).The references that are displayed in the secondary literature view of the reading interface are mined automatically from JSTOR and are shown together with links to the full text of the journal article as well as to the cited passage in the Perseus digital library (Romanello and Thomas 2012). #p3Mining Citations: Extraction and DisambiguationExtracting citations requires performing two different tasks. First, the strings that constitute the citation are captured.Second, the referent of that citation is establishedu2014the specific section of text to which the citation refers.In Natural Language Processing (NLP) jargon these two steps are called respectively Named Entity Recognition (or extraction) and Named Entity Disambiguation. #p4My approach to citation extraction (see Fig. 2, no. 1 and 2) is essentially based on state-of-the-art NER techniques with the only difference being what it takes to adapt these techniques to the new domain (Romanello 2013). Instead of considering only the usual named entities (NEs)u2013such as names of people, places and organizationsu2013I treat as NEs the different components of a citation in addition to any mention of ancient authors and works occurring in the context that surrounds the citation itself.For this purpose four distinct entities were identified: aauthor, awork, refauwork and refscope.In its current definition, a citation is a relation between any two entities, where one is always the indication of the citations scope (i.e. refscope) and the other can be any of the other entities (i.e. aauthor, awork and refauwork). #p5Once captured, citations need to be disambiguated: this is done by assigning to each citation its corresponding CTS URN. What this means in practice is that, for instance, the citation Hell. 3.3.1-4 of the example showed in Fig. 2 (no. 3) is mapped to its corresponding URN, urn:cts:greekLit:tlg0032.tlg001:3.3.1-3.3.4.Designed to become the equivalent of canonical citations in a digital environment, CTS URNs are a kind of identifiers that follows the Uniform Resource Name standard and was developed within the Multitext Homer project as part of the CITE architecture to make it possible to identify and retrieve digital representations of texts (Smith and Blackwell 2012)2. #p6A Knowledge Base of Canonical TextsNER systems of this kind typically require and rely on a surrogate of domain knowledge, such as a gazetteer or a knowledge base, to support both the extraction and disambiguation of NEs."
}