{
  "articleId": "isaw_paper7_15",
  "text": "ARTICLE_ID: isaw_paper7_15\nISAW Papers 7.15 (2014)Coinage and Numismatic Methods. A Case Study of Linking a DisciplineAndrew Meadows and Ethan Gruber11.The OpportunityAs a type of evidence for the ancient world, coinage is unique.Coins are monetary objects, and thus a key element in modern attempts to reconstruct the workings of the ancient economy.For example, through the process of u2018die-study it is possible to determine with some degree of accuracy how many dies were used to strike a given coinage. This provides us with a way to quantify ancient monetary production.Since coins can also be attributed to particular rulers or cities with some degree of certainty, this makes it possible to ascertain the monetary output of different cities, kingdoms and empires, and to compare them with one another.There now exists a substantial body of scholarship devoted to the estimation of size of production, but comparatively little as yet to its broad analysis or representation in interactive media such as timelines or maps.2#p1Coins are also archaeological objects in that they have find spots. Coins within archaeological contexts have much to tell excavators about the contexts they are digging, but also more broadly about the monetary profile of the site they are excavating compared to others of similar or different types; from multiple sites a regional history may emerge (see e.g.Reece, 1982).But find spots also give coins a trajectory.If we know where a coin was made and where it was found, we have evidence for movement, connectivity and economic circulation (see Map 1).#p2Few archaeological objects from antiquity can be mapped from source to deposition with such certainty as coins, and yet again we are only beginning to exploit the possibilities of this evidence in analytical and representational tools. Moreover, with the advent of the metal detector, individual coin finds and their recording are no longer confined to excavation material.The Portable Antiquities Scheme in the United Kingdom, for example, now has recorded find spots for some 283,000 coins (Pett this volume; see Map 2).Already it is leading to new works of synthesis (e.g.Leins, 2012; Walton, 2012), but again work is just beginning. Only when it becomes possible to compare data sets across multiple modern source countries will it become possible to write the larger monetary history of ancient imperial spaces.With other coin-finds projects in other countries beginning to come online (see e.g. http://www.ecfn.fundmuenzen.eu/Partners.html), it will not be long before the quantity of such material available enters the realm of Big Data.#p3Unlike most other forms of archaeological evidence, coins are official objects: their designs and inscriptions can tell us about the intentions of their issuers and, perhaps, the preconceptions of their users (See eg. Fig. 1).The iconographic and epigraphic repertoire of ancient coinage is a huge, and substantially un-mined resource for examining areas from local religion to imperial economic policy; from individual political ambition to communal statements of identity.And there is scope here, as recent work has shown (Kemmers, 2006; von Kaenel and Kemmers, 2009), to marry the evidence from findspots to that of the iconography of the objects, to expose patterns of administration invisible from other sources. Fig. 1.Reverse of a denarius of Augustus depicting a Cippus inscribed: S(enatus) P(opulus)Q(ue) R(omanus) IMP(eratori) CAE(sari) QVOD V(iae) M(unitae) S(unt) EX EA P(ecunia) Q(uae) I(ussu) S(enatus) AD A(erarium) D(elata) E(st). (American Numismatic Society:http://numismatics.org/collection/1944.100.38334) Finally, there is the sheer quantity of material that survives.As we have already noted, the United Kingdom PAS scheme after 16 years of recording contains information on 283,000 coins, and the rate of discovery, and thus growth of material is not yet showing signs of abatement. This is just one country.Initiatives exist to record individual finds as well as hoards in numerous other European countries.Moreover, the collections of Museums - both local and national - raise the numbers of coins available for study literally into the millions (Callatau00ff 1997b).To these sources we must add also those coins that appear in commerce every year, to a large extent since c. 2000 online (eg. Fig. 2).3 Fig. 2 The first of 101,546 results for a search for u2018denarius in the Coinarchives Pro subscription website (http://pro.coinarchives.com/a/results.php?search=denarius&firmid=&s=0&upcoming=0&results=100) Numismatic material thus presents an exciting set of opportunities to address questions unanswerable through other source material, and to do so with substantial quantities of data, a significant amount of which is already available online in a variety of forms. 2. The problems However, in the sheer volume of data, and its location in a variety of institutional and non-institutional settings lie two of the the principal barriers to its exploitation.Many, many coins are described online, but they are described in different systems, in different formats, according to different standards, with different aims and in different languages (compare figs. 3.a-d).Fig. 3a. Tetradrachm in the name of Alexander the Great, mint of Alexandria.Bode Museum, Berlin, online catalogue (IKMK). http://www.smb.museum/ikmk/object.php?id=18202968 Fig. 3b.Tetradrachm in the name of Alexander the Great, mint of Alexandria. ANS, New York, online catalogue (MANTIS). http://numismatics.org/collection/1944.100.35623 Fig. 3c.Tetradrachm in the name of Alexander the Great, mint of Alexandria. Bibliothu00e8que Nationale, Paris, online catalogue (Gallica). ark:/12148/btv1b8476481p http://catalogue.bnf.fr/ark:/12148/cb417462537 Fig. 3d.Tetradrachm in the name of Alexander the Great, mint of Alexandria.Freeman & Sear, sold 4.i.2011. (Coinarchives): http://pro.coinarchives.com/a/lotviewer.php?LotID=391000&AucID=707&Lot=32 To add to the complexity, numismatics has its own way of describing numismatic objects, necessitated by and tailored to features specific to coinage. Coins, for example, have two sides, both of which must be described.They are both pictorial and textual.Physical characteristics such as material, weight, diameter and the relationship of the heads to tails (obverse to reverse) directions (axis) can be recorded.Coins have denominational systems that vary with time and place; and those times and places may require systems of chronology and geography that vary from standard, modern formats: u2018154/3-153/2 BC, u2018first quarter of the second century, u2018Byzantium, u2018Constantinople. And there is a vast array of information about individuals involved in the production of coinage, whose names and titles may vary over time, but in any case probably find no easy analogue in any other discipline: u2018Augustus, u2018Octavian, u2018Tresvir, u2018moneyer, u2018die-engraver.And, in a further twist, it is often necessary to record not just the details of an individual coin, but also its relationship to others. This may be in the context of its circumstances of discovery, a taxonomic arrangement, a commercial transaction, or its current physical disposition. 3.Solutions: Creating a Linked Discipline Fig. 4 The linked nature of Numismatic Study Coinage is thus a rich source for the study of the ancient world, and the study of Roman Imperial coinage in particular is now well established in the print medium. Roman numismatists have, over the past century divided their discipline into four discrete areas of study.The basic structure of Imperial coinage has been the focus of a type corpus known as Roman Imperial Coinage (RIC).This is now complete in 10 print volumes, and provides a basic description of each of the 40,000+ recorded varieties of the coinage.It is the standard reference work for all who catalogue and publish Roman coins in any context. These contexts may be divided into three separate types, which have formed the subject of the other three areas of focus of numismatic study: collections, hoards and individual finds.Roman coins exist in the hundreds of thousands in the major public collections across the world.Hoards (coins buried together in Antiquity) are found today in astonishing numbers across the former territory of the empire. Single finds are similarly common, both within archaeologically excavated contexts, where their scientific value is enhanced, or as chance or metal-detector finds.As Fig. 4 describes, all four of these areas of study are fundamentally interlinked since collections may contain hoards and single finds, and any coin from any context must be described by RIC type for it to be properly published and usable in historical synthesis. In a very obvious sense, therefore, Roman numismatics is a prime candidate for the introduction of Linked Data approach to the entire range of publications required by the discipline.In 2011 the American Numismatic Society began, in collaboration with a number of strategic partners, the process of developing the necessary infrastructure for the creation of Linked Roman Numismatic Data.In part this built on existing initiatives and in part it required the establishment of major new projects. a. Vocabulary and Ontology A key element of this infrastructure are the stable URIs required to describe numismatic concepts.As noted above, there are elements of coin-description that are peculiar to numismatics that require a tailored approach to the creation of a discipline-specific vocabulary.Here we were able to harness a project (http://nomisma.org/) established by Sebastian Heath and Andrew Meadows in 2010 to provide stable digital representations of numismatic concepts in the form of http URIs that also provide access to reusable information about those concepts, along with links to other resources. This allows us to build a graph of Roman coin data that is linked within Roman numismatics by the use of discipline-specific terms such as denominations (eg http://nomisma.org/id/denarius) or mints (http://nomisma.org/id/lugdunum), but also allows us to join the broader graph of ancient world data through the use of common identifiers such as Pleiades URIs (e.g. https://pleiades.stoa.org/places/167717), and indeed a broader graph still through links to such resources as wikipedia (e.g. http://en.wikipedia.org/wiki/Lugdunum) or geonames.org (e.g. http://www.geonames.org/2996944/lyon.html). By this simple decision we were able to ensure, in theory at least, the integration of numismatic data within the field of Roman numismatics, but also the permeation of numismatic material into other fields of study.The launch In July 2013 of a revised nomisma.org system, based on Apache Fuseki,4 with a SPARQL endpoint and improved APIs, has allowed us to integrate nomisma IDs fully into a number of numismatic projects. b. A Type Corpus The existence of a full print corpus of Roman Imperial coinage (RIC) provided a ready-made framework for the creation of an online type corpus. In 2011, therefore, a project was established jointly by the ANS and New York Universitys Institute for the Study of the Ancient World (ISAW) to build an online adaptation of this resource on the principles of Linked Data.This project benefited from head-starts in two areas.First the resource for the creation of necessary URIs existed in the nomisma.org project; and second, the collection database of the ANS (http://numismatics.org/search/) already contained the descriptive elements of approximately one third of the c. 50,000 known types of Imperial Coinage. From these two resources we were quickly able, with technical implementation by Gruber and data under the management of Dr.Gilles Bransbourg, to establish Online Coins of the Roman Empire (OCRE: http://numismatics.org/ocre/), a type corpus of Roman coinage.As work has progressed on the creation of type records within OCRE, so we have created the nomisma.org URIs necessary for their description.The Linked Data approach we have taken to the creation of OCRE has a number of obvious payoffs. An attractive feature is that by providing alternative names for all nomisma.org concepts in multiple languages, we have been able quickly and easily build a mutlilingual interface (compare Figs. 5a and 5b), derived from SKOS-defined preferred labels in RDF extracted real-time from nomisma.orgs APIs.To date eleven languages are supported: English, French, German, Spanish, Italian, Greek, Russian, Bulgarian, Romanian, Swedish and Dutch). But the advantages to the Linked Data approach run deeper too.Where the Roman Imperial Coinage type corpus can do nothing but describe the types themselves, and illustrate a single representative example of a selected few types, OCRE has the power to link to multiple examples of a given type from multiple contexts.This opens up huge new possibilities for research.Fig. 5a. OCRE browse page displayed in English Fig. 5b. OCRE browse page displayed in Greek c. Type corpus to hoards In parallel to the development of OCRE, the ANS has also been working with Dr Kris Lockyear of the University College Londons Institute of Archeaology to create (with implementation again by Gruber) an online database of Roman Republican coin hoards (CHRR: http://numismatics.org/chrr/).5 This is based on Dr Lockyears personal research database (originally in MS Access: see Lockyear 2007), which is a substantially enlarged version of a print volume (Crawford 1969). Although the bulk of the contents of this database are not directly relevant to the issues of the Imperial period represented in OCRE, the coin types defined in Crawfords corpus, Roman Republican Coinage, are defined as concepts in nomisma.It is therefore possible to extract machine-readable data about these types from nomisma in order to render HTML pages, KML for maps and timelines, or to facilitate quantitative analyses. Moreover, while the majority of the hoards recorded in CHRR are from the Roman Republic, a significant number of the later hoards (about 10% of all hoards in the database) do contain issues of the Imperial period.Since we have used nomisma.org identifiers within CHRR, it has been possible both to enrich the CHRR database with type descriptions from OCRE (see eg.Fig. 6a), but also to enrich OCRE with findspots derived from the CHRR database (see eg. Fig. 6b).From the interrelationship of these two projects, the benefits of the utilization of stable URIs of everything from findspots, to coin types becomes immediately apparent.Fig. 6a. OCRE typological data deployed in the description of the contents of the Cetateni (Romania) hoard (http://numismatics.org/chrr/id/CET) Fig. 6b. CHRR findspot data for Roman Imperial Coins type Augustus 2B deployed in mapping interface in OCRE (http://numismatics.org/ocre/id/ric.1(2).aug.2B?lang=en) d. Type corpus to collections There are also obvious benefits to establishing links from OCRE typological records to individual specimens housed in public collections.The practice of assigning unique URIs to individual objects, now recommended by the International Council of Museums (ICOM: http://www.cidoc-crm.org/URIs_and_Linked_Open_Data.html), and adopted by the majority of major collections, allows for stable connections to be built between those objects and OCRE typological records that describe them. So, for example, a coin type record within OCRE can link to multiple instances of that coin type held in multiple collections.Fig. 7, for example, shows the OCRE record for RIC Augustus 4B, with references to 6 specimens of the type: 4 in the collection of the ANS in New York and 2 in the collection of the Coin Cabinet of the Bode Museum in Berlin.Fig. 7.Multiple specimens of a coin type referred to an illustrated within OCRE. Through the ingestion into OCRE of the specific characteristics, such as weight or die axis, of each specimen it is possible to create tools to analyse the characteristics of individual types or of coins issued in particular places or by particular emperors (see Fig 8a).Analysis can also be carried out, needless to say, on the generic characteristics of types using a similar set of set of filters. See, for example, Fig. 8b, which compares the frequency of the depiction of deities on the coinages of Augustus and Nero.Fig 8a.The weight of denarii linked to OCRE struck from AD43-135 Fig. 8b. OCRE-generated comparison of coin types of Augustus and Nero. e. OCRE to coin finds Given the huge numbers of coins that are now being recorded by schemes across Europe, there is obviously huge potential to ingest the details of these coins into OCRE. In this case it is not just the physical characteristics of the specimens concerned, but also their find spots which serve as the basis of enhanced analysis through mapping.Fortunately the price of admission to the Linked Data community for Roman numismatics is low.Existing projects, with, in some cases, well developed and longstanding databases of finds do not need to change their recording practices or software. So long as their data can be mapped to nomisma URIs when it is exposed to the web, then it may enter the graph of numismatic data on the web.Already the UKs Portable Antiquities scheme is using nomisma.org URIs.The database currently under development in Germany for the recording of finds there, in Poland and the Ukraine will also use nomisma.org URIs.In time, all of this data too will be available to OCRE. And the exchange of data is potentially, also, a two-way street. OCRE type descriptions are fully and freely downloadable, and may serve to populate other databases, without the need for their creators to redo the work of cataloging that has already gone into the creation of the OCRE record.Just as now few librarians catalogue books from scratch, so in the future there will be little need for the cataloguer of coins to generate new descriptions of coins long known. f. Linked Open Data Architecture, Applied How does Linked Data help in technical terms?The most efficient method for maintaining the relationships between coin types in OCRE and their associated coins and hoards is with the use of an RDF database and SPARQL endpoint. OCRE directly queries the endpoint with SPARQL to deliver some types of services.In other cases, OCRE interacts with REST APIs offered by nomisma (simple web service interfaces which conduct more complicated SPARQL queries in the background). The second, SPARQL-aware version of OCRE was released in October 2013.6 The RDF requires three components of data: first, RDF representations of coin types, second RDF descriptions of physical coins or coin hoards, and finally, the RDF data from nomisma.org, which enables links to be made from typological attributes (e.g., http://nomisma.org/id/ar for silver coins or http://nomisma.org/id/augustus for those of Augustus) between types and coins/hoards. The RDF model conforms to the numismatic ontology established by nomisma.It is relatively simple, especially compared with CIDOC-CRM, and lowers the barrier for participation in OCRE.To date, Berlin, the Fralin Museum at the University of Virginia, and CHRR have joined the ANS in contributing data into OCRE.We can see the relationship between u2018ideal type description and individual specimen more clearly by looking at an example. The structure for RIC Augustus 1A is represented as an nm:type_series_item defined by the URI http://numismatics.org/ocre/id/ric.1(2).aug.1A.7 A relationship is established by the nm:type_series_item in the RDF model, below, associating object number 18207296 in the Berlin Mu00fcnzkabinett to Augustus 1A: The RDF contains a few metadata fields from Dublin Core (dcterms:title and dcterms:publisher) and a handful of Nomisma-defined concepts for encoding measurements (nm:axis, nm:diameter, and nm:weight). Image URLs are also recorded.Note that the RDF description of this object in the Berlin collection does not explicitly denote its material (silver), denomination (denarius), or other typological attributes.Like a relational database, an RDF database enables queries by these attributes by the association of the nm:type_series_item between the coin and the coin type.Practically speaking, how does this affect OCRE? Rather than updating records in OCRE when the collections of new partners become available, the RDF database stands apart, and thus it is easier to update Fuseki with new collections and manage changes or deletions in collections already contained in the system.Using SPARQL, OCRE (through the Numishare application code) can query Fuseki to display images of coins associated with particular types in record or search results pages. SPARQL query results can be serialized into KML directly and displayed in maps, making it possible to make use of findspots from online coin hoard catalogs (Fig. 7). Using mathematic functions inherent to SPARQL, average weights of coin types or specific typologies (e.g., denarii of Augustus) can be delivered to OCRE directly and rendered in the form of charts and graphs (Fig. 8a) by the Javascript library, Highcharts, which is capable of interpreting this data into HTML5 graphics.The updating of this RDF database is independent of progress made in adding new types into OCRE, and thus more findpots, images, and measurements become available immediately upon ingestion into Fuseki. Conclusion Roman numismatics and, indeed, numismatics more broadly is exceptionally well suited to the implementation of Linked Data model for the publication of collections, finds and reference works.There is much still to be done; but it must only be done once.Thereafter, all may benefit, at little or no cost, and with no need to surrender their own working practices.8"
}