{
  "articleId": "isaw_paper22_3",
  "text": "ARTICLE_ID: isaw_paper22_3\nIt is not unheard of for academics to make games (eg Huffer and Oxenham, Klaassen 2019, Edwards 2019, Hoy 2018).Most often, these games are created with pedagogical goals focused on a particular university course or wider outreach towards the general public (Rubio-Campillo 2020).Sometimes, these are games that are co-created with the students or developed with professional game-making teams.In some cases, already existing games are utilized within a larger game-based learning framework, such as McCalls u2018historical problem space framework (McCall 2020).In our case, we wanted to make a game that was first and foremostu2026. fun for us. During the fall of 2016, support from the OntarioBaden-Wu00fcrttemberg Faculty Exchange Programme enabled the three of us to come together.The original plan was to develop a computational simulation that drew on our complementary research strands in Roman economic history, archaeology, and computationdigital humanities.Our intention was to build a series of agent-based simulations to explore and make explicit aspects of Roman economic historyhistoriography that normally are not formalized (Brughmans et al. 2019). However, sometimes plans do not come together and for a variety of reasons, the computational aspect of our work could not be attempted.In which case, we asked ourselves, how can we approach computational simulation when we do not have a computer?If we think of agent-based simulations as a kind of video game that plays itself (Graham 2017), and a video game as being a game where the rule-keeper, the referee, has been automated, then it follows that at the roots of both gaming and computation is a board game, where the u2018computer is (as the word originally meant) the humans that compute. A board-game-as-simulation removes the impartial computational referee, and forces the players to interpret, understand, and contest the formalization recorded in the rules of the game. A board game is therefore a kind of 'analog simulation' (Whitely, 2016; see also Kaufman and Flanagan 2013 on the perception of complexity in digital versus analog games), in that it aims to represent a dynamic process in an abstracted and simplified way. However, in contrast to a computer-based simulation it admits a lot of noise in the definition and operation of these processes. A board game is also a valuable pedagogical tool in that it enables and encourages players to challenge the rules, or even, re-write the rules free from the tyranny of algorithms typical for any computer-based programme (Huffer & Oxenham 2015).For example, Loring-Albright 2015 asks with regard to the popular tile-laying game Settlers of Catan, u2018where are the Indigenous residents of the island of Catan? and uses that question to guide the design of a complete modification (mod) for the game that highlights the dormant issues of settler colonialism embodied by the original game. If the u2018rules encode the historiography of a phenomena under consideration, then one can see what a challenge a playful approach to the past presents.This is where we found the fun in building our game.You might even call it a u2018serious game.Board games as analogueanalog simulationsSimulation is a common scientific technique used in a variety of disciplines, including archaeology (Romanowska et al. 2019). They are valuable in two distinct ways.First, the creation of a simulation forces a formalization, an operationalization, of what we believe to be true about the past (Graham and Weingart 2015; Premo 2006).If we write, many Romans attempted to improve their lot in life through attachment to the household of a higher status individual, a modeler would ask, 'what does 'attachment' mean?How was the status measured? What benefits does an 'attachment' bring?How much does one gain from attachment?Was it possible to attach oneself to multiple households?' and so on.This type of formalisation works best when it is focussed on a limited number of phenomena.With too many variables one risks losing the ability to track what is causing what in the model (Bullock 2014).The second valuable aspect of simulation is that it enables us to 're-run' history under different conditions, recreating the landscape of possible emergent outcomes this model of the past implies. Simulation forces us to formalize what we believe about the past; and it allows the consequences of those formalizations to be systematically explored.The job of the modeler after running the simulation is to compare the space of possibilities with the evidence of what has actually happened in the past and to first, identify these pasts that even if plausible were unlikely to have happened, and second, to explore the landscape of those that were possible (Romanowska 2015). This process enables us to spot the errors in our initial beliefs of how the past was and to better understand the possible pasts.As we embarked on thinking through our research questions, our normal simulation methodology of coding computational models was moved into an analog context, with pen and paper and eventually a cardboard map and little wooden u2018meeple to simulate the interlocking worlds of trade and prestige in the Roman world, around the era of the Early Empire (Figures 1u20134). We began by studying games whose underlying mechanics seemed to us to be close to the ideas we had about Rome u2014 but we first had to agree on what it was we understood a networked-influenced economic vision of Rome looked like.Ironically, given the world-wide pandemic that erupted a few years later, we took a lot of inspiration from the co-operative board game Pandemic.We expressed this understanding as a series of procedures sketched out on a whiteboard and a flipboard which we would then play through, trying to understand which ideas we were leaving tacit and so needed to be explained better (see Fullerton 2019 for a similar approach complete with examples from popular games). Within the serious games literature, this process is also analogous to u2018storyboarding, which should be understood as the u2018anticipation of human experience (Jantke and Knauf, 2012, 401).Figure 1 Brughmans, Brughmans, Brughmans, and Graham working on the game.Figure 2 Writing out Netlogo agent based modeling pseudo-code to capture our understanding of how the phenomena we wished to render playable worked.```to setup - set $ =100 - set family_cards = 3 - shuffle fate_cards - set prestige = 0 - roll dice to see who goes first (order of play then clockwise)end to go - move-agents - social-intrigue - trade - build-horrea - draw-fate-cards - check-for-victoryend to move - if n_of_agents_available < 4, roll-to-activate (if dice_roll >= 4, hatch-on-rome) (pass) - ask agents If desired (move 1 to link-neighbors)end```Figure 3 The high-level procedures of the game, expressed as pseudo-code.Figure 4 The prototype for the board, and the completed version by Ian Kirkpatrick (httpswww.iankirkpatrick.ca).The result was FORVM Trade Empires of Rome, where you play a senator (an aristocrat) based in the city of Rome who aims to advance their political career and establish a trade empire. With FORVM, we aimed to highlight the integration, impact, and interplay of both physical transport networks and social networks, as well as the interwoven roles of money and prestige, in the formation of Roman political life.The GameFORVM is a board game based in the Early Roman Empire (httpwww.forvm.ca).It highlights the integration, impact and interplay of both physical transport networks and social, communication networks between traders, as well as the interwoven roles of money and prestige in the highest echelons of the Roman Empires nobility.The game is composed of a board depicting the main urban centres of the Roman Empire connected with a transport network. The world is divided into four provinces, broadly reflecting different regions of the Roman Empire.Each player has at their disposal four commercial agents, serving as their representatives, some initial starting capital and two family members who can be used to form alliances with other players.The final objective of a player is to obtain 15 prestige points, that is, rise to the rank of a consul. The player that achieves it first wins.The game consists of eight phases in each turn.First, players place and move their commercial agents between the cities on the board, who can then build horrea (warehouses) to receive profit from the citys trade.Although multiple horrea can be built in a city, having competition seriously reduces the profit.The total profit depends on the agents location, the rank of the city (larger cities are more profitable) and its location in respect to Rome (the further the city the less of a profit, unless it is an exotic market). Players also engage in social intrigue, by ousting other players' agents from the markets, or marrying their children to forge alliances.Finally, a certain amount of randomness is introduced to the game through Event Cards carrying positive or negative news to a player and Fate Cards which change the game rules and conditions in the subsequent turn.The players follow the turns trying to optimise the profit, which translates directly into prestige. They can also purchase a limited number of prestige-carrying benefactions, such as building a temple, holding games or donating food.There are additional means of increasing the prestige, such as building the first horrea in a province or having five horrea within one province.Players can achieve the goal (15 prestige points) through many different means u2014 either through investing in particular trade routes, spreading over different provinces or investing in benefactions.Historical and Archaeological FrameworkFORVM is based on current theories of the functioning of the Roman economy (Brughmans and Poblome 2016; Carrignon et al. 2020; Graham and Weingard 2015). The Roman Empire in the first centuries AD spanned a huge area from the British Isles and Spain in the west, to Egypt and Syria in the east.Despite its size, goods produced in all corners of the empire as well as exotic goods from outside the empire were available on markets throughout the empire.No market was more important than that of the capital of Rome (for a discussion of Rome's distorting effects on the socio-economics of Empire, see Temin 2001, Morley 2002, Bang 2006, Bang 2008, as well as the work of Bowman and Wilson 2009). The city had a huge population that constantly needed to be supplied with all manner of foodstuffs, utilities and luxury goods most famously depicted in the Book of Revelation chapters 17 and 18 as the Whore of Babylon, eating the resources of the world.The board represents a stylized map of the lands controlled by Rome in and around the first century CE, with bespoke artwork by Canadian artist Ian Kirkpatrick. Projected onto this map is a network representation of interurban connections (derived from the Stanford ORBIS map, (Scheidel 2015)).The more distant from Rome a location, the greater informational uncertainty and hence riskrewards for controlling trade to that location.Each player assumes the role of a Senator; by moving agents around the networked representation of space, issuing orders, forgingdisolving familial relationships with other players, and responding to chancehistorical eventsfate cards, players receive varying returns on their investments in trading infrastructure, that may be parlayed into euergetism back in Rome. As players gain prestige through wealth or other means they progress through the different stages of the cursus honorem, culminating in a Consulship. (The u2018cursus honorem was the sequence of public magistracies that made up the political career of an elite Roman).Aristocrats were not directly involved in trade themselves.That is to say, they at least did not want to be seen as being commercial moneymakers. But it is clear that commercial interests and profits were key to the accumulation of the aristocracy's riches.This is why in FORVM you work through a group of commercial agents who act as your representatives.They follow your orders to establish warehouses to supply for the demand in tradable goods in different markets around the empire.The size of the empire and the limited communication and transportation technologies available in Roman times mean that the physical distance between markets was a real barrier. It took commercial agents a certain amount of time to move goods between Rome and other markets.This is reflected in the lower profits the further you move away from Rome in the transport network representing the roads of the empire the longer the travel distance from Rome, the higher the transportation costs (cf.Bang 2007, Morley 2007).You also support your agents by ensuring they are well informed about the prices, supplies and demands of goods in different markets around the empire. The physical distance between markets in the huge Roman Empire affected the availability and reliability of commercial information current at different markets.It was key to establish reliable social networks between commercial agents to ensure they could remain well informed about current prices and could get the best deal at different markets outside Rome (see for instance the work of Laurence 2002 on 'space-economy'). In FORVM, this is reflected in the trade boost agents at markets with a warehouse get if you also have an agent and a warehouse in Rome. A secure communication link is established between your home base in Rome and your warehouse in a province.Your agent there is better informed and consequently can get a better deal at the market.This trade profit boost mitigates the money lost through transportation and makes trade more profitable.The Roman social interactions, of patronage and client-ship, depended on seeing and being seen to have economic power, wealth and influence. Traditionally, these prestige games played out in the ritual of the morning salutatio where clients presented themselves to their patron each morning; patrons would receive clients in the order of their importance.The procession to the Forum on any given morning of a patron with his clients was therefore an opportunity to signal to others the number and quality of one's clients and hence likely political power. In FORVM a player's prestige and their current wealth is prominently displayed on the board, so that players can take into account others' wealth and standing as they formulate their strategies.Similarly, the Roman aristocracy could signal their power and prestige by their ability to command resources for the construction of temples or other urban architecture.This 'competitive building' reached its apotheosis in the urban renewal and building projects of the late Republic, but of course it could also find its outlet in the renovation of temples, basilica, and so on, or in donations of food, or the giving of games (overview in Wallace-Hadrill 1989). Players mimic this process through the purchase of benefactions, whose limited number makes them compete over the ability to show their wealth and prestige to all of Romes inhabitants.Similarly, marriages and strategic divorce was a weapon that elite Romans wielded to great effect, to heighten prestige, to enable advantage, or compel lesser individuals to bend to the patron's will.Roman marriage is an extremely complicated institution, and depends very much on the social context of the individuals involved. In the game version that we implemented, the 'children' of the player are pawns to be traded to protect interests or to obtain advantages.The dissolution of marriage carries consequences that broadly are in line with what we know about the marriages and divorces of high ranking individuals (on Roman marriage see Gardner 2008).As we play-tested the game, with the help of graduate student Elise Bigley, we tweaked rules to ensure a balance between playability and fidelity, debating and unpacking our ideas about Roman economics as we went. Like how we imagine our ideal players might do, we challenged our own rulesets to iterate towards a better understanding.And it was fun!Full disclosure Iza Romanowska won every game we played through.ConclusionIn the creation of a computational simulation, the manner in which a historical or social phenomenon is operationalized encodes the modelers' informed belief of how the past works it is a kind of procedural rhetoric (in Bogost's felicitous phrasing, 2007). In creating an 'analog simulation', the equivalent idea is in terms of 'playability'.Board games require balancing of both positive and negative feedback loops (and considering the consequences when various loops intersect, as in the consequences of 'fate cards', for instance) in order to create the particular dynamic where in any given play-through, any given player might win u2014 this is what we mean by playability. What makes the winner is the player's understanding of the rules, and their ability to deduce a winning strategy from the strategies of other players.We have made decisions at times in the writing of the rules where we considered multiple arguments about the past but chose to implement the idea we felt was the best compromise between faithfulness to how the Roman society operated and playability.#p44We expect that players familiar with the details of any particular element we have simulated will dispute the choices that we have made. We welcome this a simulation is a valuable tool to stimulate discussion and so when you find something that you feel strongly is the wrong choice on our part, we encourage you to re-write the rules, to challenge the algorithm, and develop (and justify) your own 'house' rules.Then consider the outcome of your game.How is it better?How is it worse?What does it do to your understanding of the past?Share your experience. Publish your thoughts.Mod our game.Simulation is a space, a landscape of outcomes.Exploring this space is what made building FORVM fun for us; challenging this space, re-writing it with the tools the game provides, might make playing the game fun for you.We look forward to hearing of your own explorations."
}