{
  "articleId": "isaw_paper18_3",
  "text": "ARTICLE_ID: isaw_paper18_3\nISAW Papers 18.3 (2020) Abstract: Magicians are powerful figures in ancient literatures. Although they are generally described as human, they can reach and share supernatural powers thanks to their secret, restricted knowledge of the written spells and for their skills in performing rituals. Magicians can be priests, wise men, local ritual experts, tricksters, outsiders or shamanic personalities, depending from the audience they address and their cultural and religious context. This paper will discuss the multifaceted role of magician in the ancient Egyptian society through the evidence given mainly by literary sources as well as by a number of non-literary spells and materia magica. Questions of definition and terminology employed in the sources to describe a magician will be taken into consideration, as well as the issue of gender and of the almost total lack of evidence for “witches” as a complementary literary figure in ancient Egypt. Magicians are powerful figures in ancient literatures all over the world, although defining what kind of ritual specialists can be called mágos,1 sorcerer, wizard or more generally “magician” (and their female counterparts) in a given historical context is not a simple issue. It implies a thorough understanding of a religious and social phenomenon, i.e., “magic,” a concept whose boundaries and usefulness is still debated among scholars, who continue to struggle to define its functions in the sphere of religious and ritual practices in different cultures, both ancient and modern.2 The common folkloristic stereotype of a magician as an individual who can manipulate evil and supernatural forces is not reflected in the historical records and the variety of figures who performed “magic.” Instead, we should consider such figures as “ritual specialists,” skilled in techniques of healing, protecting or binding, and harming through the use of rituals and spells.3 In Pharaonic and Graeco-Roman Egypt, such ritual specialists could operate in different contexts, from temples (as priests) to the towns and villages (as doctors, healers and the ancient equivalent of modern sorcerers).4 We have a substantial amount of evidence, material and textual, dating from the early Pharaonic to the Graeco-Roman period, that helps us to understand how magicians operated in ancient Egypt, in accordance to the primordial force and the god Heka, which is commonly translated as “magi c.”5 It is interesting, though, that the ancient Egyptian magical texts do not explicitly reveal much about the magician as an individual and a performer – either about his specific social identity or the way he was perceived by the beneficiaries or victims of the magic he was performing.6 However, the study of magical texts – both funerary and those intended for daily uses – is helpful for catching a glimpse of the socio-cultural context of magic. From them we can learn about the ritual tools used by the magician. Therefore, they provide precious information on the materiality of magic.7 Moreover, they often contain the ritual instructions for the magician to follow, shedding light on the magical and religious beliefs underpinning the magician’s performance.8 In this contribution, I will attempt to define the role of magicians in Egypt by integrating the information that we gain from literary texts with the descriptions of magicians’ activities coming from other non-literary, magical or ritual sources. The dominance and popularity of the genre of stories recounting the exploits of magicians is well known and particularly well studied in Demotic literature, with the narratives of Setne I and Setne II being the most famous examples (see also the contribution of Love). However, earlier texts provide very interesting evidence as well, and what follows is meant as an overview of the most representative of these texts. The role of the magician in ancient Egypt Who could actually be considered a “magician” in ancient Egypt? In English, the term “magician,” similar to its root “magic,” is rather ambiguous and elusive, since who is a magician, as well as what counts as magic, are in the eye of the beholder and depends on social recognition. The French sociologist Marcel Mauss offered the following description: “It is public opinion which makes the magician and creates the power he wields. Thanks to public opinion he knows everything and can do anything. If nature holds no secrets from him, if he draws his powers from the primary sources of light, from the sun, the planets, the rainbow or the depths of all water, it is public opinion which desires that he should.”9 This statement certainly applies to the ancient Egyptian cultural context of Heka and to the role that literature held as expression of a “public opinion” (though only on the learned, élite level).10 The most commonly encountered type of a magician in literary sources is the priest in the temple. As is clear from the most common priestly titles, these temple magicians could also act as compilers and performers of magical spells and rites. The ḫry-ḥb, literally the “carriers of the scroll,” were the “lector-priests” reciting incantations and hymns during temple rituals and within private contexts (e.g., funerary, apotropaic, daily magic, etc.). They played an important role and were very popular during the entire Pharaonic period and even mentioned in the Bible as example of ancient Egyptian magicians. In particular, the “Chief Lector Priest” (ḫry-ḥb ẖry-tp or in its abbreviated form ḫry-tp; Khery-heb-Hery-tep/Hery tep) indicated a ritual expert in magical practices,11 and is a title attested from as early as the Old Kingdom to until Late Antiquity (roughly 2,700 bce – 500 ce). The same title is transcribed as hartibi in a neo-Assyrian document listing the court personnel, probably under Esarhaddon (661–669 bce), where it was used to describe foreign Egyptian diviners, particularly “dream interpreters,” together with other kind of conjurers (asipu), as well as doctors and scribal specialists.12 In Hebrew, a very similar word to hartibi is used to designate the magicians of the pharaoh.13 In the diplomatic correspondence between Ramesses II and the Hittite court, a magician appears also in the role of an emissary to foreign lands.14 Both in Egypt as well as in Mesopotamia, lector-priests of the Hery-tep-type played a very important political role, since they were well educated and probably trained in the scribal school of the temple – the so-called “House of Life.” They were involved in royal expeditions as well. Literacy was important for a magician, if he was to be involved in political missions and travel outside Egypt. In Late Antiquity, for instance, we have reports of wise men performing miracles (i.e., possessing what we could call “magical skills” in a different historical context) such as John the Grammarian15 or Constantine/Cyril, travelling on foreign embassies, for example, to the Arabic caliphates and performing “miracles” there.16 With this type of the learned magician, religious authority and magic skills were complemented by the ability to participate in and sustain diplomatic discussions, displaying a deep philosophical and theological body of knowledge. The figure of the eloquent magician also occurs in literary tales of Pharaonic Egypt, in which the magician speaks in front of the king or happens himself to be the king’s son. In particular in certain tales, next to professional priests the king or the son of the king is a learned magician with a priestly title, therefore playing the same role of the literate priest (see below.) Similarly, in scenes of temple reliefs, kings are the are main actors together with deities, performing cult practices. Magicians as “good scribes” and “wise men” occur especially in the narratives of Setne I and II and in other texts of the Graeco-Roman period (332 bce – 500 ce). These show that from the Hellenistic period onwards, literate ritual experts continued to play important roles in the temple, as well as in private daily contexts. A second popular figure of magician was that of the swnw (sunu), namely a doctor or physician, who in many occurrences also bears priestly titles associated with magic. Moreover, a magician with medical skills could be simply called sȝw (sa.w), “protector,” mostly indicating a local healer or medicine man practicing at the village level, whereas the sunu practiced in a temple or royal context. The close and important connection between magic and medicine in ancient Egypt is evident from the numerous medical prescriptions mixed with incantations, as well as by the personification of illnesses as demons, which is common in ancient Near Eastern societies.17 Finally, we should also consider the existence of Heka as a force that could be manipulated by Heka-workers who could cast spells to harm someone for the benefit of their clients.18 Both magical and literary texts depict these hostile ritualists as foreigners, mostly coming from Nubia but also from Libya and Syria. However, it is difficult to assess if these figures of foreign ritual specialists were actually part of the ancient Egyptian society already in the early Pharaonic period or if the conception of an evil foreign magician, whose most popular example is probably the Nubian sorcerer in the Demotic story of Setne II, was merely a literary stereotype of a convenient bogeyman in entertaining stories.19 Did “witches” exist in ancient Egypt? We do not find mentions of the female ritual specialists who, in the Western world, would be thought of as “witches,” in either the ancient Egyptian literary or magical texts.20 However, foreign evil women, especially Nubian ones, do occur in the sources, typically opposed to the “good” Egyptian priest/magicians.21 In a few magical texts we find the mention of a rḫ.t, (Rekhet), literally “the one (female) who knows,” the verbal root rḫ (rekh) being widely employed in funerary and ritual texts to indicate secret, magical knowledge.22 From the sources, it seems that Rekhet-females can act both benevolently or malevolently in society. In Ramesside Deir el-Medina (about 1262–1069 bce), they may also act as midwives, seers or prophets.23 It would be tempting to compare the figure of a Rekhet-woman to that of the witch in Western folklore, but the evidence in ancient Egyptian sources is too scarce for such an assessment. However, we could supply examples from Near Eastern texts on female sorcerers. In a text dealing with a so-called Maqlu apotropaic ritual, a female magician (Kassaptum) seems to bewitch a victim.24 A number of Jewish texts also mention women accused of witchcraft. Although from the surviving ancient Egyptian sources we do not get any hint of an official prohibition on women doing magic. At least, we could assume that female figures similar to those depicted in Mesopotamia and in Jewish contexts probably operated in Egypt, too.25 It is also interesting to note that the masculine counterpart to Rekhet, which is rḫ.y, may be used for magicians in literary texts such as Setne I (for the magician Naneferkaptah). However, the title does not necessarily indicate a competence in magic. The term Rekhet can also be an epithet for goddesses such as Isis and Hathor.26 Deities in general, especially goddesses, play an active role in magical performances. In ritual scenes decorating temple walls, gods are depicted assisting the king, who could be considered in his active role of performer as the human ritual expert – the ultimate human magician.27 In some magical incantations, the gods are summoned up in order to assist and empower the human magician. Divine epithets can refer to their role in magic as well, the most popular one being Isis’s epithet wr.t-ḥqȝ.w, (Weret Heka.u) “great of magic,” which can also refer to a series of cobra goddesses.28 Deities and supernatural beings performing wonders may appear as visions to the protagonists of many tales in Egyptian literature as well, especially in tales of journeys such as The Story of the Shipwrecked Sailor or The Story of Sinuhe.29 Herdsmen as magicians Finally, it is interesting how even herdsmen could act as magicians, as shown in scenes carved on mastaba walls during the Old Kingdom (2700–2200 bce), such as those in the tombs of Ti and Mereruka. In these scenes, the men are depicted while protecting their herds from crocodiles emerging from the water. Besides explicit apotropaic gestures such as pointing the finger at the dangerous reptiles, they recite what are called “water spells” (ḥs.w-mw)30 to make the crocodiles blind and consequently not harmful: Crossing the canal by the cattle. Warding off death. Warding off the crocodile by the herdsman … May he come as a sightless one!”31 Herdsmen differ from the learned magicians (doctors and priests) since they possess a local, specific knowledge of only certain apotropaic spells against crocodiles. However, it has been noted by Robert Ritner how in most of these mastaba scenes depicting herdsmen physically performing magic through the apotropaic gesture of pointing out the finger, a standing or sitting figure with a priestly attitude is the one reciting the spell. This suggests that the written knowledge and the recitation of the spell belonged to a priestly specialist, while the herdsman only possessed the practical and performative skills for doing magic.32 In the literary tale of the Middle Kingdom (2055–1650 bce) known as The Story of the Herdsman, attested chiefly in a papyrus kept in Berlin (Berlin 3024), the reciters of the water spells are called “the knowledgeable ones among the herdsmen” (rḫ.w jḫ.t, literally “the ones who know things”), with a clear reference to priestly knowledge. The story also features a mysterious goddess who presents a danger to the herds. Magical vs literary texts on the role of the magician in ancient Egypt The Story of the Herdsman also includes a water spell on the model of those from the tomb inscriptions and depictions mentioned above, showing clearly how literary and magical texts can be interconnected. This water spell is especially interesting because it has a parallel in spell 836 of the Coffin Texts, which mentions the water spells as well as a “mistress of the land.” The latter recalls the mysterious apparition of the naked goddess in the marshes in the Berlin papyrus, probably in an allusion to rituals for appeasing the “distant goddess” (Mut, Tefnut, Sekhmet or Hathor), known from a few ritual papyri.33 In the literature of the Graeco-Roman period (332 bce–500 ce), especially in Demotic, it is a recognized fact that the scribes re-edited magical and religious texts. One of the most significant examples is the famous reference in Setne I to the amuletic spell of Pyramid Texts 254. However, there are also earlier literary tales which provide us with vivid descriptions of magicians whose speech and performance acts reflect a deep magical knowledge on the part of the authors. Papyrus Westcar, which is a masterpiece of Middle Kingdom literature, is another outstanding example of how closely magical literature was linked to fiction and secular texts. It contains a cycle of stories told by pharaoh Khufu’s sons on the marvels performed by the magicians of their times.34 Although this papyrus is dated to the Hyksos period around 1600 bce (right before the 18th Egyptian Dynasty, marking the start of the New Kingdom), it seems that the text has been composed in the 12th Dynasty (Middle Kingdom), while the story takes place much earlier in the 4th dynasty (Old Kingdom). Within the narrative of Papyrus Westcar, the apparent aim of the tales is the entertainment of the king; but they also function as a crescendo-motive to the main topic of the plot, which is conceived as a prophetic text for the birth of the three kings who founded the 5th Dynasty. The third story of this papyrus, in which the the king’s son Hordjedef plays the main role, is especially intriguing. The same Hordjedef is also known as a sage from the so-called Teachings of Hordjedef, a wisdom text whose fragments are preserved on several ostraca.35 Moreover, he is also mentioned in the colophon of a few spells of the Book of the Dead, where it is said that they are “found by Hordjedef, the great sage.”36 Hordjedef’s status as a sage may also refer to his magical knowledge. Thus, he is not only a literary and historical figure – his tomb is preserved at Giza – but a magician himself. The learned magician In contrast to the other royal sons in the stories of Papyrus Westcar, who only narrate the marvels of the past, Hordjedef brings an actual magician to court. This is Djedi – one hundred and ten years old – who performs wonders, predicts the future, knows the location of secret shrines of the god Thoth, and can even “reattach a head which has been cut off.”37 In the description of Djedi’s performance, great emphasis is put on the fact that Djedi’s magic is “written” and in order to be effective it has to be recited. Already when the magician is summoned by Hordjedef from the South, before leaving he says: “Let me have a boat, that it may bring my students and my writings.” The magician is therefore represented as a learned scholar caring about his disciples and texts. At a certain point of the story, Khufu asks Djedi about the jp.wt n.t wn.t n.t Ḏḥw.ty, a mysterious expression which has been dubiously translated as “the chambers of the sanctuary of Thot.”38 It is through a parallel in the Coffin Texts, particularly that copied from a coffin from Gebelein kept in the Museo Egizio in Turin, that we understand how this part of the tale is a piece of contemporary funerary religion transported into the literature of the time. While Thoth played a prominent role in the eschatological beliefs of the Middle Kingdom, he was not significant in this specific area of the Old Kingdom at the time of Khufu. The author of Papyrus Westcar was probably aware of the descriptions of the netherworld found in the Book of the Two Ways, which is part of the Coffin Texts, and mentions the jp.wt as a sort of area where shrines of divine images where placed. In an illuminating article of 1973, Erik Hornung has revealed several lexical similarities between this section of the Coffin Texts and the speech of Djedi on the jp.wt of Thoth in Papyrus Westcar, leaving no doubt that its author was well informed about the funerary and magical literature of his time.39 The protagonist Hordjedef is not the only figure of a great magician occurring in literary texts whose expertise is characterized by writing. Imhotep, another famous ancient Egyptian magician, architect and sage who was divinized, appears as priest-magician in the text on the so-called Famine or Dream Stela of the Ptolemaic period (probably during the reign of Ptolemy V Epiphanes, about 210–181 bce) in Aswan.40 This extensive document inscribed on stone describes a dream of Imhotep had in a seven-year period of drought and famine during Djoser’s reign in the Old Kingdom. Similar to Papyrus Westcar, the action is set in a glorious past, which happens frequently in Greek and Demotic Graeco-Roman literary texts. In the story recorded on the stela, Djoser asks Imhotep to find out where the Nile god Hapy lives and which other gods are found in the same area, so that he can appease them by bringing offerings and put an end to the drought that was afflicting the country. Imhotep therefore travels first to the temple of ḥw.t-Ib.ty (“the house of the nets”) to look in the archives. He learns that the Nile is controlled by Khnum in Elephantine. Consequently, he travels there, finds the temple of Khnum, provides offerings to the gods, falls asleep and has a dream in which Khnum promises to let the Nile rise again. The first thing Imhotep does after waking is to write down the dream itself. Being able to write and transmit sacred and magical knowledge through writings is presented as a need for the magician and, as a matter of fact, it is central in almost all the literary texts featuring magicians, who are always depicted as professional scribes. Magical handbooks used in Egypt at least since the Middle Kingdom played a main role as reference books for the ancient Egyptian learned magician. Even Setne Khaemwaset, son of Ramesses II (1290–1224 bce), who inspired the Demotic stories of Setne I and II, was famous for his interest in ancient scripts and magic, which he took with him on his quest for arcane knowledge.41 In the Demotic stories, Setne finds the Book of Thoth and becomes acquainted with powerful knowledge.42 Setne is not just “performing” magic; he represents the literary topos of a learned man who can control the universe and gain public recognition as magician through the acquisition of a magical book. Conclusion In conclusion, it seems that among the many functions and characteristics of the ritual specialists and Heka-workers from ancient Egypt, the model that attained the greatest currency and popularity in literary tales of all periods was that of the learned magician, whose powers come from books and written spells. Indeed, the magical inner nature of the ancient Egyptian writing certainly plays a role in the prominence accorded to written magic, the literate magician, and his secret knowledge. Even in the Graeco-Egyptian Magical Papyri (the so-called PGM and PDM), when charms were written chiefly in Greek and Demotic, the presence of charaktêres (i.e., non-alphabetic magical signs) and voces magicae (i.e., magical words, e.g., “abracadabra”) shows how these learned ritualists were manipulating the magical writing in order to make use of the prestige of their ancient, secret knowledge.43 ⬈"
}