{
  "articleId": "isaw_paper7_28",
  "text": "ARTICLE_ID: isaw_paper7_28\nISAW Papers 7.28 (2014)Linked data and the future of cuneiform research at the British Museum Jon TaylorResearchSpace1 opens significant new possibilities for a wide range of projects based on the British Museums collections.As part of its work, ResearchSpace has converted the Museums collections catalogue (strengthened by descriptions, associations and taxonomies developed over three decades of digitisation) into RDF triples, mapped to the powerful CIDOC-CRM ontology. This dataset has been made available via a SPARQL Endpoint on the Museum website: http://collection.britishmuseum.org/.Based on this starting point, several projects with a cuneiform focus are exploring the potential of Semantic Web/Linked Data.Cuneiform is a small and largely isolated field, with much both to gain from, and to offer to, the wider community.The LAWDI 2013 event provided a wealth of useful theoretical and practical guidance to help me get to grips with semantic technologies and their potential.#p1The Ashurbanipal Library ProjectThe Ashurbanipal Library Project2 is recreating in digital form one of the most important libraries ever assembled: that of Ashurbanipal, King of Assyria during 7th century BC. Over 30,000 inscribed tablets and fragments are currently known.Most are in the British Museum collection, but others are found in collections around the world, and our partners at the University of Mosul are likely to find more during their excavations at the site of Nineveh.Texts from the Library have formed the central pillar of cuneiform research, and stimulated wider public interest, since 1850s. The mass of material and of research carried out on it, and the many audiences interested in the Library, demand a detailed and structured digital presentation. A related initiative will combine research data with guide books and archival records to explore how the Library has been presented and interpreted in the Museum over the last 160 years.#p2There is clear potential to contextualise the Library in many ways: from relating place names to Open Contexts presentation of the Tu00fcbinger Atlas des Vorderen Orients (see Kansa, this volume) or personal names to prosopographical databases such as the Berkeley Prosopography Services (see Pearce and Schmitz, this volume), to thematic relations with cross cultural study of magic, religion, literature (perhaps building on research presented by Nurmikko-Fuller, this volume) and so on. A controlled bibliography would also be very useful (see Acheson, this volume).#p3Ur of the Chaldees: A Virtual Vision of Woolley's ExcavationsThe new Ur of the Chaldees Project is bringing together the complete set of all finds, inscriptions, images and excavation records of the first archaeological mission of the modern state of Iraq.These materials are divided between the Iraq Museum, British Museum and Penn Museum. The project is described in more detail by Hafford (this volume).Penn Museum has now also made their collections catalogue available in semantic form (see Williams, this volume).#p4Materialities of Assyrian Knowledge Production: Object Biographies of Inscribed Artefacts from Nimrud for Museums and MobilesThe Nimrud project3 promotes awareness among specialists and non-specialists of how the past is reconstructed and understood through objects. It takes as its case study the inscribed artefacts from Nimrud, tracing them from their manufacture and use in antiquity to their current locations in museums, and their virtual representations on the web.The technical focus is on the development of Linked Open Data, especially for handheld devices such as mobile phones and tablet computers.#p5A complete catalogue of the cuneiform collections of the British MuseumThe Museums online catalogue 4 is a powerful resource. For cuneiform specialists, however, it has its limitations, such as the usual issues of noise from large volumes of unrelated material, problems sorting and displaying results effectively, and the inability to download results. A personal project of the author seeks to present a dedicated catalogue of every object inscribed with cuneiform in the British Museum (around 130,000 registered objects). The interface will allow manipulation of groups of records, rather than just finding individual records.It is hoped that as more cuneiform-based projects implement semantic technologies, the catalogue will be able to harmonise Museum data with those from the growing family of projects based around the world."
}