{
  "articleId": "isaw_paper7_30",
  "text": "ARTICLE_ID: isaw_paper7_30\nISAW Papers 7.30 (2014)Moving from cross-collection integration to explorations of Linked Data practices in the library of antiquity at the Royal Museums of Art and history, BrusselsEllen Van KeerIntroductionThe Royal Museums of Art and History rank among the largest cultural heritage research institutes in Belgium.Thousands of artifacts and historical objects from around the globe, dating from prehistoric to modern times, are on display in the galleries or kept in the storerooms.1 In addition, the library keeps thousands of journal articles, books and other scholarly publications regarding the museum's collections. In the current infrastructure, the museum and library databases are two separate systems.However, the materials they contain overlap not only on thematic level (e.g. ancient Egypt) but also on entity level (e.g. entries on objects in exhibition catalogs).As part of the project Bridging Knowledge Collections we will create a cross-domain integration.2#p1As a first objective, we will make the two datasets cross searchable in a single online user interface, a major challenge because the museum and library sectors traditionally use totally different sets of standards (Prescott & Erway 2011). As a second objective, following the demands of the curators, we are researching a workflow that will link objects and documents on record level and support the input of object bibliography in the museum database.To avoid the manual creation of duplicate datasets, we will reuse existing bibliographic information from the library catalog in the museum database and link back to the full references by adding a system identifier. We will not use the library's internal database primary keys as identifiers, but instead, we will be using the permalinks produced on the library OPAC, because they are open to everyone and allow a direct hyperlinked access from within the museum database to the on-line library application and its range of functionalities and user-services.#p2Furthermore, we are considering a Linked Data implementation. As the museum system also generates permalinks for our objects, machine actionable links to identify both citing publications and cited artifacts are already in place.Moreover, we are not (yet) producing our own RDF, but we can rely on our partnership in the larger-scaled Europeana community for initiatives in this direction.Last year, Europeana published its API and released 20 million objects from its providers as RDF dump under open licenses (CC0), including our entire collection of Egyptian objects.3 What actually happened is that we exported our SPECTRUM compliant museum data as LIDO XML and mapped this to ESE, the earliest Europeana datamodel, which was Dublin Core based.4 ESE is currently being replaced by the RDF based EDM, and Europeana has also transformed the content ingested in the older format into this new model now.5 As a result of this procedure the resulting RDF remains rather crude and lacks contextualization links to other sources. However, in newer Europeana projects, we are directly transforming our LIDO export to EDM and a semantic layer is being implemented in the ingestion process.6#p3Important for our present purpose, is that the core semantic layer of EDM includes the related works element:#p4http://purl.org/dc/terms/isReferencedByThis is an adequate predicate for linking cited resources from the museum database to citing resources in the library system - and thus produce RDF triples. At least, thats the general idea.There are of course practical obstacles.#p5Museum Linked DataOn the museum side, we will have to make additions to our LIDO XML export, as this remains currently our basis for all further mappings, also to EDM.More particularly, we want to add a new relatedWorksWrap to the LIDO,7 and map this element to <IsReferencedBy> in the ESE/EDM transformation. Unfortunately, we depend on (resources for) the museum system vendor making any changes to our export.Also in this regard, linking to bibliographic records with permalinks is more efficient than describing publications at the lower levels of author, title, year, etc. A new LIDO event type for Publication is a complex element and requires more modifications.However, in the Europeana context, tools are being developed for giving content providers more control over their application data export in the future.8#p6As a side note here, but essential for the adoption of Linked Data, we would also want to improve the permalinks for the objects the museum system produces, e.g.#p7http://carmentis.kmkg-mrah.be/eMuseumPlus?service=ExternalInterface&module=collection&objectId=84853&viewType=detailViewThe permalinks should rather be application and vendor independent HTTP URI's that are composed of the institutional namespace and object ID's (Heath & Bizer 2011), e.g.#p8http://kmkg-mrah.be/collection/id/84853Likewise, it is relevant that Europeana has established its own identifier for this object:#p9http://www.europeana.eu/portal/record/08566/8628ED4D8C180516185A720890C82B33B0145767.htmlOf course, changing permalinks and multiple identities are very delicate matters with implications far beyond the limited framework of this library-based project.#p10Library Linked DataOn the library side, identifiers pose the additional difficulty of having to decide which one(s) to use, both locally and globally.As we are part of a large library network and the permalinks produced on our library OPAC are actually queries into the shared database, they will change for every library view.Therefore, a publication will have a different permalink when accessed depending on whether access is through the general catalog of the network or through our local library view, e.g.#p11http://opac.libis.be:80/F/?func=direct&doc_number=007483927&local_base=OPAC01http://opac.libis.be:80/F/?func=direct&doc_number=007483927&local_base=KMKGStill, we can easily extract a better URI automatically by stripping after the last ampersand which gives us#p12http://opac.libis.be:80/F/?func=direct&doc_number=007483927But additionally, the newly implemented library discovery tool LIMO produces again different sets of permalinks for the same publication, which we cannot refine manually, e.g.#p13https://services.libis.be/query?query=sys:LBS01007483927&view=LIBISnet&institution=LIBISNET&builder=primo_opensearch&host=limo.libis.behttps://services.libis.be/query?query=sys:LBS01007483927&view=KMKG&institution=KMKG&builder=primo_opensearch&host=limo.libis.beHowever, this last link will lead our users directly to our local LIMO view, with customized new features such as user-recommendations and access to locally licensed e-content.9 For this p ractical reason, we will deploy it as our primarily linking source.Nevertheless, we would also want users in the rest of the network and, ideally, the entire world to be able to discover objects from our collections through citing publications they have access to. LIMO should be able to achieve this functionality through server-side enrichment of related records.Moreover, this new tool is based on Ex-Libris' Primo service and the company is working on producing persistent LOD-friendly URI's that will return RDF for all Primo PNX records (Koster & Harper 2013).#p14The global context also poses direct challenges to us. To start with, co-reference, the problem that multiple identifiers point to the same entity, is inherent in the global library context.While museum pieces are usually unique, libraries all over the world can hold (multiple) copies of the same publication.As a result, it will get numerous URI's through different library systems and aggregators, e.g.#p15http://www.worldcat.org/oclc/690395786http://trove.nla.gov.au/version/50480843http://www.theeuropeanlibrary.org/tel4/record/1000123701574http://zenon.dainst.org/#book/000850955Moreover, in producing a scholarly bibliography of our museum objects, linking to a specific edition of a publication in another library is just not an option. Library systems serve traditionally primarily as tools for locating physical copies (FRBR items) of publications, but object citations are content disclosure and operate on a more general level.However, larger-scaled projects are increasingly trying to serve more globally scoped and content oriented (FRBR manifestation/expression) identifiers, which suit our purpose better (Gatenby e.a. 2012).#p16https://www.worldcat.org/title/elkab-and-beyond-studies-in-honour-of-luc limme/oclc/476143033/editionsAnd in the end, the development and implementation of RDA is intended as a remedy, since it (ideally) enables referencing entities on all four levels of FRBR group 1.10 Digital libraries as well have this advantage of being independent of the physical item, but they proliferate the identity crisis further (Hull e.a. 2008). Through publisher DOI's, commercial services such as Jstor, Open Access repositories such as OpenDOAR, and bibliographic or subject-related databases such as Zotero, APh, OEB, papyri.info... many additional sets and types of permalinks and URI's (often closed but nevertheless useful for researchers) can be assigned to the same publication or some part of it, e.g.#p17http://www.peeters-leuven.be/boekoverz.asp?nr=8662http://papyri.info/biblio/20718?q=elkab+and+beyondhttp://orbi.ulg.ac.be//handle/2268/23962It is clearly impossible to trace, add and check all co-references of citing publications in all these systems manually. Implementing web-based systems and semantic technologies should allow automating this procedure in the future and addressing the issue on a larger scale.#p18Semantic enrichment and alignment of our datasets with external sources at a lower level of description can also be framed in the broader library and museum communities.In the Europeana context we are for instance transforming our thesauri to SKOS and aligning them with other reference terminologies in the Galleries, Libraries, Archives, and Museum sector (GLAM), such as the Getty Thesauri.11 Moreover, new tools and workflows are being developed to support Linked Data production and enrichment locally, before mapping to EDM (e.g. de Boer e.a. 2012). Also, direct mappings of LIDO aggregations as Linked Data sets are being investigated, to achieve rich and interoperable resource descriptions (Tsalapati e.a. 2012).Ideally, implementing a fully-fledged top-level ontology such as CIDOC-CRM would allow us to describe, relate and align our heterogeneous, distributed local datasets at the lowest and fullest level of detail, resolving the issue of cross-collection integration at the record level we are (still) dealing with now. However, it would not immediately solve all problems. URI disambiguation is a more general challenge in the consumption of Linked Data (Jaffri e.a. 2008) and the ubiquitous use of <owl:SameAs> has even invoked an identity crisis at the lowest description level (Halpin e.a. 2010).The adoption of Linked Data involves embracing of the global knowledge space in all its complexity."
}