{
  "articleId": "isaw_paper22_6",
  "text": "ARTICLE_ID: isaw_paper22_6\nThe growing demand for analog and digital games has afforded designers the opportunity to draw on the recent and ancient past to create unique and immersive settings and themes.The rich content of historical and archaeological video games in particular has been examined by players, educators, and scholars alike for its accuracy, pedagogical potential, and issues surrounding the representation of events and people (e.g., Chapman 2016; Graham 2020; Hageneuer 2020; Huffer and Oxenham 2015; Kapell and Elliott 2013; Rael 2015; Reinhard 2018; Rollinger 2020; Ross 2021; Wainwright 2019). Interdisciplinary research on board games as a form of media (Booth 2018, 2021), while becoming more widespread through specialized journals such as Analog Game Studies, is still not as established as that of their digital counterparts.Therefore, research surrounding the representation of the past in board games is incipient.In this paper, I contribute to analyses on the representation of gender in board games (Hova 2014; Jones and Pobuda 2020; Pobuda 2018; Ryan 2016) by using the artwork on the box covers, boards, and components to explore how gender roles and expressions are portrayed in games set in the past. While many of the games presented balanced views of ancient societies, populated with a range of social actors, there was a clear bias toward favoring male narratives, spaces, and activities.The paper concludes with several case studies which demonstrate how the inclusion of rich archaeological and historical scholarship into game design and illustration promotes a more nuanced and inclusive picture of gender in the past.2. Representations of Gender2.1 Gender in GamesWithin video game studies, the topic of gender (both as depicted in games and in the larger gaming industry) has received decades of multifaceted research (e.g., Cassell 2000; Kafai et al. 2008, 2016; Malkowski and Russworm 2017; Shaw 2015; Williams et al. 2009).Critical discussions surrounding the portrayal of gender within video games have noted a relative paucity of women, along with harmful stereotypes that frequently intersect with other aspects of social identity (Malkowski and Russworm 2017; Sarkeesian 2013-2017). Movements toward greater inclusion in games include more balanced representations of men and women, along with characters that identify as non-binary (Sarkeesian 2020).Using data from boardgamegeek.com (hereafter BGG), scholars have found similar trends in the representation of women and men in the cover art and rule books of popular board games (Hova 2014; Jones and Pobuda 2020; Pobuda 2018; Ryan 2016).1 Not only did these studies recognize a strong imbalance in the representation of men and women, but Pobuda (2018) also found that White individuals were far more likely to appear than those categorized as non-White, highlighting how gender must be understood as a dynamic aspect of social identity that intersects with other axes of difference (Crenshaw 2017). Pobuda (2018) justifiably argues that representation in board games should reflect the diverse global community of people who currently play.How board games based in the past, particularly those in ancient cultures, fit into larger discussions surrounding the importance of representation has yet to be fully investigated.2.2 Gender in the Ancient WorldAs with the present day, gender was a complex and negotiated aspect of ancient social identity (Joyce 2008). Portrayals of gender in the ancient world in a variety of different media (e.g., in textbooks, museums, popular publications, movies, and television series) are influenced by the biases and assumptions of their creators.This can result in the uncritical projection of contemporary gender norms, stereotypes, and hierarchies into these reconstructions, traditionally emphasizing the work of men over women (Porter 1988; Solometo and Moss 2013).2 Whether intentionally designed to be accurate or not, analog and digital games may be the primary exposure that players have to a specific group or society in the ancient world, shaping their understanding of them.Criticisms of the portrayal of women in video games based in the past include both the use of negative stereotypes and tropes, as observed by Beavers (2020) in Ryse Son of Rome (2013),3 and a general absence of female characters. On this, Wainright (2019, 168) writes that there is a distinct focus on the public sphere u2013 war, politics, and macro-economics u2013 rather than the private u2013 homemaking, community service, and micro-economics.The former was the domain of men, and the latter one in which women exerted considerable influence.Although a number of video games have attempted to introduce more women into these male-dominated spaces, some players have criticized them for not being accurate to the actual time period (Kapell and Elliott 2013).4 While board games use many of the same themes and settings as video games, they have very different material constraints, warranting their own critical analysis.3. Materials and MethodsTo investigate the representation of past peoples, I analyzed a sample of 50 board and card games5 based in the ancient world (Appendix).6 Among the games, 16 were published or re-released between 2000-2010 and 34 between 2011-2020.Most of the games were set in Europe, northern Africa, the Middle East, and Anatolia; however, there were also examples from Asia, southern Africa, Mesoamerica, and the Andes. I identified games through my own experience playing them, discussions with colleagues, and research that I carried out on BGG. For games with expansions, I only included the original game in the statistics; however, I did allow for series (e.g., Catan Histories).Finally, the games in this study are limited to those with copies published in the English language.To explore the representation of gender,7 I visually examined the cover art, playable characters, and images on the board, tiles, cards, or other game elements.8 Previous studies (Hova 2014; Jones and Pobuda 2020; Pobuda 2018; Ryan 2016) used a variety of techniques to quantify trends in representation, including counting the total number of men and women or categorizing the covers based on the preponderance of women andor men. I employed five categories to capture the variation in my sample all men, all women, mixed group, none, and undefined. The last category u2013 undefined u2013 refers to cases where the features of the people depicted are obscured or ambiguous, typically due to their positioning or small size.These groupings are comparable to the other studies, although different terminology is used across the papers9 and some of them also include non-humans (e.g., animals).The methodology used in this study admittedly has the problem of essentializing gender into binary categories, when archaeological, historical, and ethnographic work has shown both nuanced expressions within genders and the presence of three or more genders in some societies (e.g., Hollimon 2006).10 While artists undoubtedly drew on these rich sources of data when creating the artwork for games, they also made individual choices about who to depict and how to best translate the identity of the people in the game for a modern audience. The use of women and men within this study when referring to people from a range of past societies is not meant to imply that these gender expressions were static or uniform across time and space.Rather, I relied on normative ideas about gender in my analysis to try and understand how people playing the games u2013 whether informed of the complexities of gender in the past or not u2013 might identify these individuals.11My approach differs from the foundational studies mentioned above in several notable ways. First, the most popular board games on BGG were the focus of past research and their high user-generated scores suggest that they are fairly well-known, at least within the board game community.Due to the narrow focus on setting, the games in my study alternatively range from very popular to more obscure.Furthermore, rather than focusing solely on the boxes and rule books, my study analyzes the cover art, pieces, and board together. The tactility of board games means that the players are experiencing the theme and setting through interactions with these pieces (Booth 2018, 2021); thus, the components are integral for shaping their understanding of gender in the past.4.Results4.1 Board Game Cover ArtThe majority of games display people on the front or back covers (90%).12 As with the studies introduced earlier, the greatest proportion (40%) were men u2013 either alone or in a group (Figure 2). Among the covers that included only men, figures tended to be named individuals or other important socio-political actors.In many of these covers, the large size of the men relative to their settings conveys a sense of power and authority, and they are typically taking an active stance or otherwise engaged in an activity.No original covers featured only women; however, the redesign of Ra (1999, 2016) saw the replacement of the so-named god with an elite woman.13 Approximately one third (34%) of board game covers displayed both women and men. The rest of the sampled games either included representations of people who could not be identified (14%) or lacked humans entirely (10%).Pie charttPie chartFigure 1.Breakdown of Men and Women in the Sampled GamesCovers with a mixed composition were generally well-balanced (Figure 2), featuring paired central figures (e.g., Catan Histories Struggle for Rome 2006) or larger groups (e.g., Maya 2019). A unique exception is the game Fertility (2018), which is acutely gendered. Although other activities are occurring in the background, the central figures are a woman and a child surrounded by harvested crops, thus visually linking the notion of fertility to both agricultural and human reproduction.In the majority of these images, the men and women are typically scaled to the natural and built environment and are actively engaged in the world around them.This trend is taken to the extreme in many of the covers, which emphasize the larger game setting (e.g., Tawantinsuyu The Inca Empire 2020). In these cases, the miniscule scale of the individuals obscures their identities, a trend that has also been noted in other media.In their assessment of National Geographic, Solometo and Moss (2013, 142-143) note that with this style of representation, even when the readers own viewpoints may [then] gender the scene, this bias would not be directly conveyed by the artwork.This technique therefore sidesteps around many criticisms surrounding (mis)representation.14Game arttGame artGame artGame arttGame artFigure 2. Board Game Cover Art with Depictions of Humans (Photo credit Top left HUCH! 2017, Top right Windrider Games 2016, Center Catch Up Games, Bottom left White Goblin Games 2019, Bottom right Board & Dice 2020 CC by 4.0)4.2 Game Board and ComponentsRepresentations of people were also present on the boards, pieces, cards, and other components of the majority of these games.The imbalance between men and women observed in the cover art was mirrored in the components, with 36% of games displaying men only and no games solely representing women. A sizable percentage of games (14%) portrayed undefined or ambiguous human figures, again usually due to their small scale. For example, in Teotihuacan City of the Gods (2018), the board art captures how people would have looked on the ground from the top of Teotihuacans monumental stone pyramids.The city is populated with a large number of people engaged in activities, such as monument construction and ritual practices; however, they are rendered so small that their individual identities cannot be distinguished.Finally, despite several of them having people depicted on the cover, 10% of the games components had no humans.Games that displayed both women and men were the most common (40%), and the activities that they are engaged in communicate information about gender roles in these settings. In some cases, representations were unbalanced, such as 7 Wonders (2010).Only four15 of the 75 unique cards depict solely women; one of which (Baths) has been the subject of a number of BGG forum debates surrounding the sexualization of the women pictured within.The majority of images depict men actively participating in a range of roles and activities.While many past societies show extreme differences in gender status, roles, and occupations, by emphasizing male-oriented themes and settings, these games may leave players with the impression that civilization-building can be attributed almost solely to the actions of men. These kinds of reconstructions of the past overlook the important contributions of women and children.Many of the games successfully demonstrated how designers and illustrators can present a balanced picture of society, with approximately equal representation of men and women across the components.In Sailing Toward Osiris (2017), the actors depicted are carrying out different activities (Figure 3) supported by archaeological and historical research. For example, the importance of female brewers (Watterson 2013) is reflected in their inclusion in the games City Cards.Thus, while a division of labor is expressed through this representation, the game acknowledges the contribution of women to monument construction (the goal of the game) specifically, and to ancient Egyptian society more broadly.Game artFigure 3.Select Cards from Sailing Toward Osiris (Photo credit Daily Magic Games 2017, Reprinted with Permission)While the depictions on the components of these games help to set the scene, the people carrying out the activities necessary to win are often represented by square blocks, tokens, dice, or meeple (a portmanteau of my'' and people), game pieces in the shape of humans (Figure 4). The use of non-gendered language and the absence of identifying markers or characteristics on meeple simultaneously highlights that these pieces represent humans, while deemphasizing individual social identities, including gender.16 As with small-scale representations, this ambiguity may allow players to populate the past on their own terms (Solometo and Moss 2013 142-143).Close up of gaming pieces on a tableFigure 4. Meeple (Photo by Author)5.Discussion Archaeologically-Informed Representations of Gender in Ancient World- based GamesUnlike video games where solo gaming is often the norm, board games are typically highly social events.17 Booth (2018 58-59) sees board games as, a mutable, textual, tangible object that does not come into being without the addition of player agency.When people are embedded in the larger setting or components, the players are more likely to engage with past populations. Supplementary resources are a powerful way for game designers and artists to ensure that players actively engage with the archaeological and historical information behind the images.One example of a game that furthers this agenda is Catan Histories Rise of the Inkas (2018).At the beginning of the rule book, there is a section with a brief introduction to the Andes, along with tools for interpreting the setting, objects, and people depicted in the game. This unique approach could be integrated into other games in the future.Many of the designers and artists involved in the games included in this study have clearly drawn on academic scholarship to present an informed view of the past.Scholars such as Lukomski (2018) have noted a tension between accuracy and inclusivity, which u2013 when coupled with the types of games that tend to be made (e.g., economic, political, and military) u2013 has resulted in a disproportionately male-oriented view of the past. Drawing on the experiences and perspectives of women and other traditionally marginalized or overlooked groups can expand the scope of games to include rarely gamified, but equally important and engaging themes and settings.Collaboration with stakeholders and descendent communities can also ensure that the voices, narratives, and interests of these groups are highlighted and that past and present identities u2013 including gender u2013 are not misrepresented.18In the remainder of this section, I will briefly introduce cases where board games used archaeological and historical information to portray diverse gender expressions and roles in the past. In Assyria (2009), three individuals characterized by different hairstyles (including facial hair), dress, and ornamentation are featured prominently on the board (Ystari Games n.d.).Two of the central figures appear to have been copied from a stone relief housed at the Oriental Institute of the University of Chicago (Oriental Institute 2021).19 In the collection highlights, they are described as, possibly identifiable as eunuchs, men who held considerable socio-political power and influence during this period (Brereton 2018; NShea 2016). Although not specifically addressed in the game content, by including both the king and eunuchs, Assyria showcases various expressions of masculinity in ancient Assyria, rather than just portraying a homogenous picture.The game 7 Wonders Leaders (2011) is composed of cards with a range of named historical figures,20 including both women and men.Among these individuals is Hatshepsut, the Egyptian pharaoh. Hatshepsuts use of masculine pharaonic icons in reliefs and statues of her has led many scholars to heavily debate her gender identity (see Matiu0107 2016).The game portrays Hatshepsut with the nemes (headcloth), crook, and flail, all of which were potent symbols of leadership.However, the false beard, one of the most important markers of this position, has notably been left out from this reconstruction. The selective portrayal suggests that the artist may have thought that including the beard would have been confusing for contemporary audiences, as facial hair is typically translated as male.Hatshepsuts card thus highlights her identity as a powerful, yet recognizably female, pharaoh.Archaeological and historical evidence can also be used to reexamine past assumptions about gender roles.Certain activities, such as warfare and hunting, have been gendered male through the uncritical projection of contemporary gender stereotypes into the past. Games such as Nuna Aranway (2016)21 are pushing against these stereotypes by including images of female hunters, roles which are supported by archaeological evidence (e.g., Haas et al. 2020).The examples discussed above are just a few of the growing number of board games that, by drawing on historical and archaeological data and interpretations, are able to create an immersive and inclusive view of the past that highlights the diversity of gender identities, expressions, and roles.6. ConclusionThe widespread adoption of board games into popular usage over the past several decades make them an important form of media that warrants critical analysis (Booth 2018, 2021).In this paper, I have explored how gender is represented in games based in the ancient world.Overall, many games showcased fully-populated societies with men, women, and children.However, as with video games, women tended to be underrepresented. A lack of diverse representations of past peoples in board games can have a negative impact on players by reinforcing narratives that cast men as the sole socio-political and economic actors in the past (Beavers 2020, 7). However, recent strides within the field of archaeology toward increasing multivocality, collaboration, and inclusion provide pathways for board game designers and artists to diversify their portrayal of the past.AcknowledgementsI would like to thank my co-organizer, Gabriel Mckee, for conceiving of and including me in this incredible conference and volume, and for introducing me to several of the games featured in this analysis. I am grateful for the feedback of Michelle Young, Andrew Womack, and Colin Theys on an earlier draft of this manuscript. I would also like to thank our editor, Sebastian Heath, and an anonymous reviewer for their thoughtful feedback. All errors or mistakes in the article are my own.Finally, I would like to extend my gratitude to all of the game designers and artists for creating fun, immersive, and educational windows into the past."
}