{
  "articleId": "isaw_paper18_7",
  "text": "ARTICLE_ID: isaw_paper18_7\nISAW Papers 18.7 (2020) 1. The Alexander Romance ad Nectanebo The Alexander Romance is a fictional account of Alexander the Great’s life and deeds, originally written in Greek and falsely attributed to the historian Callisthenes. The exact history of its composition is difficult to unravel: in its first incarnation, it blended together a great number of heterogeneous literary traditions over a very long period of time, starting shortly after Alexander the Great’s conquest of Egypt and continuing up to the later years of the Roman Empire, before being adapted and translated into over thirty languages (Latin, Armenian, Arabic, Persian, French, English, German, etc.), and spread throughout the European and Asiatic continents. The Greek Alexander Romance itself, the first version, is preserved in a large number of manuscripts, but the present article will focus only on two recensions, preserved in the manuscripts known as A (recension α) and L (recension β).2 One episode of the Romance in particular (1.1–14) bears traces of a significant Egyptian influence, most notably the famous introduction of the pharaoh Nectanebo, a character inspired by the historical figure of Nectanebo II, last native ruler of Egypt from 361/360 to 343 bce, before the Second Persian domination and the subsequent conquest of Alexander the Great. It seems that shortly after his death, Nectanebo began to feature in a series of Graeco-Egyptian narratives, of which only a few fragments have survived: they are known to us as the Dream of Nectanebo/Prophecy of Petesis (Greek and Demotic) and Nectanebo and the Oracle of Haroeris (Demotic), among others.3 Some of those tales were composed first in the Ptolemaic period and were still in circulation during the Roman period. At some point – under the first Ptolemies, or perhaps only a bit later – part of this literary material was recycled and integrated into what would become the Alexander Romance.4 In this “Nectanebo episode,” as we now know it, Nectanebo is presented as a ruler able to keep Egypt’s enemies at bay by means of a powerful spell, but who is one day forced to relinquish his throne and leave his country when his own gods turn against him. He flees to the Macedonian court, at Pella, where he soon becomes astrologer to, and then lover of, the queen Olympias, thus siring Alexander the Great himself. 2. Egypt and “magic” in the Alexander Romance This introduction to the Alexander Romance contains many literary descriptions of “magical” rituals performed by Nectanebo. Before going any further, though, it should be noted that the term “magic” will be here understood as a discursive category used by the Greeks when referring (often in a pejorative, othering way) to certain Egyptian practices. We will not propose any essentialist definition of what “magic” is or ought to be outside of the Alexander Romance.5 Indeed, our purpose is to illustrate how, within the Romance itself, the “magical” actions performed by the pharaoh (whether they are called μαγεία or γοητεία) actually seem closely to mirror cult practices that belonged to the Pharaonic priestly and royal spheres and to showcase the perception that a Graeco-Roman readership might have had of such rituals. In the Alexander Romance the deference towards Egyptian “magic” (μαγεία) is especially noticeable in the text A, which begins with a eulogy of Egypt and its inhabitant, with a special emphasis on the might of their last king Nectanebo: The Egyptians are very wise, descended as they are from the gods. They it was that took the measurement of the Earth, tamed the waves of the sea, traversed the river Nile, invented astronomy, and gave the world the force of speech, the discovery of magical power (εὕρεσιν μαγικῆς δυνάμεως). For they say that Nectanebo, the very last of the pharaohs of Egypt, gained mastery over all peoples by magical power (τῇ μαγικῇ δυνάμει πάντων περιγενέσθαι). By speech he could subject all the elements of the universe to himself (τὰ γὰρ κοσμικὰ στοιχεῖα λόγῳ πάντα αὑτῷ ὑπετάσσετο).6 Only in this variant of the Alexander Romance does the narrative start with such a description of Egypt and its magicians, without even mentioning Alexander’s name for the first fourteen chapters, which instead tell the story of Nectanebo. In L, on the other hand, the tale opens with a reminder of how noble Alexander was, before revealing the big secret – “he was not Philip’s son, but the wisest of the Egyptians say that he was the son of Nectanebo” (1.1.1) – and then switching to focus on Egypt and the powers of this mysterious pharaoh. In both texts, Nectanebo is thus introduced as an expert in rituals, able to overcome any danger of a foreign invasion, and ruling peaceably thanks to his “magical power” (τῇ μαγικῇ δυνάμει; A) or his “magical skill” (τῇ μαγικῇ τέχνῃ; L).7 He is presented as having inherited this expertise from his Egyptian ancestors, who were the first to “discover magic’s power” (εὕρεσιν μαγικῆς δυνάμεως; A). In the same vein, Nectanebo later introduces himself to queen Olympias as a μαγός and ἀστρολόγος able to see the future without error.8 But Nectanebo is not always depicted as a powerful and awesome magician. He can also be implicitly characterized as a trickster, a γόης whose powers are sometimes real, sometimes fake. Thus, for instance, in L (1.7.1–2) when he deceives Olympias and pretends to be the god Ammon, wearing a golden ram fleece, complete with horns on his forehead and donning a snakeskin-like himation.9 Much later, on Nectanebo’s deathbed (A, 1.14.9–10), Alexander himself recognizes the treacherous nature of his father and describes as “witcheries” (γοητεία) the actions that he performed in order to mislead Olympias and Philip. This ambiguity in the Romance’s description of Nectanebo’s powers is very similar to the exotic curiosity, oscillating between fascination and contempt, that permeates the Greek novels that feature an Egyptian priest or magician, such as Heliodorus’s Aithiopika, Achille Tatius’s Leukippe and Klitophon, or Lucian’s Extraordinary Stories.10 3. Nectanebo’s “lecanomancy”: pure literary creation, or novelization of Egyptian cult practices? Let’s now turn to the first spell described in the Alexander Romance, with which Nectanebo manages to repel enemies planning to invade his country. A and L each contain two scenes of the pharaoh performing this complex ritual, described in Greek as a λεκανομαντεία, literally a “bowl divination.” (A) εἰ γὰρ αἰφνιδίως πολέμου νέφος ἐπεληλύθει, οὐκ ἔσκυλλε στρατόπεδον οὐδὲ ὅπλων πομπεύματα οὐδὲ σιδήρου ἀκονήματα οὐδὲ πολεμικὰ μηχανήματα, ἀλλ’ εἰσήρχετο εἰς τὰ βασίλεια καὶ ἐλάμβανε χαλκῆν λεκάνην καὶ γεμίσας αὐτὴν ὕδατος ὀμβρίου ἔπλαττεν ἐκ κηροῦ πλοιαρίδια μικρὰ καὶ ἀνθρωπάρια καὶ ἐνέβαλλεν αὐτὰ εἰς τὴν λεκάνην καὶ ἔλεγεν ἀοιδήν, κρατῶν ἐβεννινην ῥάβδον, καὶ ἐπεκαλεῖτο τοὺς ἀγγέλους καὶ θεὸν Λιβύης Ἄμμωνα. καὶ οὕτω τῇ τοιαύτῃ λεκανομαντείᾳ τὰ ἐν τῇ λεκάνῃ πλοῖα < ... > τῶν ἐπερχομένων πολεμίων ἀπολλυμένων † ἀνθρώπων περιεγένετο· τὸ δ' αὐτὸ καὶ ἐπὶ τῶν διὰ γῆς ἐπερχομένων ἐχθρῶν. For if a cloud of war had suddenly come upon him, [Nectanebo] did not bother with the army-camp, processions of arms, the sharpening of steel or engines of war, but he would retreat into his palace, take a bronze bowl, fill it with rain water, and mold some little boats and little human figures out of wax, put them in the bowl, and recite a spell while waving an ebony wand. He would call upon the angels11 and upon Ammon, the god of Libya. And so it was that, through such a lecanomancy, the boats in the bowl <…> of the hostile invaders † having perished, he would prevail. The same was done against enemies attacking from the mainland.12 (L) εἰ γάρ ποτε τούτῳ δύναμις ἐπέβη πολέμου, (...) ἀλλὰ θεὶς λεκάνην ἐποίει λεκανομαντείαν. καὶ ἔβαλλεν ὕδωρ πηγαῖον εἰς τὴν λεκάνην καὶ ταῖς χερσὶν αὑτοῦ ἔπλαττεν ἐκ κηρίου πλοιάρια καὶ ἀνθρωπάρια κήρινα καὶ ἐτίθει εἰς τὴν λεκάνην. καὶ ἐστόλιζεν ἑαυτὸν στολὴν προφήτου κατέχων ἐν τῇ χειρὶ αὑτοῦ ῥάβδον ἐβελίνην. καὶ στὰς ἐπεκαλεῖτο τοὺς ὡσανεὶ θεοὺς τῶν ἐπῳδῶν καὶ ἀέρια πνεύματα καὶ τοὺς καταχθονίους δαίμονας. καὶ τῇ ἐπῳδῇ ἔμπνοα ἐγίνοντο τὰ ἀνθρωπάρια. καὶ οὕτως ἐβάπτιζε τὰ πλοιάρια ἐν τῇ λεκάνῃ. καὶ εὐθέως βαπτιζομένων αὐτῶν τὰ ἐν τῷ πελάγει πλοῖα τῶν ἐπερχομένων αὐτῷ πολεμίων ἀπώλοντο διὰ τὸ πολύπειρον εἶναι τὸν ἄνδρα τῇ μαγικῇ δυνάμει. ἐν εἰρήνῃ οὖν διετέλει τὸ βασίλειον αὐτοῦ. If ever a hostile power came against him, [Nectanebo] (…) took a bowl and carried out a divination by water. He filled the bowl with spring water and with his hands molded ships and men of wax and placed them in the bowl. Then he robed himself in the priestly robes of a prophet and took an ebony staff in his hand. Standing erect, he called on the so-called gods of spells and the airy spirits and the demons below the earth, and by the spell the wax figures came to life. Then he sank the ships in the bowls, and straightaway, as they sank, so the ships of the enemy which were coming against him perished. All this came about because of the man’s great experience in the magic art. And thus his kingdom continued in peace (…).13 To perform this “lecanomancy,” then, Nectanebo first pours some water into a bronze bowl, either rain-water (A) or water taken from a spring (L). He molds an army of little wax figurines representing soldiers and boats and puts them in the bowl. Then, dressed as an Egyptian prophet (only in L) and holding an ebony wand,14 he recites a formula and calls upon various deities (“angels” and the Libyan Ammon in A; “so-called gods of the spells,” spirits of the airs, and demons of the underworld in L). Nectanebo is thus able to destroy the armies attacking Egypt: by sinking the wax figurines in the bowl, the real soldiers and ships suffer the same fate (the detailed explanations are only mentioned in L). Later on, when Nectanebo is described (in less detail) as performing his “lecanomancy” for the second time in the Romance (1.3), the spell turns out to be useless, because, as the pharaoh realizes when he gazes into his bowl, the enemy army is under the protection of the Egyptian gods themselves.15 This description thus teaches us that the ritual also works as a regular divination or revelation spell. Nectanebo is able to observe the invading armies in his bowl, and even to see the gods and converse with them: “He gazed into his bowl. There he saw (ὁρᾷ) the gods steering the ships, and the armies under the commands of the same gods. Nectanebo, being a man experienced in magic (τῇ μαγείᾳ πολύπειρος) and accustomed to talk with his gods (εἰθισμένος τοῖς θεοῖς αὐτοῦ ὁμιλεῖν), realized that the end of the Egyptian kingdom was at hand …”16 Most classical scholars have explained this “lecanomancy” as an awkward and artificial amalgamation of two types of “magical” spells, presented as blending a “Greek” mantic ritual (the divination with a bowl itself) with an “Egyptian” voodoo doll-style execration ritual (the destruction of the wax figurines).17 Thus, it has very often been understood as the product of the Greek imagination, a chimeric and purely literary ritual, not least since lecanomancy rituals appear to have been otherwise unknown in Egypt before contact with the Greeks.18 But such a conclusion is perhaps somewhat overdrawn, since it has been demonstrated that the Mesopotamian divination procedure of interpreting the shapes of oil on water was known in Egypt as far back as the Ramesside period.19 Be that as it may, understanding the execration component of Nectanebo’s “lecanomancy” as a novelistic translation of the Egyptian king’s ritual duty makes perfect sense. The ancient pharaoh’s role, according to Egyptian tradition, was indeed to keep Egypt’s enemies (both cosmic and geographic) at bay. Priests performed rituals in every temple throughout Egypt on the king’s behalf in order to render those enemies harmless, and the efficacy of such rituals was also reinforced by the performative power of the iconography of the pharaoh slaughtering and smiting his foes, which figures prominently on many Egyptian temple walls.20 Indeed, Egyptian temples functioned as a kind of “magical” bulwark against enemies.21 In this respect, Nectanebo’s lecanomancy can very well be explained as an interpretatio Graeca of the Egyptian royal ideology’s symbolic apparatus.22 On the technical side, the fabrication and animation of small wax figurines by priests with supernatural powers in the Egyptian literature is quite frequent,23 and the destruction of wax figures was a procedure widely attested in the context of oath-keeping ceremonies in various parts of the Mediterranean world.24 In Pharaonic Egypt, however, such wax figurines usually were destroyed by fire, trampling or cutting, but very rarely by drowning in water.25 4. Apparition spells in the Graeco-Roman “magical” documentation Comparing Nectanebo’s “lecanomancy” with spells belonging to the corpus of Greek and Demotic documents from the Roman times and later, known as the Papyri Magicae Graecae et Demoticae (PGM and PDM), or simply the “magical papyri,” produces interesting parallels and reveals certain features that suggest a (re)writing of the Nectanebo episode sometime during the Roman period. For instance, the method of gazing into a bowl full of water could indeed be referred to as a lekanomanteia in Greek, or in Demotic a šn-hn(e) (“interrogation of a recipient”).26 In the magical papyri corpus, it was just one of the many techniques – alongside lychnomancy (gazing into the flame of an oil lamp), oneiromancy (dream divination), or necromancy (interrogating a dead spirit) – that could be used to perform what we could call “rituals of apparition.”27 The first step of these various rituals of apparition was always the same: to establish a relationship with a divine being, either by summoning him or by prompting a divine vision, in a preliminary ritual frequently called a σύστασις, “encounter” or “conjunction.” The spell itself, whose purpose most of the time was to ask the divinity one or more questions, could be called a λόγος αὔτοπτος or αὐτοψία (“(formula for a) direct vision”).28 The terminology of ancient magical practices, however, was not absolutely systematic, and instructions to accomplish rituals called “lecanomancies” or “direct visions” did not always involve the performance of precisely the same steps. Spells were often adjusted and combined with other techniques to allow for a wider range of purpose and expected outcomes. In our case, though, some spells from the magical papyri do contain ritual instructions that closely mirror the actions of Nectanebo, as described in the Alexander Romance. The most obvious example is the Greek charm PGM 4.154–285.29 According to ll. 164–169 the main purpose of this spell was to allow the user to obtain a “direct vision through bowl divination” (διὰ λεκάνης αὐτόπτου): “beholding the god (θεωρῶν τὸν θεὸν) in the water and hearing a voice from the god, which speaks in verses in answer to whatever you want. You will attain/see (οἴσεις/ὄψεις?) both the ruler of the universe and whatever you command, and he will speak on other matters which you ask about.” The technical instructions of this ritual are much longer than the procedure followed by Nectanebo, but one passage in particular (ll. 224–234) provides a close parallel to the Alexander Romance. There, the spell is again called a “direct vision of bowl divination,” as well as a “necromantic inquiry” (αὐτοπτικῆς λεκανομαντείας καὶ νεκυοαγογῆς σκέψις), and it informs the user that the nature of the spirit summoned depends on the type of water poured in the bowl: for instance, if the petitioner uses rainwater (ζήνιον [ὕδωρ], he will summon the “heavenly gods” (ἐπουρανίους θεούς). This is very similar to A, in which Nectanebo uses rainwater (ὕδατος ὀμβρίου) and calls upon “angels” and the Libyan god Ammon (τοὺς ἀγγέλους καὶ θεὸν Λιβύης Ἄμμωνα). To invoke the spirits of the dead (νέκυας), on the other hand, PGM IV.154–285 recommends using spring water (πηγαῖον), which also happens to be the type of water Nectanebo pours into the bowl in L (ὕδωρ πηγαῖον), although in that case he summons “gods of the spells” (θεοὺς τῶν ἐπῳδῶν), “etherial spirits” (ἀέρια πνεύματα) and the “demons below the earth” (καταχθονίους δαίμονας). According to PGM 4.154–285, after adding green olive oil in the water and uttering the spell’s formula (a step not included in the Romance), the spell caster could then see and talk with the divine being, just as it is said that Nectanebo was able to see and confer with his gods in the second instance of his “lecanomancy.” It seems, then, that the authors of both A and L of the Alexander Romance, when constructing the Nectanebo episode and describing the ritual of his “lecanomancy,” might have known and closely followed ritual instructions very similar to the ones found in the Greek divination spell from PGM 4.154–285.30 5. Nectanebo’s “lecanomancy” as an adaptation of a Pharaonic oracular ritual Nectanebo’s “lecanomancy” and the other PGM/PDM apparition spells moreover appear to loosely mirror the sequence of actions and the purposes of a series of pharaonic Egyptian oracular rituals known as pḥ-nṯr (a phrase that can be alternately translated as “divine audience,” “petition to the god,” or “to interrogate/reach the god”). Within the PDM, pḥ-nṯr appears to refer to a specific type of oneiromantic apparition spell, but in the Egyptian documentation from the Pharaonic period it actually is the name of a public or semi-public oracular consultation in which a petitioner could consult a divinity.31 It is for instance attested several times to describe an oracular hearing given by the god Amun in the great inscription of Djehutymose in the temple of Karnak (court IV, during the reign of Pinedjem II of the 21st dynasty). This inscription describes how on one day at the beginning of the 1st millennium bce, the great chamberlain Djehutymose asked the god for the confirmation of his priestly office and the absolution concerning some crime of which he was accused (he obtained it). The translation “divine audience” for pḥ-nṯr was first proposed by the Egyptologist Jean-Marie Kruchten to highlight the parallels observed between this type of oracular consultation with the god and the royal audiences with the pharaoh.32 The pḥ-nṯr of the Demotic “magical” papyri could very well be an adaptation of the ancient oracular pḥ-nṯr, with the purpose of provoking a divine apparition and to reproduce in private the conditions of these “divine audiences.”33 But oracular pḥ-nṯr rituals were not limited to the consultation of a divine being, whether in a public or semi-public oracular session, or in a private, oneiric context. A Hieroglyphic papyrus [BM 10587r]34 containing an oracular decree uttered by the god Thoth thus mentions the protection granted by the divinity against curses, demoniac aggressions, and the effect of every “evil petition/evil oracle to the god” (pḥ-n-nṯr bin).35 In this context, it seems that the power of a divine being summoned during a pḥ-nṯr could be used with ill intent to inflict a curse or a disease on another person. The same notion is also expressed in the legal proceedings of judgment concerning the failed “Harem conspiracy” conducted against Ramses III by some of his courtesans (1185–1151 bce): in Lee 1. 3–5, for instance, one of the convicted conspirers is accused of having “contacted the divinity” (pḥ-nṯr) in order to cause the guards to become sleepy, and then to have fabricated little figures of wax bearing some inscriptions (rmṯ n mnḥ sš.w), with the intent to further enchant (ḥkȝ.w) and confuse (stwhȝ) the persons in the palace.36 Here, the function of the ritual practice called a pḥ-nṯr is very similar to that of the “execration” rituals usually performed by the pharaoh against his enemies. From these two examples, it seems clear that a pḥ-nṯr in ancient Egypt could refer to a ritual whose aim was to contact a divinity for oracular purposes, but also to call on the power of a malevolent spirit to perform more nefarious deeds. Indeed, a closer inspection of the Graeco-Roman “magical” corpus reveals that some of the apparition spells both in Demotic and in Greek present many similarities in their sequence and function to the rituals called pḥ-nṯr in the old Egyptian tradition. For instance, a Greek lychnomancy from the 3rd c. ce [PGM 1.262–347]37 allows the ritualist to summon a daimôn sent by Apollo (or maybe Apollo himself), in order to ask him all kind of questions about the various arts of divination, and then also to learn from him how to inflict diseases on other persons (ll. 327–331): “And when he [scil. the daimôn] comes, ask him about what you wish, about the art of prophecy, about divination with epic verse, about the sending of dreams, about obtaining revelations in dream, about interpretations of dream, about causing disease (περὶ κατακλίσεως), about everything that is part of magical knowledge (ὅ[σ]ων ἐστὶν ἐν τῇ μαγικῇ ἐμπει[ρίᾳ]).” Another Greek example is the “spell of attraction of king Pitys” (PGM 4.1928–2005), which one must recite over a cup and which also bears the title “petition” (ἐξαίτησις) to Helios – another parallel to the Demotic pḥ-nṯr in the sense of “petition to the god.”38 This spell allows the caster to gain control of the spirit of a man who died under violent circumstances, and to use him as an assistant for all kinds of purposes, some of them potentially nefarious, as shown by the spirit capacity to act as an “avenger” (ll. 1943–1949): “I beg you, lord Helios, hear me NN and grant me power over the spirit of this man who died a violent death (τοῦ βιοθανάτου πνεύματος), from whose tent I hold [this], so that I may keep him with me, [NN] as helper and avenger (βοηθὸν καὶ ἔκδικον) for whatever business I crave for him.” A good share of the Graeco-Egyptian apparition rituals could also be adapted – as those cited in example above – into spells to summon a paredros or “assistant,” a kind of supernatural helper quite similar to the proverbial Arabic genie in the bottle.39 Other rituals performed by Nectanebo in the Alexander Romance are also reminiscent of ancient apparition rituals aimed at securing the help of a supernatural agent before being readapted to other purposes such as dream-sending and erotic curse. After his flight from Egypt and his arrival in Macedonia, Nectanebo, in order to make Olympias and Philip amenable to the idea that the “god Ammon” (actually Nectanebo in disguise) wished to bear a son by the queen, performs two rituals following a framework similar to the dream-sending spells of the magical papyri (Gr. ὀνειροπομπία; Dem. hb rsw.t).40 In the first one (1.5, L), Nectanebo constructs a small wax figurine of Olympias, calls upon some “demons made for the occasion” (τοὺς πρὸς τοῦτο πεποιημένους δαίμονας) and, with their help, whispers an erotic dream to the queen. In the second ritual (1.8.1–2), he “enchants” (μαγεύειν) a sea falcon and sends him forth with a prophetic dream to Philip. In both of these rituals, Nectanebo follows procedures similar to those described in the paredros-summoning spells from the Graeco-Roman “magical” corpus found in Egypt, in which, instead of calling upon an existing god or spirit, the ritualist is supposed to create his own supernatural assistant by “deifying” a creature such as a falcon.41 6. Conclusion: Egyptian cult practices in the Alexander Romance and beyond This short comparison of Nectanebo’s “lecanomancy” with its Egyptian background shows that the spell is far more than a Greek literary creation awkwardly blending together two different types of spells, a divination and a curse. From an Egyptian point of view, it appears to be a homogeneous oracular ritual, whose function is to invoke, question, and deploy the powers of a divine being. The relative accuracy of the ritual’s description in the Romance leads one to think that the narrative material used in this episode might have initially been written by some Egyptian priest, or at least by someone very knowledgeable in the technical and ritual practices of the Egyptian priesthood. The “lecanomancy,” in particular, appears faithfully to recapitulate many details related to the performance of some very old Egyptian cult practices, as it seems to be a literary metaphor for the pharaoh’s duty and the whole ritual machinery of the Egyptian sanctuaries. However, the sacred duties of the king seem here to be limited. While they can annihilate foreign armies and enthrall the Macedonian rulers, they are revealed to be powerless against his own gods. The rituals symbolically performed by the Egyptian priests and pharaohs to defend their country seem to have left an impression and to have been received and reinterpreted as “magic” by a wider public that Graeco-Roman readership of the Alexander Romance. The Arabic chronicler Ibn ‘Abd al-Ḥakīm (9th c.), cited by historian Maqrizi (15th c.), for instance, relate a very intriguing story about how the pharaoh-queen Dalukah kept her country safe after Moses had crossed the Red Sea and annihilated most of the Egyptian army. In this version, the queen herself does not hold “magical” powers, but relies on those of a witch named Badūr: So Badūr built a temple out of stone in the middle of Memphis, and she gave it four doors, one facing Mecca, one facing the sea, one facing west and one facing east. And she drew onto it pictures of horses, mules, donkeys, ships and men, and she said to them: “I have built for you a structure that will cause whoever wishes to attack you to perish, from whatever side they come, by land or by sea. And it will provide you with protection and shield you from the dangers of whoever comes towards you from any direction. For if they come on horses, mules or camels, by ship or on foot, these pictures will move on the side whence they are coming, and whatever you do to the pictures, the same will happen to them.” And when the news reached the kings around them that their rule was now in the hands of women, they set their sights on them and headed in their direction. And when they neared Egypt, the pictures in the temple moved, and the Egyptians got to work immediately, and however the Egyptians moved the pictures, and whatever they did to them, the same happened to the approaching troops. If they were horses, whatever they did to the painted horses in the temple, cutting their heads or their legs off, gouging their eyes out or splitting open their bellies, the same happened to the horses that were bound towards them. And the same was true of the ships and of the foot soldiers. They were the most knowledgeable of men in witchcraft, and the strongest in using it, and the news spread, and people rushed to them.42 The similarities between this description and the various excerpts of A mentioned above, e.g., the emphasis on the effect of the temple’s images on the enemy soldiers, horses, and ships, suggests that Ibn ‘Abd al-Ḥakīm might somehow have been influenced by a version of the Greek Alexander Romance when explaining how the magic of the ancient Egyptian worked.43 The traditions relative to the magical power of the ancient Egyptian images and practices remained vivid for many centuries, as witnessed by several Coptic and Islamic documents,44 and the last words of the historian Maqrizi in the same chapter: And the temples in Egypt still stand, in Upper Egypt and elsewhere, and within them are pictures which, when they are painted on some object, cause things to happen according to what they were drawn for and why they were made based on their theories about the laws of nature."
}