{
  "articleId": "isaw_paper27",
  "text": "ARTICLE_ID: isaw_paper27\nIn Almagest VIII 2 Ptolemy gives a description of the Milky Way, as seen from his Alexandrian observing location.In it, he mainly focuses on three aspects of his theme first, the location of the limits of the bands which constitute the Milky Way.He points these limits by selecting certain stars which are at or close to, the point in which the milk ceases to be perceptible.Second, he gives us some vague indications about the density of the milk along its path. These variations are conveyed through ambiguous phrases such as the indication that the milk is 201csomewhat denser201d (1f2003c103ad03bc03b1 03c003c503ba03bd03cc03c403b503c103b1) in some place, or with a 201csmoky201d (03ba03b103c003bd03ce03b403b703c2) appearance in other.While we cannot get a very precise image from these sentences, they nevertheless allow us to have a general picture of what he was looking at, and sometimes even relate his description to modern labels given to some regions of the galactic belt.1 Third, in his description Ptolemy also gives us a general description of the structure of the Milky Way, distinguishing between two main sections. One continuous to the south, and one which is located between the regions of Ara and Cygnus.This second, northern belt is itself cut in two parts by a dark region, which today we call 201cthe Great Rift201d, and Ptolemy described as 201c[2026] considerable gap of open space [2026]201d2.2b08#p1The description of the Milky Way is given after Ptolemys stellar catalogue in VIII 1, and before his instructions to build a solid globe in VIII 3. The order makes sense he needs to have the stellar labels and coordinates in order to use the stars themselves to describe and locate the milk in a meaningful way.Because the milk itself moved together with the rest of the fixed stars, it was natural to depict it together with them in the physical representations of the celestial sphere, such as the solid globes which were crafted in those days.2b08#p2Although much work has been devoted to the stellar catalogue of the Almagest, and also to the extant evidence of ancient celestial spheres, there is no substantial scholarly work devoted to Ptolemys description of the Milky Way. We can just barely, for example, find a couple of mentions in (Pedersen, 2010 259 and Neugebauer, 1975 890). I expect that this work will serve as a monograph that makes an initial survey of the topic, and provides the necessary groundwork to foster future studies.2b08#p3The first section of the paper deals with the location of the Milky Way in Ptolemys times for an Alexandrian observer.One of the more striking features of the text is that Ptolemy describes the entire Milky Way, beginning in Centaurus, moving towards the galactic center in Sagittarius, and going all the way round up to Argo. This would not be possible for an observer today. I will show, via a brief argument, how the effect of precession account for the difference, and how the milk was positioned in ancient times with respect to an observer in those parts of the world.2b08#p4The second section, which is the longest, is focused on Ptolemys description properly.First, I will give a general account of the structure Ptolemy gives the aforementioned two main belts, and how they are divided. Then, following the order of the Almagest, I will begin by the southern belt in Centaurus, and continue towards Sagittarius, all the way around.After that, I will focus on the two main parts of the northern belt, one on each side of the Great Rift.Finally, I will give some concluding remarks.2b08#p5The paper follows Ptolemys order, describing the appearance of the milk in successive constellations, starting in Centaurus. My analysis is made according to the following pattern first, I reproduce Ptolemys description in a given region.Ptolemy indicates the stars (mostly) following the labels he assigned to them in his catalogue.Therefore, I in turn indicate the corresponding star number for the catalogue.3 In most cases this is a straightforward procedure.Then, I also give modern identifications for the stars in Ptolemys catalogue. For this, I mostly use the identification given in Toomers edition.After this, I identify the location of each of the stars in a high-resolution image of the Milky Way.To avoid excessively big labels which would hinder a clear visualization, I number them in the image following the order of appearance in Ptolemys text.The caption of these images correlates these numbers with the modern names of the stars. Then, I do the same thing in Pannekoeks diagrams of the Milky Way (more on this below).Finally, I compare Ptolemys description with the depictions in the high-resolution photograph and Pannekoeks diagrams and analyze how they relate to each other.2b08#p6The use of images deserves some additional clarifications.The high-resolution photograph was produced by the European Southern Observatory as part of their GigaGalaxy Zoom Project, in association with astrophotographer Serge Brunier. Regarding Pannekoeks diagrams, they are taken from Die N00f6rdliche Milchstrasse (1920) and from Die S00fcdliche Milchstrasse (1928).They are isophotic charts4 that depict the constellations around the galactic equator, together with a numeric representation of the brightness of each region.The method he uses to measure the brightness of the milk is an adaptation of Argelanders method for measuring the brightness of stars (Pannekoek, 1920 2; 1928 11). It is based on a fairly sophisticated procedure that takes many normalpunkte or normalstelle, and produces a common measurement system, which is later combined with visual descriptions to produce accurate diagrams. A full explanation of the reasoning behind the values given to each region is beyond the scope of this paper.It can be found in (Pannekoek, 1920 2-5).The inclusion of Pannekoeks diagrams in this paper serves as an additional support to the presence of modern photographs, and as an objective instrument to evaluate the consistency of Ptolemys indications of brightness, particularly regarding the determination of the limits of the milk.2b08#p7Finally, I will assume a division of the celestial sphere by the galactic equator, where the north will be the hemisphere in which the north galactic and celestial poles are located, and south will be the other hemisphere. This is not always the convention used by Ptolemy, who is not consistent in this regard.Thus, while he sometimes talks about north and south, in other instances he refers to my northern and southern limits of the milk as the eastern and western limits, or the equivalent more advanced or rearmost limits.2b08#p8Position of the Milky Way as seen from Alexandria in Ptolemys times.The equatorial position of the galactic north for B1950.0 is 192;1500b0 for RA, and 27;2400b0 north for declination (Meeus, 1998 94). This means that the northernmost latitude from which the entire Milky Ways equator is visible today is about 27;3000b0.Because Alexandrias latitude is 31;1200b0 north, this shows that today it is not the case that the entire galactic plane is visible from Alexandrian latitudes the declination of the galactic north pole would have to be at least around 3100b0.2b08#p9While the effect of the variation of the obliquity of the ecliptic is negligible when it comes to the inclination of the galactic equator to the celestial equator, this is not the case with the effect of precession. The B1950.0 ecliptic position of the galactic north is 179;19,2900b0 for longitude, and 29;48,4300b0 north for latitude.If we assume a value of 50 per year for precession, we get a longitude for 140 of 154;11,900b0.This means a declination of the galactic north for 140 of 37;23,5000b0.2b08#p10So, in Ptolemys times, an observer at Alexandria would have been able to observe the entire equator of the Milky Way (201c[2026] the great circle drawn approximately along the middle of it [2026]201d Toomer, 1984 400) throughout one year. Nevertheless, because the varying width of the Milky Way spans several degrees on both sides of the galactic equator, the visibility of the entire galactic equator does not assure that the Milky Way itself will be wholly observable in all its details, particularly some sections near its rims.As we saw, Ptolemy would have been able to see up to about 37.500b0 - 3100b0 = 600b0 to the south of the southernmost point of the galactic equator. This is a region some 400b0 southeast of the intersection of the two lines in Crux, almost in the center of the Coalsack (point SP in Figure 1).The relation between maximum altitude and distance to this southernmost point in the galactic equator follows a sinusoidal curve, with a maximum altitude of about 37.500b0 + 3100b0 = 68.500b0 at the northernmost point of the galactic equator, which is about 1.500b0 to the northwest of the middle star in the 201cW201d of Cassiopeia (point NP in Figure 1). However, the altitude reached by each point of the galactic equator is not the only variable relevant to study the visibility of the belt of the Milky Way.The angle between the galactic equator and the horizon varies throughout the day.For an observer at Alexandria in 140 the maximum would have been, of course, 68.500b0.This means that while some points of the galactic equator might never rise more than 800b0 or 1200b0 above the horizon, the band of the Milky Way which is about 1500b0 in width on each side might still be mostly or entirely visible, due to the fact that at that moment the angle between the galactic equator and the horizon is large enough. In Figure 1 points I (in the constellation of Vela) and II (in the constellation of Ara) indicate the limits of the southern region where the visibility of the band is always less than 1500b0 to the south of the galactic equator.2b08#p11One last variable to remember is extinction, which is the absorbing and scattering effect that the atmosphere has on the light coming from the sky.As it is natural, the closer the object is to the horizon, the more relevant this effect becomes.2b08#p12Ptolemys description.Ptolemy begins his description by indicating the general structure of the Milky Way. He says that 201c[2026] the Milky Way is not strictly speaking a circle, but rather a belt of a sort of milky colour overall (whence it got its name); moreover this belt is neither uniform nor regular, but varies in width, colour, density and situation, and in one section is bifurcated [2026] The bifurcated part of the belt has one of its 2018forks, so to speak, near Ara, and the other in Cygnus.But, whereas the advance [part of the] belt is in no way attached to the other part, since it forms gaps both at the fork by Ara and at the fork by Cygnus, the rearmost part is joined to the remainder of the Milky Way and forms [with it] a single belt It is this belt which we shall describe first, beginning with its southernmost section.6The description is simple. Throughout most of the Milky Way, there is a single belt.But when we approach the center in Sagittarius from each side, we find that it bifurcates, with one belt being continuous with the rest, and another going towards the north.As Ptolemy will comment later on, this second belt is itself divided into two sections.Refer to Figure 2.Figure 2.Schematic representation of the structure of the Milky Way according to Ptolemy. The image is the same as that of Figure 1, but with inverted colors.The southern belt is continuous, while the northern one is close to the center, giving the forking impression Ptolemy refers to.The belt that is on the right (the fork in Ara) is curved, while the one on the left (the fork in Cygnus) runs much straighter.As Ptolemy says, he begins with the southern belt, and he does so by studying the milk in what was for him the southernmost constellation of the Milky Way Centaurus.Centaurus.Ptolemy begins his description of the Milky Way in Centaurus by locating it as passing through the legs of Centaurus7, and then says that in this region it is dimmer than in other parts. He then indicates that the star on the knee-bend of the right hind leg is a little further south than the line [bounding] the milk to the north8.The description is identical to the star XLIV 31 in his catalogue, and the identification as u03b3 Cru is certain.He then says that the same is true of two more stars, the star on the left front knee and the star under the right hind hock.9 In these cases the descriptions match to XLIV 36 (u03b2 Cru) and 32 (u03b2 Cen), respectively. Next, he defines the center of the band the star in the left hind lower leg lies in the middle of the milk10 Toomer identifies it as XLIV 33 (The star under the knee-bend of the left [hind] leg11, or u03b4 Cru, which is a reasonable identification.With respect to the southern rim, Ptolemy indicates that the stars on the hock of the same leg and on the right front hock are to the north of the southern rim by about 2u00b012 These stars can be identified with certainty as u03b1 Cru and u03b1 Cen, respectively. Finally, he indicates that the milk is somewhat denser in the region near the hind legs.Figure 3.The Milky Way in Centaurus. 1. u03b3 Cru, 2. u03b2 Cru, 3. u03b2 Cen, 4. u03b4 Cru, 5. u03b1 Cru, 6. u03b1 Cen.The Coalsack can be seen right below 2, and the luminous clouds of Carina to the right of the Cross.Credit European Space ObservatorySerge Brunier.Refer to Figure 3.The galactic equator passes just below 2 and above 3 (refer to Figure 4 for an accurate indication of its location). Ptolemys description indicates that 1, 2 and 3 are just below the northern rim of the milk, which is a strange description since their galactic latitudes are very different.If we compare this description to the photograph in Figure 3, and to Pannekoeks corresponding chart (see Figure 4) we can see that while 1 is certainly a little further south of the northern rim of the band13, 2 and 3 are much more separated. The positioning of 4 in the middle of the milk is stranger still.This is not because it is not on the galactic equator.The determination of this great circle is somewhat arbitrary, and Ptolemy might have in mind a circle a little bit to the north of our current determination of its position.The difficulty lies in the fact that 4 is to the north of 2, which was previously used to determine the northern rim. All this confusion is nevertheless understandable this part is, as we saw, the one with the worst visibility.Ptolemy would have not been able to see much under the Cross, and even the observations of those stars which were visible would have been much disturbed by their low altitude.Figure 4.Part of Plate V in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 78).The labels are those of Figure 3.This also explains why he does not mention one of the most salient features of this region, the Coalsack (at the center of Figure 4, and whose lack of luminosity is marked by Pannekoek with a definite 00).14 Ptolemy does, nevertheless, notice the increased brightness in the rear legs of the Centaur. He is likely referring to the bright clouds in Crux and Carina, clearly visible to the right of the Cross.Lupus and Ara.The next section he considers is within Lupus and Ara.He says that the northern rim of the milk is about 1.5u00b0 from the star on the rump of Lupus, and the southern rim encloses the star on the burning-apparatus of Ara, but just grazes the northernmost of the two stars close together on the brazier and the southernmost of the two stars in the base, while the star in the northern part of the brazier and the one in the middle of the brazier lie right in the milk.15 There are six stars in this description, and they can be identified with certainty. The one determining the northern rim is XLV 10 (u03b6 Lup).The one enclosed by the southern rim is XLVI 7 (u03b6 Ara).The two which are just grazed by the southern rim are XLVI 6 (u03b2 Ara) and XLVI 2 (u03b8 Ara).The last two, those which lie in the middle of the milk, are XLVI 4 (u03b5 Ara) and XLVI 3 (u03b1 Ara).Ptolemy ends this part of the description indicating that [t]hese sections are rather less dense.16Figure 5. The Milky Way in LupusAra. 1. u03b6 Lup, 2. u03b6 Ara, 3. u03b2 Ara, 4. u03b8 Ara, 5. u03b5 Ara, 6. u03b1 Ara.Credit European Space ObservatorySerge Brunier.Refer to Figure 5.From Lupus we can see u03b6 Lup, while we have several stars from Ara u03b6 Ara, u03b2 Ara, u03b8 Ara, u03b5 Ara and u03b1 Ara.Ptolemys description is fairly consistent with the photograph in Figure 5, and with Pannekoeks evaluation in Figure 6.While it seems that the 1u00bdu00b0 from 1 to the northern rim was a conservative estimate, in the case of the southern rim the limit indicated by 3 and 4 seems more accurate. As in the previous case, the low altitude explains the general lack of consistency the maximum altitude this region reached in Alexandria was about 11u00b0.With such values, atmospheric extinction plays a major role, and indeed this region would have seemed less dense than others.Had Ptolemy been able to have clearer views, he might have noticed the very bright Norma Star Cloud in-between 1 and 5, whose brightness Pannekoek marks with a 73.Figure 6. The constellations of Lupus and Ara are divided in Pannekoeks charts (Pannekoek, 1928 A78-80).Here we can see parts of plates VI (a) and V (b).Some of the stars near the border of the plates are depicted in both of them.The labels are those of Figure 5.Scorpius and Sagittarius.The following section is focused on Scorpius and Sagittarius.This is the part of the Milky Way which is in the direction of the galactic center, where the stellar population is the densest, and therefore the appearance of the milk is the brightest. He references many stars the northern part of the milk encloses the three joints before the sting of Scorpius and the nebulous mass to the rear of the sting, while the southern rim touches the star in the right front hock of Sagittarius, and encloses the star on his left hand.17 The three stars near the sting are XXIX 17, 18 and 19 (u03b8, u03b9 and u03ba Sco, respectively).The nebulous mass to the rear of the sting is M7, an open cluster which is about 0;40u00b0 across. In Ptolemys catalogue it is XXIX 22.18 The two stars in Sagittarius described here are XXX 25 (u03b7 Sgr) and 2 (u03b4 Sgr), respectively.He continues explaining that [t]he star on the southern portion of the bow is outside the milk, but the star on the point of the arrow lies in the middle of it, while the stars in the northern part of the bow also lie in it, each of them being a little more than 1u00b0 removed from one of the rims, the southern star from the southern rim, the northern star form the opposite rim.19 These four stars are XXX 3 (u03b5 Sgr), 1 (u03b3 Sgr), 4 (u03bb Sgr) and 5 (u03bc Sgr), respectively. He ends the section by pointing out that [t]he area near the three joints is somewhat denser, while the area around the point [of the arrow] is very dense indeed and appears smoky.20Figure 7.The Milky Way in ScorpiusSagittarius. 1. u03b8 Sco, 2. u03b9 Sco, 3. u03ba Sco, 4. M7 and G Sco (left and right, respectively), 5. u03b7 Sgr, 6. u03b4 Sgr, 7. u03b5 Sgr, 8. u03b3 Sgr, 9. u03bb Sgr, 10. u03bc Sgr.Almost at the center of the figure we can see the Large Sagittarius Star Cloud, at whose center is the galactic core. Almost on the 9-10 line, just to the left of 10, we can see the very bright M24, or Small Sagittarius Star Cloud.Credit European Space ObservatorySerge Brunier.Refer to Figure 7 and Figure 8.This description shows a remarkable match to the lines in Pannekoek that indicate, in his scale, a density of 30-40.Almost all of the stars that Ptolemy references, and which are in or close to, the sting, are within such areas. If we look at the location of 5, it is remarkably close to the line, while 6 is a couple of degrees inside that limit, just as Ptolemy says.Moreover, 7 is just outside the line, and 8 is indeed in the middle of it, lying almost at the very center of the Large Sagittarius Star Cloud.This explains Ptolemys note that the area is so dense as to appear smoky.Finally, the indication of 9 and 10 as being a little more than 1u00b0 removed from the northern and southern rims also fits the 30-40 limit Ptolemy seems to be following.Figure 8. Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 80).The labels are those of Figure 7.Ophiuchus, Aquila and Sagitta.Next, Ptolemy describes the parts of the Milky Way in Ophiuchus, Aquila and Sagitta, and it is a somewhat longer description than the previous ones The following section is a little less dense maintaining about the same width throughout.The star on the tip of the tail of the snake held by Ophiuchus lies in the open, a little more than one degree away from the advance rim of the milk, while the two most advanced of the bright stars below it lie right in the milk the southern one is 1u00b0 from the rear rim, and the northern one, 2u00b0 [from it].21 The three stars he is referring to here are XIV 18 (u03b8 Ser), 15 (u03bb Aql) and 12 (u03b4 Aql). He continues The rearmost of the stars in the right shoulder of Aquila touches the same rim, while the more advanced one is cut off inside it, as is also the more advanced, bright star of those in the left wing.22 This triplet refers to XVI 8 (u03c3 Aql), 7 (u03bc Aql) and 5 (u03b3 Aql) in Ptolemys catalogue.Furthermore, the bright star on the place between the shoulders and the two stars which lie on a straight line with it fall a little short of touching the same rim. Next, Sagitta is enclosed entirely within the milk.The star on the arrowhead lies one degree from the eastern rim, while the star on the notch lies two degrees from the western rim.The section around Aquila is slightly denser, and the remainder slightly less dense.23 The three aligned stars which he indicates are XVI 3 (u03b1 Aql), 6 (u03c6 Aql) and one which is not in the catalogue, u03c5 Aql, respectively.24 The two stars in Sagitta are XV 1 (u03b3 Sge) and 5 (u03b2 Sge).Figure 9. The Milky Way in OphiuchusAquilaSagitta. 1. u03b8 Ser, 2. u03bb Aql, 3. u03b4 Aql, 4. u03c3 Aql, 5. u03bc Aql, 6. u03b3 Aql, 7. u03b1 Aql, 8. u03c5 Aql, 9. u03c6 Aql, 10. u03b3 Sge, 11. u03b2 Sge.The Great Rift is clearly seen crossing the entire scene, coming from the top-right corner of the image.Credit European Space ObservatorySerge Brunier.Refer to Figure 9 and Figure 10. 1 is right in the middle of one of the darkest parts of the Great Rift, which explains Ptolemys description of it as lying in the open, i.e., outside the milk. Both 2 and 3 are approximately at the same distance from the southern rim.Ptolemys assertion that 2 is closer to the rim than 3 may be grounded on the fact that 2 is within a somewhat darker area than 3, and thus it may be that the milk there is a little bit thinner.Ptolemys description says that stars 4, 7, 8 and 9 either touch or fall a little short of touching the southern rim.In this case, then, it would seem that Ptolemys brightness-criterion for determining the rim of the milk is close to Pannekoeks 20. The limits indicated with the stars in Sagitta vaguely follow the limits imposed from the north by the Great Rift, and from the south by the gradual darkening of the sky.The regions brightness tends to gradually fade in the direction of Sagitta, and to be harshly interrupted to the north.This explains Ptolemys indication that Aquilas region is the brightest in the section of the Milky Way described here.Figure 10. Part of plate IV in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 D123).The labels are those of Figure 9.Cygnus and Cepheus.The regions in Cygnus and Cepheus are next Its north-western rim is defined in a reentrant angle by the star in the southern shoulder of Cygnus, the star under it in the same [southern] wing, and the two stars on the southern leg. 25 Even if their descriptions are not the same, we can match these four stars as IX 11, 10, 13 and 14 in Ptolemys catalogue. They correspond to u03bb, u03b5, u03bd and u03be Cyg, respectively.Its south-eastern rim is defined by the star in the tip of the southern wing-feathers, and encloses the two stars under the same wing outside the constellation, which are about 2u00b0 from it [the rim].The section around the wing is slightly denser.These stars are IX 12, 18 and 19 (u03b6, u03c4 and u03c3 Cyg, respectively).He ends the section with a somewhat detailed description The next section is continuous with that belt, but is much denser and seems to have a different starting-point. For it points towards the end parts of the other belt, but leaves a gap between it [and itself] on it southern side it joins the belt which we are currently describing, which is very rarefied at the junction; but after the point where it forms a gap with the other belt it gets denser, beginning from the bright star in the rump of Cygnus and the nebulous mass in the northern knee.Then it makes a slight bend as far as the star on the southern knee, and continues gradually diminishing in density, up to the tiara of Cepheus. The northern side is delimited by the southernmost of the three stars in the tiara and the star to the rear of those three, at which it also forms two outrunners, one verging to the north and east, the other to the south and east.The star in the rump of Cygnus is IX 5 (u03b1 Cyg), while the nebulous mass in the northern knee is IX 17 (u03c9 Cyg).The star on the southern knee is IX 14 (u03be Cyg), and the southernmost of the three stars in the tiara [of Cephus] corresponds to IV 9 (u03b5 Cep). Finally, the star to the rear [of the three in the tiara] is IV 13 (u03b4 Cep).Figure 11.The Milky Way in CygnusCepheus. 1. u03bb Cyg, 2. u03b5 Cyg, 3. u03bd Cyg, 4. u03be Cyg, 5. u03b6 Cyg, 6. u03c4 Cyg, 7. u03c3 Cyg, 8. u03b1 Cyg, 9. u03c9 Cyg, 10. u03b5 Cep, 11. u03b4 Cep.The southern belt is a lot dimmer than the northern one, which at this part shows the Cygnus Star Cloud.Credit European Space ObservatorySerge Brunier.Refer to Figure 11 and Figure 12. As Ptolemy says at the beginning of his description of the Milky Way, its two belts are joined in Cygnus.Since he is now describing the southern belt, here he begins by indicating the general direction of the reentrant angle it shows in this region.This is indicated by line 2-1-3-4, which is clearly tilted with respect to the galactic equator, and ends up right in the middle of the part where the belt is forked. The southern rim of this belt is indicated by 5, showing a near perfect coincidence with Pannekoeks determination.The 2u00b0 distance indicated by Ptolemy is about half of the distance implied by the limit he himself determined.Ptolemys comment about the slight increase in density around the wing might be due to the contrast the section shows with respect to the far darker regions to the north (the so called Northern Coalsack) and the east.Ptolemy then says that if one follows at the belt in the west-east direction, one will find that it bends to the north, in the direction of the northern belt, only that it is separated from it in the region indicated by the 8-9 line. Pannekoek gives a similar description in his plates, only that he puts the obscuration a little bit to the north-east than where Ptolemy does.There is, however, a clear dark cloud that comes from the north, the Funnel Cloud, which frames this northerly inclined section Ptolemy talks about.Ptolemy says that this inclined section of the belt goes as far south as 4, much less than the distanced Pannekoek indicates. His indication that the density diminishes to the west is, however, correct.Stars 10 and 11 indeed follow the northern rim of the belt, although Pannekoek indicates a slightly denser spot just above 10.Figure 12.The constellations of Cygnus and Cepheus are divided in Pannekoeks charts (Pannekoek, 1920 A116-118).Here we can see parts of plates V (a) and IV (b).The labels are those of Figure 11.Cassiopeia.After Cepheus, Ptolemy briefly describes the Milky Way at Cassiopeia Next the milk encloses the whole of Cassiopeia except for the star in the end of the leg. The southern rim is defined by the star in the head of Cassiopeia, and the northern rim by the star in the foot of the throne and the star in the lower leg of Cassiopeia.The other stars and all those round about this [constellation] lie in the milk.The areas near the rims are of thinner consistency, but those at the middle of Cassiopeia display a dense patch running the length [of the Milky Way].26 The star at the end of the leg which is left outside the milk is X 7 (u03b9 Cas). The star that defines the southern rim is X 1 (u03b6 Cas), and the two stars that define the northern rim are X 11 (u03ba Cas) and 6 (u03b5 Cas), respectively.Figure 13.The Milky Way in Cassiopeia. 1. u03b9 Cas, 2. u03b6 Cas, 3. u03ba Cas, 4. u03b5 Cas.Credit European Space ObservatorySerge Brunier.Refer to Figure 13 and Figure 14. 1 is clearly outside the milk, right in the middle of a darker patch.According to Pannekoeks rendition, line 3-4 indeed follows the northern rim, and 2 almost grazes the southern one. Pannekoek also supports Ptolemys indication that there is a strong difference between the much more luminous inner region of the belt at the constellation and the thinner consistency of the milk near the rims.27Figure 14.Part of plate V in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 A116).The labels are those of Figure 13.Perseus.Perseus is the next constellation the righthand parts of Perseus are enclosed in the milk. Furthermore, its northern edge, which is very rarified, is defined by the lone star outside the right knee of Perseus, and its southern edge, which is very dense, by the bright star on his right side and by the two rearmost stars of the three to the south of that.These four stars are XI 28 (HIP 19949), 7 (u03b1 Per), 9 (u03c8 Per) and 10 (u03b4 Per), respectively.Then, he continues Enclosed in it also are the nebulous mass on the hilt, the star in the head, the star in the right shoulder and the star on the right elbow. The quadrilateral in the right knee and also the star on the same calf lie in the midst of the milk, while the star in the right heel is also inside it, a little distance from the southern border.The nebulous mass refers to XI 1, which is a double cluster NGC 884 and NGC 869.The star in the head is XI 5 (u03c4 Per), the star in the right shoulder is XI 3 (u03b3 Per), and the star on the right elbow XI 2 (u03b7 Per). Afterwards, the quadrilateral in the right knee is a reference to XI 16, 17, 18, 19 (b, u03bb, c and u03bc Per, respectively).Finally, the stars in the right calf and heel are XI 20 (d Per) and 21 (58 Per), respectively.Figure 15.The Milky Way in Perseus. 1. HIP 19949, 2. u03b1 Per, 3. u03c8 Per, 4. u03b4 Per, 5. NGC 884 and NGC 869, 6. u03c4 Per, 7. u03b3 Per, 8. u03b7 Per, 9. b Per, 10. u03bb Per, 11. c Per, 12. u03bc Per, 13. d Per, 14. 58 Per. Credit European Space ObservatorySerge Brunier.Refer to Figure 15 and Figure 16.Ptolemy says that the northern rim, which is not bright, is defined by 1.The southern one, much brighter, by 2, 3 and 4.Ptolemys star choices seem to enhance the contrast between both limit of the Milky Way.While it is true that there is a general noticeable difference between them, the three stars he selected for the southern rim are precisely at a particularly bright spot in that region, as it can be seen in Pannekoeks diagram, where it is labelled with a 32. The rest of the description is accurate, inasmuch as all the stars he lists are between the two limits he indicated.Auriga.Auriga is the next constellation, displaying a thinner consistency.The star on the left shoulder, called Capella, and the two stars on the right forearm fall just short of touching the north-eastern rim of the milk, while the small star over the left foot in the lower hem define the south-western edge. In Ptolemys catalogue Capella is XII 3.The two stars he refers to are XII 5 and 6 (u03bd and u03b8 Aur), respectively.The one that defines the southern rim is probably XII 14 (14 Aur, although the identification is not certain28).The star over the right foot lies half a degree within the same edge, and the two stars close together on the left forearm, called Haedi, lie in the middle of the belt.The first of these three is, XII 12 (u03c7 Aur), and the Haedi are XII 8 and 9 (u03b7 and u03b6 Aur), respectively.Figure 17. The Milky Way in Auriga. 1.Capella, 2. u03bd Aur, 3. u03b8 Aur, 4. 14 Aur, 5. u03c7 Aur, 6. the Haedi.Credit European Space ObservatorySerge Brunier.Refer to Figure 17 and Figure 18.Both the photograph and Pannekoeks diagram supports Ptolemys assertion that the Milky Way is at this point much dimmer.In fact, Capellas galactic longitude is about 160u00b0, which explains the low density of stars in Auriga.Capella is just to the north of the limit Pannekoek determines, as does Ptolemy. Ptolemy seems to recognize that the milk makes a little turn to the north, because he says that 3 and 4 are within it, almost touching the border, even if they are both to the north of Capella.The southern rim also shows a coincidence between both authors.As in other instances, Ptolemys measurements regarding the distance of a star to a rim of the milk are unsatisfactory 5 is at least three times away from the southern rim than what Ptolemy indicates. The reference to the Haedi lying in the middle of the belt is rather ambiguous.Although it is not easy to determine this with certainty, it would seem, nevertheless, that they are almost on the southern rim.Figure 18.Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 D123).The labels are those of Figure 17.Gemini.Ptolemy then says Next the milk goes through the legs of Gemini, displaying a certain amount of density in elongated form just over the stars at the ends of the legs. Now the advance edge of the milk is defined by the rearmost of the three stars on a straight line under the right foot of Auriga, by the rearmost star of the two in the staff of Orion and by the northernmost of the four stars on his [Orions] hand The stars that define the southern rim are XXIV 19 (1 Gem), and XXXV 12 and 9 (u03c72 and 72 Ori), respectively.He then continues the brilliant star under the right hand of Auriga and the star in the rear foot of the rear twin are approximately 1u00b0 inside the rear edge, while the stars in the other feet lie in the midst of the milk. The two stars 1u00b0 inside the milk are XXIV 20 and 18 (u03ba Aur and u03be Gem), respectively.The stars in the other feet are XXIV 17, 16, 15 and 14 (u03b3, u03bd, u03bc and u03b7 Gem, respectively).Figure 19.The Milky Way in Gemini. 1. 1 Gem, 2. u03c72 Ori, 3. 72 Ori, 4. u03ba Aur, 5. u03be Gem, 6. u03b3 Gem, 7. u03bd Gem, 8. u03bc Gem, 9. u03b7 Gem.Credit European Space ObservatorySerge Brunier.Refer to Figure 19 and Figure 20.According to Ptolemy, there is a particular dense region around 5-9. If compared to Auriga, the cloud of relative brightness in that region is more continuous, thus justifying the elongated form Ptolemy refers to.However, we do not find any particularly bright spot in these parts.The southern limit is defined, according to Ptolemy, by 1-3.Both Figures indicate that this is probably too septentrional.Ptolemys location of 4 and 5 as being 1u00b0 inside the northern edge is also incorrect. In both cases, it seems that he is narrowing the width of the milk.This may be due to the fact that, at this point, we are again approaching the southernmost point of the Milky Way (SP in Figure 1), although we are still not within the 15u00b0 of maximum altitude zone (i.e, the zone between I and II in Figure 1).Ptolemy also says that stars 6-9 are in midst of the milk, a comment which is difficult to understand, given that they are located at a similar galactic longitude than 5, and the milk is fairly consistent in its width all across the constellation.Figure 20. Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 D123).The labels are those of Figure 19.Canis Minor and Major.The Almagest then says that the belt passes by Canis Minor and Canis Major it leaves the whole of Canis Minor outside the milk no small distance to the east, and leaves Canis Major too outside to the west, almost in its entirety; for the star on its ears is caught by a sort of cloud which projects and which then almost touches the three stars in the neck of Canis Major next to that [star] towards the ear, while the lone star over the head of Canis Major, outside it and at some distance, is about 2 u00bdu00b0 inside the eastern rim. The consistency in this whole region is somewhat thinner The star on its ears is XXXVIII 2 (u03b8 CMa), and the three stars in the neck are XXXVIII 3, 4 and 5 (u03bc, u03b3 and u03b9 CMa, respectively).Finally, the lone star may be XXXVIII 19 (u03b4 Mon29).Refer to Figure 21 and Figure 22.Canis Minor (Procyon) is indeed well outside the milk, as is Canis Major (Sirius).It is not clear what is the shape of the cloud which projects towards 4, 5 and 6. Nevertheless, Pannekoeks diagram shows an increased brightness around 3, one which could be seen as coming from the north.The location of 7 2;30u00b0 within the milk is approximately accurate.After that the milk passes through Argo.The western rim of the belt is defined by the northernmost and most advanced of the stars in the little shield in the poop.This is XL 5 (m Pup).And continues The star in the middle of the little shield, the two stars close together under it, the bright star at the beginning of the deck near the steering-oar and the midmost of the three stars in the keel are just shorth of touching the same [southern] edge. These five stars are XL 6 (k Pup), XL 8 and 9 (3 and 1 Pup), XL 17 (u03b6 Pup) and XL 38 (u03b4 Vel).The northernmost of the three stars in the mast-holder defined the eastern rim, while the bright star in the stern-ornament is 1u00b0 within the same edge, and the bright star under the rearmost little shield in the deck is the same amount, 1u00b0, outside the same edge.These are XL 22, 2 and 31 (NY Vel, u03c1 Pup and u03bb Vel, respectively). Ptolemy then says that [t]he southernmost of the two brilliant stars in the middle of the mast touches the same edge, and the two bright stars at the point where the keel is cut off are about 2u00b0 inside the advance rim.At that point the milk joins the belt through the legs of Centaurus.The stars are, in the order they are referenced XL 27 (u03b2 Pyx) and XL 35 and 36 (u03b3 Vel and u03c7 Car).Finally, he closes the section by indicating that [t]he consistency in this area too, throughout Argo, is somewhat rarefied, but the sections of it around the little shield, the mast-holder and the point where the keel is cut off are more dense.30Refer to Figure 23 and Figure 24. As in other cases, Ptolemy seems to be defining the limit of the belt with a brightness that is around the value 20 in Pannekoeks system stars 1 to 5 are indeed at or close to that line.Stars 6 and 9 are also close to the limit, but on the other side, although Pannekoek locates them a bit inside the 20 limit.The positions of 7 and 8 as being 1u00b0 on each side of the northern limit are not accurate the figure should be three or four times greater. The location of 10 as being about 2u00b0 inside the southern belt is a good one, although it is strange that he says the same about 11, which is clearly much farther away from the milk, as it can be seen in both figures.Ptolemys commentary that the regions close to 2, 6 and 10-11 are broadly true, as Pannekoeks diagram shows (again, the inclusion of 11 does not entirely fit).Figure 24.Part of Plate IV in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 77). The labels are those of Figure 23.The northern belt Scorpius, Ophiuchus, Serpens.After the description of the southern belt, Ptolemy goes back to his original division, and describes the northern, curved belt seen in the direction of the galactic center.As I said earlier, this northern belt is divided in two by what Ptolemy describes as a considerable gap of open space31, which is the dark cloud we know today as the Great Rift. We will begin by looking at the first half of the description Ptolemy makes of this part of the Milky Way.Ptolemy begins by indicating that it encloses the three joints of Scorpius nearest the body, but leaves the rearmost star of the three in the body 1u00b0 outside its western rim.The star in the fourth joint lies in the open space between the two belts, about the same distance from each, a little more than 1u00b0.32 These stars in Scorpius are easily identifiable as XXIX 12, 13, 14, 9 and 16. Their modern names are u03b5, u03bc, u03b6, u03c4 and u03b7 Sco, respectively.He continues After that the advance belt turns aside to the east, in the shape of a segment of a circle, defining the advance edge of the milk by the star on the right knee of Ophiuchus, and the rear edge by the star on the same [right] shin, while the most advanced of the stars at the end of the same [right] leg touches the same edge.Subsequently the western rim is defined by the star under the right elbow of Ophiuchus, and the eastern rim by the more advanced of the two stars in the same [right] hand.33 The knee of Ophiuchus is XIII 12 (u03b7 Oph), and its shin is XIII 13 (u03be Oph). The advanced star in the right leg is XIII 14 (36 Oph).The stars that define the two rims are XIII 9 (u03bc Oph) and 10 (u03bd Oph), respectively.Ptolemy ends with this section with the indication that [f]rom that point on there is a considerable gap of open space, in which lie the two stars on the tail of Serpens next to the star in the tip [of the tail].The whole of the section of this belt which we have [just] finished describing consists of an extremely fine and almost aery substance, except for the area enclosing the three joints [of Scorpius], which is somewhat more concentrated.34 The three stars on the tail of Serpens are XIV 16 (u03b6 Ser), 17 (u03b7 Ser) and 18 (u03b8 Ser).Figure 25. The northern belt of the Milky Way in ScorpiusOphiuchusSerpens. 1. u03b5 Sco, 2. u03bc Sco, 3. u03b6 Sco, 4. u03c4 Sco, 5. u03b7 Sco, 6. u03b7 Oph, 7. u03be Oph, 8. 36 Oph, 9. u03bc Oph, 10. u03bd Oph, 11. u03b6 Ser, 12. u03b7 Ser, 13. u03b8 Ser.Credit European Space ObservatorySerge Brunier.Refer to Figure 25 and Figure 26.Both images confirm the inclusion of Scorpius joints 1 to 3 beings inside the milk.His indication that 4 is 1u00b0 to the north of it is exaggerated. While the 1u00b0 which supposedly separates 5 from both belts is uncertain, the photograph clearly shows that he is right in putting it in the darkness between both.The shape of this section of the milk is indeed curved.The indication that 6, and 7-8 mark the northern and southern limits is very accurate.Stars 9 and 10, however, seem to be well outside the milk, beyond its end-limits.The indication that 11, 12 and 13 are within the Great Rift is also accurate. Ptolemys comment that the area around 1-3 is more concentrated than the rest of this curved section does not seem to have much grounding.Figure 26.Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 80).The labels are those of Figure 25.The northern belt Cygnus.In this section we will look at the last part of Ptolemys description of the Milky Way, which is focused on the part of the northern belt on the other side of the Great Rift. Ptolemy says After the gap the milk again makes a fresh beginning at the four stars to the rear of the right shoulder of Ophiuchus.The eastern rim of this belt is defined (being just grazed) by the lone brilliant star under the tail of Aquila, while the opposite rim is defined by the star which is some distance to the north of the four just mentioned.35 The set of four stars is comprised of XIII 25, 26, 27, 28 (66, 67, 68 and 70 Oph, respectively). The brilliant star which defines one rim is XVI 9 (u03b6 Aql), and the star that defines the other one is XIII 29 (72 Oph).Ptolemy continues From there on this belt, besides being rarefied, is also contracted into a narrow space in the area which is in advance of the star in the beak of Cygnus, so as to produce the appearance of a gap.However, the remained of it, from the star in the beak up to the star in the breast of Cygnus, is wider and considerably denser. The star in the neck of Cygnus lies in the middle of the dense section. A rarefied section branches off to the north from the star in the breast as far as the star in the shoulder of the right wing and the two stars close together in the right foot.From this point, as we said, occurs a clear gap to the other belt, stretching from the above-mentioned stars in Cygnus up to the bright star in the rump.36 The star in the beak of Cygnus is IX 1 (u03b2 Cyg) and the one in the breast is IX 4 (u03b3 Cyg). The stars in the neck and the right wing are IX 3 and 6 (u03b7 and u03b4 Cyg, respectively), and the two stars in the right foot are IX 15 and 16 (u03bf1 and u03bf2 Cyg, respectively).Finally, the star in the rump is IX 5 (u03b1 Cyg).Figure 27.The northern belt of the Milky Way in Cygnus. 1. 66 Oph, 2. 67 Oph, 3. 68 Oph, 4. 70 Oph, 5. u03b6 Aql, 6. 72 Oph, 7. u03b2 Cyg, 8. u03b3 Cyg, 9. u03b7 Cyg, 10. u03b4 Cyg, 11.Close together, u03bf1 and u03bf2 Cyg, 12. u03b1 Cyg. Credit European Space ObservatorySerge Brunier.Refer to Figure 27 and Figure 28.Ptolemys indication that the group 1-4 marks the beginning of this part of the northern milk is accurate, as is the indication that 5 just grazes its southern rim.The indication that 6 defines the northern rim is also supported by both figures.Ptolemy then says that the belt rarifies and contracts in the area in advance of 7. This description is both subtle, and accurate.He then says that at this point a much wider and denser region begins, from 7 up to 8.He is referring to the modern Cygnus Star Cloud, one of the most striking features of the Milky Way for modern boreal observers.Star 9 is indeed right in the middle of the star cloud.The following part of the text is not so clear it is possible that Ptolemy was looking at the set of 8, 10 and 11 as the markers of a part of the cloud which has the shape of an inverted Indeed, while 10 and 11 are connected by a soft stripe of the milk, the section between 8 and 12 is clearly occupied by a dark spot. This spot marks, as Ptolemy says, the division between this section of the northern belt, and the much larger and continuous southern belt.Conclusion.A description of the Milky Way is something of a surprising element in a work such as the Almagest.While the rest of the work is devoted to themes which are potentially tractable via precise mathematical tools, in this chapter he is dealing with something that, to an extent, escapes this approach. Here Ptolemy uses the coordinates of stars to locate the limits of the Milky Way, or to point to this or that of its features.But this is only part of the work.Given that the Milky Way has a complex structure, with different densities and variable shapes along its path, Ptolemy has to combine his mathematical skills with qualitative visual descriptions, in order to convey an appropriate image of his subject. There is here no theory of the Milky Way, no attempt at investigating its nature.He is aware that he is looking at something that is very apparent even to the casual eye37, and his aim seems to be just to give this phenomenon its proper place within the wider astronomical framework he is developing, by describing it to a certain level of detail and fixing it with respect to the star catalogue he had already given.The mixed nature of the work is comparable to his geographical books, where we can find the subtle descriptions of borders between regions together with the mathematical discussions about, and determinations of, geographical coordinates of many locations.38 The result of this application of dual skills to the Milky Way is, if not superb, at least with some notorious merits.Ptolemy recognized many of the main features of the Milky Way not only the more obvious divisions at Ara and Cygnus, but also possibly the nebulae in Crux and Carina (near the hind legs of the Centaur), the Large Sagittarius Star Cloud, the Great Rift and the Cygnus Star Cloud. The use of stars to determine the limits of the milk and areas of particular interest are, in most cases, very accurate.There are, however, exceptions.To see the most salient discrepancies we must look at the positions Ptolemy indicated for u03c4 and u03c3 Cyg in the CygnusCepheus section, of u03c7 Aur in Auriga, u03c1 Pup and u03bb Vel in the region of Argo.As I repeated throughout the paper, it seems that Ptolemy generally considered the rims of the Milky Way to be located at the level of brightness which Pannekoek labels with a 20. There is, nevertheless, a pattern of deviation from this general value.As the belt gets closer to the center, Ptolemy tends to diminish its width to Pannekoeks value of 30 and even 40.This may have something to do with the fact that there is a high contrast between the very bright clouds in Sagittarius, and the dark clouds which are intertwined with them.Also, it is possible that the low altitude this area had as seen from Alexandria at the time, with the high effect that extinction had because of this, tended to lower the apparent brightness of the region. As we saw in the cases of Lupus and Ara, this should not be discarded.Pannekoek himself points to this difficulty related to altitude It can be seen from this description that Ptolemy did not notice the Coalsack nor the division into two streams in u03b1 Cen, which is understandable given the low altitude of those parts above the Alexandrian horizon.For him the bifurcation only begins in Ara-Norma.Whatever the case, Ptolemys description conveys a good image of both the general structure of the Milky Way and a good amount of its fine details. (Pannekoek, 1928 A63). In Almagest VIII 2 Ptolemy gives a description of the Milky Way, as seen from his Alexandrian observing location.In it, he mainly focuses on three aspects of his theme first, the location of the limits of the bands which constitute the Milky Way.He points these limits by selecting certain stars which are at or close to, the point in which the milk ceases to be perceptible.Second, he gives us some vague indications about the density of the milk along its path. These variations are conveyed through ambiguous phrases such as the indication that the milk is 201csomewhat denser201d (1f2003c103ad03bc03b1 03c003c503ba03bd03cc03c403b503c103b1) in some place, or with a 201csmoky201d (03ba03b103c003bd03ce03b403b703c2) appearance in other.While we cannot get a very precise image from these sentences, they nevertheless allow us to have a general picture of what he was looking at, and sometimes even relate his description to modern labels given to some regions of the galactic belt.1 Third, in his description Ptolemy also gives us a general description of the structure of the Milky Way, distinguishing between two main sections. One continuous to the south, and one which is located between the regions of Ara and Cygnus.This second, northern belt is itself cut in two parts by a dark region, which today we call 201cthe Great Rift201d, and Ptolemy described as 201c[2026] considerable gap of open space [2026]201d2.2b08#p1The description of the Milky Way is given after Ptolemys stellar catalogue in VIII 1, and before his instructions to build a solid globe in VIII 3. The order makes sense he needs to have the stellar labels and coordinates in order to use the stars themselves to describe and locate the milk in a meaningful way.Because the milk itself moved together with the rest of the fixed stars, it was natural to depict it together with them in the physical representations of the celestial sphere, such as the solid globes which were crafted in those days.2b08#p2Although much work has been devoted to the stellar catalogue of the Almagest, and also to the extant evidence of ancient celestial spheres, there is no substantial scholarly work devoted to Ptolemys description of the Milky Way. We can just barely, for example, find a couple of mentions in (Pedersen, 2010 259 and Neugebauer, 1975 890). I expect that this work will serve as a monograph that makes an initial survey of the topic, and provides the necessary groundwork to foster future studies.2b08#p3The first section of the paper deals with the location of the Milky Way in Ptolemys times for an Alexandrian observer.One of the more striking features of the text is that Ptolemy describes the entire Milky Way, beginning in Centaurus, moving towards the galactic center in Sagittarius, and going all the way round up to Argo. This would not be possible for an observer today. I will show, via a brief argument, how the effect of precession account for the difference, and how the milk was positioned in ancient times with respect to an observer in those parts of the world.2b08#p4The second section, which is the longest, is focused on Ptolemys description properly.First, I will give a general account of the structure Ptolemy gives the aforementioned two main belts, and how they are divided. Then, following the order of the Almagest, I will begin by the southern belt in Centaurus, and continue towards Sagittarius, all the way around.After that, I will focus on the two main parts of the northern belt, one on each side of the Great Rift.Finally, I will give some concluding remarks.2b08#p5The paper follows Ptolemys order, describing the appearance of the milk in successive constellations, starting in Centaurus. My analysis is made according to the following pattern first, I reproduce Ptolemys description in a given region.Ptolemy indicates the stars (mostly) following the labels he assigned to them in his catalogue.Therefore, I in turn indicate the corresponding star number for the catalogue.3 In most cases this is a straightforward procedure.Then, I also give modern identifications for the stars in Ptolemys catalogue. For this, I mostly use the identification given in Toomers edition.After this, I identify the location of each of the stars in a high-resolution image of the Milky Way.To avoid excessively big labels which would hinder a clear visualization, I number them in the image following the order of appearance in Ptolemys text.The caption of these images correlates these numbers with the modern names of the stars. Then, I do the same thing in Pannekoeks diagrams of the Milky Way (more on this below).Finally, I compare Ptolemys description with the depictions in the high-resolution photograph and Pannekoeks diagrams and analyze how they relate to each other.2b08#p6The use of images deserves some additional clarifications.The high-resolution photograph was produced by the European Southern Observatory as part of their GigaGalaxy Zoom Project, in association with astrophotographer Serge Brunier. Regarding Pannekoeks diagrams, they are taken from Die N00f6rdliche Milchstrasse (1920) and from Die S00fcdliche Milchstrasse (1928).They are isophotic charts4 that depict the constellations around the galactic equator, together with a numeric representation of the brightness of each region.The method he uses to measure the brightness of the milk is an adaptation of Argelanders method for measuring the brightness of stars (Pannekoek, 1920 2; 1928 11). It is based on a fairly sophisticated procedure that takes many normalpunkte or normalstelle, and produces a common measurement system, which is later combined with visual descriptions to produce accurate diagrams. A full explanation of the reasoning behind the values given to each region is beyond the scope of this paper.It can be found in (Pannekoek, 1920 2-5).The inclusion of Pannekoeks diagrams in this paper serves as an additional support to the presence of modern photographs, and as an objective instrument to evaluate the consistency of Ptolemys indications of brightness, particularly regarding the determination of the limits of the milk.2b08#p7Finally, I will assume a division of the celestial sphere by the galactic equator, where the north will be the hemisphere in which the north galactic and celestial poles are located, and south will be the other hemisphere. This is not always the convention used by Ptolemy, who is not consistent in this regard.Thus, while he sometimes talks about north and south, in other instances he refers to my northern and southern limits of the milk as the eastern and western limits, or the equivalent more advanced or rearmost limits.2b08#p8Position of the Milky Way as seen from Alexandria in Ptolemys times.The equatorial position of the galactic north for B1950.0 is 192;1500b0 for RA, and 27;2400b0 north for declination (Meeus, 1998 94). This means that the northernmost latitude from which the entire Milky Ways equator is visible today is about 27;3000b0.Because Alexandrias latitude is 31;1200b0 north, this shows that today it is not the case that the entire galactic plane is visible from Alexandrian latitudes the declination of the galactic north pole would have to be at least around 3100b0.2b08#p9While the effect of the variation of the obliquity of the ecliptic is negligible when it comes to the inclination of the galactic equator to the celestial equator, this is not the case with the effect of precession. The B1950.0 ecliptic position of the galactic north is 179;19,2900b0 for longitude, and 29;48,4300b0 north for latitude.If we assume a value of 50 per year for precession, we get a longitude for 140 of 154;11,900b0.This means a declination of the galactic north for 140 of 37;23,5000b0.2b08#p10So, in Ptolemys times, an observer at Alexandria would have been able to observe the entire equator of the Milky Way (201c[2026] the great circle drawn approximately along the middle of it [2026]201d Toomer, 1984 400) throughout one year. Nevertheless, because the varying width of the Milky Way spans several degrees on both sides of the galactic equator, the visibility of the entire galactic equator does not assure that the Milky Way itself will be wholly observable in all its details, particularly some sections near its rims.As we saw, Ptolemy would have been able to see up to about 37.500b0 - 3100b0 = 600b0 to the south of the southernmost point of the galactic equator. This is a region some 400b0 southeast of the intersection of the two lines in Crux, almost in the center of the Coalsack (point SP in Figure 1).The relation between maximum altitude and distance to this southernmost point in the galactic equator follows a sinusoidal curve, with a maximum altitude of about 37.500b0 + 3100b0 = 68.500b0 at the northernmost point of the galactic equator, which is about 1.500b0 to the northwest of the middle star in the 201cW201d of Cassiopeia (point NP in Figure 1). However, the altitude reached by each point of the galactic equator is not the only variable relevant to study the visibility of the belt of the Milky Way.The angle between the galactic equator and the horizon varies throughout the day.For an observer at Alexandria in 140 the maximum would have been, of course, 68.500b0.This means that while some points of the galactic equator might never rise more than 800b0 or 1200b0 above the horizon, the band of the Milky Way which is about 1500b0 in width on each side might still be mostly or entirely visible, due to the fact that at that moment the angle between the galactic equator and the horizon is large enough. In Figure 1 points I (in the constellation of Vela) and II (in the constellation of Ara) indicate the limits of the southern region where the visibility of the band is always less than 1500b0 to the south of the galactic equator.2b08#p11One last variable to remember is extinction, which is the absorbing and scattering effect that the atmosphere has on the light coming from the sky.As it is natural, the closer the object is to the horizon, the more relevant this effect becomes.2b08#p12Ptolemys description.Ptolemy begins his description by indicating the general structure of the Milky Way. He says that 201c[2026] the Milky Way is not strictly speaking a circle, but rather a belt of a sort of milky colour overall (whence it got its name); moreover this belt is neither uniform nor regular, but varies in width, colour, density and situation, and in one section is bifurcated [2026] The bifurcated part of the belt has one of its 2018forks, so to speak, near Ara, and the other in Cygnus.But, whereas the advance [part of the] belt is in no way attached to the other part, since it forms gaps both at the fork by Ara and at the fork by Cygnus, the rearmost part is joined to the remainder of the Milky Way and forms [with it] a single belt It is this belt which we shall describe first, beginning with its southernmost section.6The description is simple. Throughout most of the Milky Way, there is a single belt.But when we approach the center in Sagittarius from each side, we find that it bifurcates, with one belt being continuous with the rest, and another going towards the north.As Ptolemy will comment later on, this second belt is itself divided into two sections.Refer to Figure 2.Figure 2.Schematic representation of the structure of the Milky Way according to Ptolemy. The image is the same as that of Figure 1, but with inverted colors.The southern belt is continuous, while the northern one is close to the center, giving the forking impression Ptolemy refers to.The belt that is on the right (the fork in Ara) is curved, while the one on the left (the fork in Cygnus) runs much straighter.As Ptolemy says, he begins with the southern belt, and he does so by studying the milk in what was for him the southernmost constellation of the Milky Way Centaurus.Centaurus.Ptolemy begins his description of the Milky Way in Centaurus by locating it as passing through the legs of Centaurus7, and then says that in this region it is dimmer than in other parts. He then indicates that the star on the knee-bend of the right hind leg is a little further south than the line [bounding] the milk to the north8.The description is identical to the star XLIV 31 in his catalogue, and the identification as u03b3 Cru is certain.He then says that the same is true of two more stars, the star on the left front knee and the star under the right hind hock.9 In these cases the descriptions match to XLIV 36 (u03b2 Cru) and 32 (u03b2 Cen), respectively. Next, he defines the center of the band the star in the left hind lower leg lies in the middle of the milk10 Toomer identifies it as XLIV 33 (The star under the knee-bend of the left [hind] leg11, or u03b4 Cru, which is a reasonable identification.With respect to the southern rim, Ptolemy indicates that the stars on the hock of the same leg and on the right front hock are to the north of the southern rim by about 2u00b012 These stars can be identified with certainty as u03b1 Cru and u03b1 Cen, respectively. Finally, he indicates that the milk is somewhat denser in the region near the hind legs.Figure 3.The Milky Way in Centaurus. 1. u03b3 Cru, 2. u03b2 Cru, 3. u03b2 Cen, 4. u03b4 Cru, 5. u03b1 Cru, 6. u03b1 Cen.The Coalsack can be seen right below 2, and the luminous clouds of Carina to the right of the Cross.Credit European Space ObservatorySerge Brunier.Refer to Figure 3.The galactic equator passes just below 2 and above 3 (refer to Figure 4 for an accurate indication of its location). Ptolemys description indicates that 1, 2 and 3 are just below the northern rim of the milk, which is a strange description since their galactic latitudes are very different.If we compare this description to the photograph in Figure 3, and to Pannekoeks corresponding chart (see Figure 4) we can see that while 1 is certainly a little further south of the northern rim of the band13, 2 and 3 are much more separated. The positioning of 4 in the middle of the milk is stranger still.This is not because it is not on the galactic equator.The determination of this great circle is somewhat arbitrary, and Ptolemy might have in mind a circle a little bit to the north of our current determination of its position.The difficulty lies in the fact that 4 is to the north of 2, which was previously used to determine the northern rim. All this confusion is nevertheless understandable this part is, as we saw, the one with the worst visibility.Ptolemy would have not been able to see much under the Cross, and even the observations of those stars which were visible would have been much disturbed by their low altitude.Figure 4.Part of Plate V in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 78).The labels are those of Figure 3.This also explains why he does not mention one of the most salient features of this region, the Coalsack (at the center of Figure 4, and whose lack of luminosity is marked by Pannekoek with a definite 00).14 Ptolemy does, nevertheless, notice the increased brightness in the rear legs of the Centaur. He is likely referring to the bright clouds in Crux and Carina, clearly visible to the right of the Cross.Lupus and Ara.The next section he considers is within Lupus and Ara.He says that the northern rim of the milk is about 1.5u00b0 from the star on the rump of Lupus, and the southern rim encloses the star on the burning-apparatus of Ara, but just grazes the northernmost of the two stars close together on the brazier and the southernmost of the two stars in the base, while the star in the northern part of the brazier and the one in the middle of the brazier lie right in the milk.15 There are six stars in this description, and they can be identified with certainty. The one determining the northern rim is XLV 10 (u03b6 Lup).The one enclosed by the southern rim is XLVI 7 (u03b6 Ara).The two which are just grazed by the southern rim are XLVI 6 (u03b2 Ara) and XLVI 2 (u03b8 Ara).The last two, those which lie in the middle of the milk, are XLVI 4 (u03b5 Ara) and XLVI 3 (u03b1 Ara).Ptolemy ends this part of the description indicating that [t]hese sections are rather less dense.16Figure 5. The Milky Way in LupusAra. 1. u03b6 Lup, 2. u03b6 Ara, 3. u03b2 Ara, 4. u03b8 Ara, 5. u03b5 Ara, 6. u03b1 Ara.Credit European Space ObservatorySerge Brunier.Refer to Figure 5.From Lupus we can see u03b6 Lup, while we have several stars from Ara u03b6 Ara, u03b2 Ara, u03b8 Ara, u03b5 Ara and u03b1 Ara.Ptolemys description is fairly consistent with the photograph in Figure 5, and with Pannekoeks evaluation in Figure 6.While it seems that the 1u00bdu00b0 from 1 to the northern rim was a conservative estimate, in the case of the southern rim the limit indicated by 3 and 4 seems more accurate. As in the previous case, the low altitude explains the general lack of consistency the maximum altitude this region reached in Alexandria was about 11u00b0.With such values, atmospheric extinction plays a major role, and indeed this region would have seemed less dense than others.Had Ptolemy been able to have clearer views, he might have noticed the very bright Norma Star Cloud in-between 1 and 5, whose brightness Pannekoek marks with a 73.Figure 6. The constellations of Lupus and Ara are divided in Pannekoeks charts (Pannekoek, 1928 A78-80).Here we can see parts of plates VI (a) and V (b).Some of the stars near the border of the plates are depicted in both of them.The labels are those of Figure 5.Scorpius and Sagittarius.The following section is focused on Scorpius and Sagittarius.This is the part of the Milky Way which is in the direction of the galactic center, where the stellar population is the densest, and therefore the appearance of the milk is the brightest. He references many stars the northern part of the milk encloses the three joints before the sting of Scorpius and the nebulous mass to the rear of the sting, while the southern rim touches the star in the right front hock of Sagittarius, and encloses the star on his left hand.17 The three stars near the sting are XXIX 17, 18 and 19 (u03b8, u03b9 and u03ba Sco, respectively).The nebulous mass to the rear of the sting is M7, an open cluster which is about 0;40u00b0 across. In Ptolemys catalogue it is XXIX 22.18 The two stars in Sagittarius described here are XXX 25 (u03b7 Sgr) and 2 (u03b4 Sgr), respectively.He continues explaining that [t]he star on the southern portion of the bow is outside the milk, but the star on the point of the arrow lies in the middle of it, while the stars in the northern part of the bow also lie in it, each of them being a little more than 1u00b0 removed from one of the rims, the southern star from the southern rim, the northern star form the opposite rim.19 These four stars are XXX 3 (u03b5 Sgr), 1 (u03b3 Sgr), 4 (u03bb Sgr) and 5 (u03bc Sgr), respectively. He ends the section by pointing out that [t]he area near the three joints is somewhat denser, while the area around the point [of the arrow] is very dense indeed and appears smoky.20Figure 7.The Milky Way in ScorpiusSagittarius. 1. u03b8 Sco, 2. u03b9 Sco, 3. u03ba Sco, 4. M7 and G Sco (left and right, respectively), 5. u03b7 Sgr, 6. u03b4 Sgr, 7. u03b5 Sgr, 8. u03b3 Sgr, 9. u03bb Sgr, 10. u03bc Sgr.Almost at the center of the figure we can see the Large Sagittarius Star Cloud, at whose center is the galactic core. Almost on the 9-10 line, just to the left of 10, we can see the very bright M24, or Small Sagittarius Star Cloud.Credit European Space ObservatorySerge Brunier.Refer to Figure 7 and Figure 8.This description shows a remarkable match to the lines in Pannekoek that indicate, in his scale, a density of 30-40.Almost all of the stars that Ptolemy references, and which are in or close to, the sting, are within such areas. If we look at the location of 5, it is remarkably close to the line, while 6 is a couple of degrees inside that limit, just as Ptolemy says.Moreover, 7 is just outside the line, and 8 is indeed in the middle of it, lying almost at the very center of the Large Sagittarius Star Cloud.This explains Ptolemys note that the area is so dense as to appear smoky.Finally, the indication of 9 and 10 as being a little more than 1u00b0 removed from the northern and southern rims also fits the 30-40 limit Ptolemy seems to be following.Figure 8. Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 80).The labels are those of Figure 7.Ophiuchus, Aquila and Sagitta.Next, Ptolemy describes the parts of the Milky Way in Ophiuchus, Aquila and Sagitta, and it is a somewhat longer description than the previous ones The following section is a little less dense maintaining about the same width throughout.The star on the tip of the tail of the snake held by Ophiuchus lies in the open, a little more than one degree away from the advance rim of the milk, while the two most advanced of the bright stars below it lie right in the milk the southern one is 1u00b0 from the rear rim, and the northern one, 2u00b0 [from it].21 The three stars he is referring to here are XIV 18 (u03b8 Ser), 15 (u03bb Aql) and 12 (u03b4 Aql). He continues The rearmost of the stars in the right shoulder of Aquila touches the same rim, while the more advanced one is cut off inside it, as is also the more advanced, bright star of those in the left wing.22 This triplet refers to XVI 8 (u03c3 Aql), 7 (u03bc Aql) and 5 (u03b3 Aql) in Ptolemys catalogue.Furthermore, the bright star on the place between the shoulders and the two stars which lie on a straight line with it fall a little short of touching the same rim. Next, Sagitta is enclosed entirely within the milk.The star on the arrowhead lies one degree from the eastern rim, while the star on the notch lies two degrees from the western rim.The section around Aquila is slightly denser, and the remainder slightly less dense.23 The three aligned stars which he indicates are XVI 3 (u03b1 Aql), 6 (u03c6 Aql) and one which is not in the catalogue, u03c5 Aql, respectively.24 The two stars in Sagitta are XV 1 (u03b3 Sge) and 5 (u03b2 Sge).Figure 9. The Milky Way in OphiuchusAquilaSagitta. 1. u03b8 Ser, 2. u03bb Aql, 3. u03b4 Aql, 4. u03c3 Aql, 5. u03bc Aql, 6. u03b3 Aql, 7. u03b1 Aql, 8. u03c5 Aql, 9. u03c6 Aql, 10. u03b3 Sge, 11. u03b2 Sge.The Great Rift is clearly seen crossing the entire scene, coming from the top-right corner of the image.Credit European Space ObservatorySerge Brunier.Refer to Figure 9 and Figure 10. 1 is right in the middle of one of the darkest parts of the Great Rift, which explains Ptolemys description of it as lying in the open, i.e., outside the milk. Both 2 and 3 are approximately at the same distance from the southern rim.Ptolemys assertion that 2 is closer to the rim than 3 may be grounded on the fact that 2 is within a somewhat darker area than 3, and thus it may be that the milk there is a little bit thinner.Ptolemys description says that stars 4, 7, 8 and 9 either touch or fall a little short of touching the southern rim.In this case, then, it would seem that Ptolemys brightness-criterion for determining the rim of the milk is close to Pannekoeks 20. The limits indicated with the stars in Sagitta vaguely follow the limits imposed from the north by the Great Rift, and from the south by the gradual darkening of the sky.The regions brightness tends to gradually fade in the direction of Sagitta, and to be harshly interrupted to the north.This explains Ptolemys indication that Aquilas region is the brightest in the section of the Milky Way described here.Figure 10. Part of plate IV in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 D123).The labels are those of Figure 9.Cygnus and Cepheus.The regions in Cygnus and Cepheus are next Its north-western rim is defined in a reentrant angle by the star in the southern shoulder of Cygnus, the star under it in the same [southern] wing, and the two stars on the southern leg. 25 Even if their descriptions are not the same, we can match these four stars as IX 11, 10, 13 and 14 in Ptolemys catalogue. They correspond to u03bb, u03b5, u03bd and u03be Cyg, respectively.Its south-eastern rim is defined by the star in the tip of the southern wing-feathers, and encloses the two stars under the same wing outside the constellation, which are about 2u00b0 from it [the rim].The section around the wing is slightly denser.These stars are IX 12, 18 and 19 (u03b6, u03c4 and u03c3 Cyg, respectively).He ends the section with a somewhat detailed description The next section is continuous with that belt, but is much denser and seems to have a different starting-point. For it points towards the end parts of the other belt, but leaves a gap between it [and itself] on it southern side it joins the belt which we are currently describing, which is very rarefied at the junction; but after the point where it forms a gap with the other belt it gets denser, beginning from the bright star in the rump of Cygnus and the nebulous mass in the northern knee.Then it makes a slight bend as far as the star on the southern knee, and continues gradually diminishing in density, up to the tiara of Cepheus. The northern side is delimited by the southernmost of the three stars in the tiara and the star to the rear of those three, at which it also forms two outrunners, one verging to the north and east, the other to the south and east.The star in the rump of Cygnus is IX 5 (u03b1 Cyg), while the nebulous mass in the northern knee is IX 17 (u03c9 Cyg).The star on the southern knee is IX 14 (u03be Cyg), and the southernmost of the three stars in the tiara [of Cephus] corresponds to IV 9 (u03b5 Cep). Finally, the star to the rear [of the three in the tiara] is IV 13 (u03b4 Cep).Figure 11.The Milky Way in CygnusCepheus. 1. u03bb Cyg, 2. u03b5 Cyg, 3. u03bd Cyg, 4. u03be Cyg, 5. u03b6 Cyg, 6. u03c4 Cyg, 7. u03c3 Cyg, 8. u03b1 Cyg, 9. u03c9 Cyg, 10. u03b5 Cep, 11. u03b4 Cep.The southern belt is a lot dimmer than the northern one, which at this part shows the Cygnus Star Cloud.Credit European Space ObservatorySerge Brunier.Refer to Figure 11 and Figure 12. As Ptolemy says at the beginning of his description of the Milky Way, its two belts are joined in Cygnus.Since he is now describing the southern belt, here he begins by indicating the general direction of the reentrant angle it shows in this region.This is indicated by line 2-1-3-4, which is clearly tilted with respect to the galactic equator, and ends up right in the middle of the part where the belt is forked. The southern rim of this belt is indicated by 5, showing a near perfect coincidence with Pannekoeks determination.The 2u00b0 distance indicated by Ptolemy is about half of the distance implied by the limit he himself determined.Ptolemys comment about the slight increase in density around the wing might be due to the contrast the section shows with respect to the far darker regions to the north (the so called Northern Coalsack) and the east.Ptolemy then says that if one follows at the belt in the west-east direction, one will find that it bends to the north, in the direction of the northern belt, only that it is separated from it in the region indicated by the 8-9 line. Pannekoek gives a similar description in his plates, only that he puts the obscuration a little bit to the north-east than where Ptolemy does.There is, however, a clear dark cloud that comes from the north, the Funnel Cloud, which frames this northerly inclined section Ptolemy talks about.Ptolemy says that this inclined section of the belt goes as far south as 4, much less than the distanced Pannekoek indicates. His indication that the density diminishes to the west is, however, correct.Stars 10 and 11 indeed follow the northern rim of the belt, although Pannekoek indicates a slightly denser spot just above 10.Figure 12.The constellations of Cygnus and Cepheus are divided in Pannekoeks charts (Pannekoek, 1920 A116-118).Here we can see parts of plates V (a) and IV (b).The labels are those of Figure 11.Cassiopeia.After Cepheus, Ptolemy briefly describes the Milky Way at Cassiopeia Next the milk encloses the whole of Cassiopeia except for the star in the end of the leg. The southern rim is defined by the star in the head of Cassiopeia, and the northern rim by the star in the foot of the throne and the star in the lower leg of Cassiopeia.The other stars and all those round about this [constellation] lie in the milk.The areas near the rims are of thinner consistency, but those at the middle of Cassiopeia display a dense patch running the length [of the Milky Way].26 The star at the end of the leg which is left outside the milk is X 7 (u03b9 Cas). The star that defines the southern rim is X 1 (u03b6 Cas), and the two stars that define the northern rim are X 11 (u03ba Cas) and 6 (u03b5 Cas), respectively.Figure 13.The Milky Way in Cassiopeia. 1. u03b9 Cas, 2. u03b6 Cas, 3. u03ba Cas, 4. u03b5 Cas.Credit European Space ObservatorySerge Brunier.Refer to Figure 13 and Figure 14. 1 is clearly outside the milk, right in the middle of a darker patch.According to Pannekoeks rendition, line 3-4 indeed follows the northern rim, and 2 almost grazes the southern one. Pannekoek also supports Ptolemys indication that there is a strong difference between the much more luminous inner region of the belt at the constellation and the thinner consistency of the milk near the rims.27Figure 14.Part of plate V in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 A116).The labels are those of Figure 13.Perseus.Perseus is the next constellation the righthand parts of Perseus are enclosed in the milk. Furthermore, its northern edge, which is very rarified, is defined by the lone star outside the right knee of Perseus, and its southern edge, which is very dense, by the bright star on his right side and by the two rearmost stars of the three to the south of that.These four stars are XI 28 (HIP 19949), 7 (u03b1 Per), 9 (u03c8 Per) and 10 (u03b4 Per), respectively.Then, he continues Enclosed in it also are the nebulous mass on the hilt, the star in the head, the star in the right shoulder and the star on the right elbow. The quadrilateral in the right knee and also the star on the same calf lie in the midst of the milk, while the star in the right heel is also inside it, a little distance from the southern border.The nebulous mass refers to XI 1, which is a double cluster NGC 884 and NGC 869.The star in the head is XI 5 (u03c4 Per), the star in the right shoulder is XI 3 (u03b3 Per), and the star on the right elbow XI 2 (u03b7 Per). Afterwards, the quadrilateral in the right knee is a reference to XI 16, 17, 18, 19 (b, u03bb, c and u03bc Per, respectively).Finally, the stars in the right calf and heel are XI 20 (d Per) and 21 (58 Per), respectively.Figure 15.The Milky Way in Perseus. 1. HIP 19949, 2. u03b1 Per, 3. u03c8 Per, 4. u03b4 Per, 5. NGC 884 and NGC 869, 6. u03c4 Per, 7. u03b3 Per, 8. u03b7 Per, 9. b Per, 10. u03bb Per, 11. c Per, 12. u03bc Per, 13. d Per, 14. 58 Per. Credit European Space ObservatorySerge Brunier.Refer to Figure 15 and Figure 16.Ptolemy says that the northern rim, which is not bright, is defined by 1.The southern one, much brighter, by 2, 3 and 4.Ptolemys star choices seem to enhance the contrast between both limit of the Milky Way.While it is true that there is a general noticeable difference between them, the three stars he selected for the southern rim are precisely at a particularly bright spot in that region, as it can be seen in Pannekoeks diagram, where it is labelled with a 32. The rest of the description is accurate, inasmuch as all the stars he lists are between the two limits he indicated.Auriga.Auriga is the next constellation, displaying a thinner consistency.The star on the left shoulder, called Capella, and the two stars on the right forearm fall just short of touching the north-eastern rim of the milk, while the small star over the left foot in the lower hem define the south-western edge. In Ptolemys catalogue Capella is XII 3.The two stars he refers to are XII 5 and 6 (u03bd and u03b8 Aur), respectively.The one that defines the southern rim is probably XII 14 (14 Aur, although the identification is not certain28).The star over the right foot lies half a degree within the same edge, and the two stars close together on the left forearm, called Haedi, lie in the middle of the belt.The first of these three is, XII 12 (u03c7 Aur), and the Haedi are XII 8 and 9 (u03b7 and u03b6 Aur), respectively.Figure 17. The Milky Way in Auriga. 1.Capella, 2. u03bd Aur, 3. u03b8 Aur, 4. 14 Aur, 5. u03c7 Aur, 6. the Haedi.Credit European Space ObservatorySerge Brunier.Refer to Figure 17 and Figure 18.Both the photograph and Pannekoeks diagram supports Ptolemys assertion that the Milky Way is at this point much dimmer.In fact, Capellas galactic longitude is about 160u00b0, which explains the low density of stars in Auriga.Capella is just to the north of the limit Pannekoek determines, as does Ptolemy. Ptolemy seems to recognize that the milk makes a little turn to the north, because he says that 3 and 4 are within it, almost touching the border, even if they are both to the north of Capella.The southern rim also shows a coincidence between both authors.As in other instances, Ptolemys measurements regarding the distance of a star to a rim of the milk are unsatisfactory 5 is at least three times away from the southern rim than what Ptolemy indicates. The reference to the Haedi lying in the middle of the belt is rather ambiguous.Although it is not easy to determine this with certainty, it would seem, nevertheless, that they are almost on the southern rim.Figure 18.Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 D123).The labels are those of Figure 17.Gemini.Ptolemy then says Next the milk goes through the legs of Gemini, displaying a certain amount of density in elongated form just over the stars at the ends of the legs. Now the advance edge of the milk is defined by the rearmost of the three stars on a straight line under the right foot of Auriga, by the rearmost star of the two in the staff of Orion and by the northernmost of the four stars on his [Orions] hand The stars that define the southern rim are XXIV 19 (1 Gem), and XXXV 12 and 9 (u03c72 and 72 Ori), respectively.He then continues the brilliant star under the right hand of Auriga and the star in the rear foot of the rear twin are approximately 1u00b0 inside the rear edge, while the stars in the other feet lie in the midst of the milk. The two stars 1u00b0 inside the milk are XXIV 20 and 18 (u03ba Aur and u03be Gem), respectively.The stars in the other feet are XXIV 17, 16, 15 and 14 (u03b3, u03bd, u03bc and u03b7 Gem, respectively).Figure 19.The Milky Way in Gemini. 1. 1 Gem, 2. u03c72 Ori, 3. 72 Ori, 4. u03ba Aur, 5. u03be Gem, 6. u03b3 Gem, 7. u03bd Gem, 8. u03bc Gem, 9. u03b7 Gem.Credit European Space ObservatorySerge Brunier.Refer to Figure 19 and Figure 20.According to Ptolemy, there is a particular dense region around 5-9. If compared to Auriga, the cloud of relative brightness in that region is more continuous, thus justifying the elongated form Ptolemy refers to.However, we do not find any particularly bright spot in these parts.The southern limit is defined, according to Ptolemy, by 1-3.Both Figures indicate that this is probably too septentrional.Ptolemys location of 4 and 5 as being 1u00b0 inside the northern edge is also incorrect. In both cases, it seems that he is narrowing the width of the milk.This may be due to the fact that, at this point, we are again approaching the southernmost point of the Milky Way (SP in Figure 1), although we are still not within the 15u00b0 of maximum altitude zone (i.e, the zone between I and II in Figure 1).Ptolemy also says that stars 6-9 are in midst of the milk, a comment which is difficult to understand, given that they are located at a similar galactic longitude than 5, and the milk is fairly consistent in its width all across the constellation.Figure 20. Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1920 D123).The labels are those of Figure 19.Canis Minor and Major.The Almagest then says that the belt passes by Canis Minor and Canis Major it leaves the whole of Canis Minor outside the milk no small distance to the east, and leaves Canis Major too outside to the west, almost in its entirety; for the star on its ears is caught by a sort of cloud which projects and which then almost touches the three stars in the neck of Canis Major next to that [star] towards the ear, while the lone star over the head of Canis Major, outside it and at some distance, is about 2 u00bdu00b0 inside the eastern rim. The consistency in this whole region is somewhat thinner The star on its ears is XXXVIII 2 (u03b8 CMa), and the three stars in the neck are XXXVIII 3, 4 and 5 (u03bc, u03b3 and u03b9 CMa, respectively).Finally, the lone star may be XXXVIII 19 (u03b4 Mon29).Refer to Figure 21 and Figure 22.Canis Minor (Procyon) is indeed well outside the milk, as is Canis Major (Sirius).It is not clear what is the shape of the cloud which projects towards 4, 5 and 6. Nevertheless, Pannekoeks diagram shows an increased brightness around 3, one which could be seen as coming from the north.The location of 7 2;30u00b0 within the milk is approximately accurate.After that the milk passes through Argo.The western rim of the belt is defined by the northernmost and most advanced of the stars in the little shield in the poop.This is XL 5 (m Pup).And continues The star in the middle of the little shield, the two stars close together under it, the bright star at the beginning of the deck near the steering-oar and the midmost of the three stars in the keel are just shorth of touching the same [southern] edge. These five stars are XL 6 (k Pup), XL 8 and 9 (3 and 1 Pup), XL 17 (u03b6 Pup) and XL 38 (u03b4 Vel).The northernmost of the three stars in the mast-holder defined the eastern rim, while the bright star in the stern-ornament is 1u00b0 within the same edge, and the bright star under the rearmost little shield in the deck is the same amount, 1u00b0, outside the same edge.These are XL 22, 2 and 31 (NY Vel, u03c1 Pup and u03bb Vel, respectively). Ptolemy then says that [t]he southernmost of the two brilliant stars in the middle of the mast touches the same edge, and the two bright stars at the point where the keel is cut off are about 2u00b0 inside the advance rim.At that point the milk joins the belt through the legs of Centaurus.The stars are, in the order they are referenced XL 27 (u03b2 Pyx) and XL 35 and 36 (u03b3 Vel and u03c7 Car).Finally, he closes the section by indicating that [t]he consistency in this area too, throughout Argo, is somewhat rarefied, but the sections of it around the little shield, the mast-holder and the point where the keel is cut off are more dense.30Refer to Figure 23 and Figure 24. As in other cases, Ptolemy seems to be defining the limit of the belt with a brightness that is around the value 20 in Pannekoeks system stars 1 to 5 are indeed at or close to that line.Stars 6 and 9 are also close to the limit, but on the other side, although Pannekoek locates them a bit inside the 20 limit.The positions of 7 and 8 as being 1u00b0 on each side of the northern limit are not accurate the figure should be three or four times greater. The location of 10 as being about 2u00b0 inside the southern belt is a good one, although it is strange that he says the same about 11, which is clearly much farther away from the milk, as it can be seen in both figures.Ptolemys commentary that the regions close to 2, 6 and 10-11 are broadly true, as Pannekoeks diagram shows (again, the inclusion of 11 does not entirely fit).Figure 24.Part of Plate IV in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 77). The labels are those of Figure 23.The northern belt Scorpius, Ophiuchus, Serpens.After the description of the southern belt, Ptolemy goes back to his original division, and describes the northern, curved belt seen in the direction of the galactic center.As I said earlier, this northern belt is divided in two by what Ptolemy describes as a considerable gap of open space31, which is the dark cloud we know today as the Great Rift. We will begin by looking at the first half of the description Ptolemy makes of this part of the Milky Way.Ptolemy begins by indicating that it encloses the three joints of Scorpius nearest the body, but leaves the rearmost star of the three in the body 1u00b0 outside its western rim.The star in the fourth joint lies in the open space between the two belts, about the same distance from each, a little more than 1u00b0.32 These stars in Scorpius are easily identifiable as XXIX 12, 13, 14, 9 and 16. Their modern names are u03b5, u03bc, u03b6, u03c4 and u03b7 Sco, respectively.He continues After that the advance belt turns aside to the east, in the shape of a segment of a circle, defining the advance edge of the milk by the star on the right knee of Ophiuchus, and the rear edge by the star on the same [right] shin, while the most advanced of the stars at the end of the same [right] leg touches the same edge.Subsequently the western rim is defined by the star under the right elbow of Ophiuchus, and the eastern rim by the more advanced of the two stars in the same [right] hand.33 The knee of Ophiuchus is XIII 12 (u03b7 Oph), and its shin is XIII 13 (u03be Oph). The advanced star in the right leg is XIII 14 (36 Oph).The stars that define the two rims are XIII 9 (u03bc Oph) and 10 (u03bd Oph), respectively.Ptolemy ends with this section with the indication that [f]rom that point on there is a considerable gap of open space, in which lie the two stars on the tail of Serpens next to the star in the tip [of the tail].The whole of the section of this belt which we have [just] finished describing consists of an extremely fine and almost aery substance, except for the area enclosing the three joints [of Scorpius], which is somewhat more concentrated.34 The three stars on the tail of Serpens are XIV 16 (u03b6 Ser), 17 (u03b7 Ser) and 18 (u03b8 Ser).Figure 25. The northern belt of the Milky Way in ScorpiusOphiuchusSerpens. 1. u03b5 Sco, 2. u03bc Sco, 3. u03b6 Sco, 4. u03c4 Sco, 5. u03b7 Sco, 6. u03b7 Oph, 7. u03be Oph, 8. 36 Oph, 9. u03bc Oph, 10. u03bd Oph, 11. u03b6 Ser, 12. u03b7 Ser, 13. u03b8 Ser.Credit European Space ObservatorySerge Brunier.Refer to Figure 25 and Figure 26.Both images confirm the inclusion of Scorpius joints 1 to 3 beings inside the milk.His indication that 4 is 1u00b0 to the north of it is exaggerated. While the 1u00b0 which supposedly separates 5 from both belts is uncertain, the photograph clearly shows that he is right in putting it in the darkness between both.The shape of this section of the milk is indeed curved.The indication that 6, and 7-8 mark the northern and southern limits is very accurate.Stars 9 and 10, however, seem to be well outside the milk, beyond its end-limits.The indication that 11, 12 and 13 are within the Great Rift is also accurate. Ptolemys comment that the area around 1-3 is more concentrated than the rest of this curved section does not seem to have much grounding.Figure 26.Part of plate VI in Pannekoeks isophotic chart of the Milky Way (Pannekoek, 1928 A 80).The labels are those of Figure 25.The northern belt Cygnus.In this section we will look at the last part of Ptolemys description of the Milky Way, which is focused on the part of the northern belt on the other side of the Great Rift. Ptolemy says After the gap the milk again makes a fresh beginning at the four stars to the rear of the right shoulder of Ophiuchus.The eastern rim of this belt is defined (being just grazed) by the lone brilliant star under the tail of Aquila, while the opposite rim is defined by the star which is some distance to the north of the four just mentioned.35 The set of four stars is comprised of XIII 25, 26, 27, 28 (66, 67, 68 and 70 Oph, respectively). The brilliant star which defines one rim is XVI 9 (u03b6 Aql), and the star that defines the other one is XIII 29 (72 Oph).Ptolemy continues From there on this belt, besides being rarefied, is also contracted into a narrow space in the area which is in advance of the star in the beak of Cygnus, so as to produce the appearance of a gap.However, the remained of it, from the star in the beak up to the star in the breast of Cygnus, is wider and considerably denser. The star in the neck of Cygnus lies in the middle of the dense section. A rarefied section branches off to the north from the star in the breast as far as the star in the shoulder of the right wing and the two stars close together in the right foot.From this point, as we said, occurs a clear gap to the other belt, stretching from the above-mentioned stars in Cygnus up to the bright star in the rump.36 The star in the beak of Cygnus is IX 1 (u03b2 Cyg) and the one in the breast is IX 4 (u03b3 Cyg). The stars in the neck and the right wing are IX 3 and 6 (u03b7 and u03b4 Cyg, respectively), and the two stars in the right foot are IX 15 and 16 (u03bf1 and u03bf2 Cyg, respectively).Finally, the star in the rump is IX 5 (u03b1 Cyg).Figure 27.The northern belt of the Milky Way in Cygnus. 1. 66 Oph, 2. 67 Oph, 3. 68 Oph, 4. 70 Oph, 5. u03b6 Aql, 6. 72 Oph, 7. u03b2 Cyg, 8. u03b3 Cyg, 9. u03b7 Cyg, 10. u03b4 Cyg, 11.Close together, u03bf1 and u03bf2 Cyg, 12. u03b1 Cyg. Credit European Space ObservatorySerge Brunier.Refer to Figure 27 and Figure 28.Ptolemys indication that the group 1-4 marks the beginning of this part of the northern milk is accurate, as is the indication that 5 just grazes its southern rim.The indication that 6 defines the northern rim is also supported by both figures.Ptolemy then says that the belt rarifies and contracts in the area in advance of 7. This description is both subtle, and accurate.He then says that at this point a much wider and denser region begins, from 7 up to 8.He is referring to the modern Cygnus Star Cloud, one of the most striking features of the Milky Way for modern boreal observers.Star 9 is indeed right in the middle of the star cloud.The following part of the text is not so clear it is possible that Ptolemy was looking at the set of 8, 10 and 11 as the markers of a part of the cloud which has the shape of an inverted Indeed, while 10 and 11 are connected by a soft stripe of the milk, the section between 8 and 12 is clearly occupied by a dark spot. This spot marks, as Ptolemy says, the division between this section of the northern belt, and the much larger and continuous southern belt.Conclusion.A description of the Milky Way is something of a surprising element in a work such as the Almagest.While the rest of the work is devoted to themes which are potentially tractable via precise mathematical tools, in this chapter he is dealing with something that, to an extent, escapes this approach. Here Ptolemy uses the coordinates of stars to locate the limits of the Milky Way, or to point to this or that of its features.But this is only part of the work.Given that the Milky Way has a complex structure, with different densities and variable shapes along its path, Ptolemy has to combine his mathematical skills with qualitative visual descriptions, in order to convey an appropriate image of his subject. There is here no theory of the Milky Way, no attempt at investigating its nature.He is aware that he is looking at something that is very apparent even to the casual eye37, and his aim seems to be just to give this phenomenon its proper place within the wider astronomical framework he is developing, by describing it to a certain level of detail and fixing it with respect to the star catalogue he had already given.The mixed nature of the work is comparable to his geographical books, where we can find the subtle descriptions of borders between regions together with the mathematical discussions about, and determinations of, geographical coordinates of many locations.38 The result of this application of dual skills to the Milky Way is, if not superb, at least with some notorious merits.Ptolemy recognized many of the main features of the Milky Way not only the more obvious divisions at Ara and Cygnus, but also possibly the nebulae in Crux and Carina (near the hind legs of the Centaur), the Large Sagittarius Star Cloud, the Great Rift and the Cygnus Star Cloud. The use of stars to determine the limits of the milk and areas of particular interest are, in most cases, very accurate.There are, however, exceptions.To see the most salient discrepancies we must look at the positions Ptolemy indicated for u03c4 and u03c3 Cyg in the CygnusCepheus section, of u03c7 Aur in Auriga, u03c1 Pup and u03bb Vel in the region of Argo.As I repeated throughout the paper, it seems that Ptolemy generally considered the rims of the Milky Way to be located at the level of brightness which Pannekoek labels with a 20. There is, nevertheless, a pattern of deviation from this general value.As the belt gets closer to the center, Ptolemy tends to diminish its width to Pannekoeks value of 30 and even 40.This may have something to do with the fact that there is a high contrast between the very bright clouds in Sagittarius, and the dark clouds which are intertwined with them.Also, it is possible that the low altitude this area had as seen from Alexandria at the time, with the high effect that extinction had because of this, tended to lower the apparent brightness of the region. As we saw in the cases of Lupus and Ara, this should not be discarded.Pannekoek himself points to this difficulty related to altitude It can be seen from this description that Ptolemy did not notice the Coalsack nor the division into two streams in u03b1 Cen, which is understandable given the low altitude of those parts above the Alexandrian horizon.For him the bifurcation only begins in Ara-Norma. (Pannekoek, 1928 A63)."
}