{
  "articleId": "isaw_paper16",
  "text": "ARTICLE_ID: isaw_paper16\nISAW Papers 16 (2019) Egyptian cubits and Late Roman architecture: the design of the forts of the Kharga Oasis (Egypt) Corinna Rossi1 http://hdl.handle.net/2333.1/5tb2rmg1 Abstract: The Kharga Oasis, in Egypt’s Western Desert, is endowed with a scatter of Late Roman forts and fortified settlements. The architectural remains of Umm al-Dabadib, the largest and best-preserved site, were surveyed in 3D in 2014 at a high level of accuracy and precision. The ensuing 3D model allowed a detailed metrological study of the fort, which revealed that this building was planned and built using Egyptian cubits. The other Late Roman forts of Kharga have not been surveyed as accurately as Umm al-Dabadib, but nevertheless a careful analysis of their architectural remains reveals that the same conclusions may be extended to these buildings also. This article presents the results of this investigation, which represent the latest attestation of the use of this unit of measurement in architecture, and suggest that these buildings were the outcome of a joint Roman and Egyptian effort to guard the empire’s frontier. Kharga is one of the large oases of Egypt’s Western Desert, together with Dakhla, Farafra, Bahriya and Siwa (figure 1). These and other smaller oases that punctuated the desert to the north and to the south were all connected by a network of desert routes, that linked Egypt with Libya and Sudan. During the Late Roman Period, the Western Desert oases marked the frontier of the Roman Empire; Kharga, in particular, represented an important desert crossroad, and was endowed with a scatter of forts and fortified settlements guarding its outskirts.2 Between 2001 and 2007 the northern portion of the Kharga Oasis was explored and studied by the North Kharga Oasis Survey, co-directed by the author and Ikram, that produced a first survey of all the antiquities that are currently visible in the area. The picture drawn by this survey work indicates that the northern area was densely inhabited and exploited from the Late Ptolemaic through the Roman period, until a dramatic drop that took place in the early V century AD. Our knowledge of the previous periods is rather patchy. The desert around the oasis’ core offers plenty of evidence of prehistoric occupation, especially Neolithic, corresponding to a period in which the environmental conditions were significantly different, and the desert resembled a savannah. When the hyper-arid climate took over, the population concentrated around the main water sources but kept travelling across the desert, leaving trails of rock art, animal remains and travel equipment along paths and tracks; those crossing northern Kharga offer evidence of Early Dynastic, pharaonic and Graeco-roman travellers, thus suggesting that these routes were used continuously throughout Antiquity and beyond.3 So far, however, differently from other areas of the oasis, northern Kharga has not yet yielded any specific and incontrovertible trace of stable occupation earlier than the Late Ptolemaic or early Roman Period; perhaps future excavation will access levels that are currently buried.4 In 2014 the Italian Archaeological Mission to Umm al-Dabadib performed a photogrammetric 3D survey of the buildings called Fort5 and Fortified Settlement;6 the 3D model generated from the survey data allowed an accurate investigation into the metrology of the building,7 that led to the discovery that the Fort was designed and built using Egyptian cubits.8 The current article explores the possibility of extending the same conclusion to three other Late Roman forts, Qasr al-Gib, Qasr al-Suma yra, and partly also Qasr al-Lebekha, which were built in the Kharga Oasis in the same period, as part of the same strategic programme. Figure 1: Map showing the position of the main oases in Egypt’s Western Desert. Drawing by Rossi. The metrological study of the Fort of Umm al-Dabadib The 3D surveys of the Fort and the Fortified Settlement of Umm al-Dabadib currently represent the most precise and accurate surveys so far performed on any Late Roman building in the Kharga Oasis. The precision achieved is 1 cm, suitable to represent the entire complex to a scale of 1:50; peaks of 2 and 5 mm accuracy were achieved in the surveys of the external walls and of the internal rooms of the Fort respectively.9 Thanks to the accuracy of the 3D model, in 2017 it was possible to investigate which unit of measurement was used by the builders; both the Roman foot (the pes of ca 29 cm) and the Egyptian cubit (ca 52 cm) were tested first by superimposing an artificial grid to the Fort’s plan, aiming at highlighting possible patterns. Although the cubit fitted better than the pes, the evidence was not conclusive; the crucial clue came from the analysis of the masonry. Two elements recur in the Late Roman buildings of Kharga: the use of mudbricks ca 33-34 cm long, 16-17 cm wide and 8-9 cm tall (here summarized as 34×17×8 cm), and the walls made of two headers and one stretcher. This wall composition is slightly over 50 cm thick, which is just the length of the Egyptian cubit. A careful analysis of the dimensions of the mudbricks revealed that their measures correspond to 4, 2 and 1 reformed palms respectively (figure 2), that is, to the subdivision of the Egyptian cubit of ca 52 cm into 6 parts, which was introduced during the Twenty-sixth Dynasty and superseded the older subdivision into 7 parts.10 Mudbricks inevitably function as basic modules, as walls and corners and therefore internal spaces are generated by their (generally regular) composition. Partly as a consequence of this and partly as the result of an intentional choice, the three internal dimensions of the rooms of the Fort of Umm al-Dabadib correspond to either whole numbers of cubits, or to modular fractions of them. In addition, the use of the Egyptian cubit can be also detected in the general layout of the building’s plan, where the presence of two modules is noted, one corresponding to 5 and one to 3 cubits.11 The ruined state of the central portion of the Fort prevents, for the moment, a precise reconstruction of the dimensions of the internal courtyard. Hopefully future fieldwork will be able to clarify this point and contribute further information to develop and refine the metrological analysis of the entire building Figure 2: The dimensions of the mudbricks used to build the Kharga forts compared with the reformed cubit. Drawing by Fiorillo. Looking for evidence in the other forts A reliable survey is the conditio sine qua non to perform a metrological analysis of a building. Among the Late Roman buildings of the northern portion of the Kharga Oasis, only the Fort and the Fortified Settlement of Umm al-Dabadib have been surveyed to a high level of accuracy in all three dimensions. The architectural surveys performed by NKOS on the other major buildings of the area were carried out single-handedly by the author or by Warner, with the aid of measuring tape and/or laser distance metre. As clearly stated in the description of the methodology that was adopted during the fieldwork, the resulting drawings must be considered sketch plans.12 Therefore, a detailed, accurate and reliable analysis as the one that was performed on the Fort of Umm al-Dabadib cannot be applied to the other forts. However, taking as a starting point the dimensions that were actually recorded, an overall analysis of their proportions and general dimensions is possible. The element that encourages this attempt is the ubiquitous presence of both the mudbricks measuring 34×17×8 cm and of the one-header-two-stretchers bonding technique used in the construction of the walls, suggesting that the cubit lay at the basis of the design of all these buildings. The numerical value of the Egyptian cubit is ca 52 cm13 and essentially this value did not change when the cubit was ‘reformed’, as the change only concerned the number into which this unit of measurement was subdivided. The new subdivision into 6 (instead of 7) parts meant that palms and fingers, the submultiples of the cubit, became larger. In this analysis presented below, the palms must be always intended as reformed (larger) palms. As mentioned above, the analyses presented here cannot be compared to the one performed on the Fort of Umm al-Dabadib for two main reasons: they have been conducted on a limited set of measurements and only concern the plans of the buildings. The original measurements were taken at the best of the surveyors’ ability and can be considered reliable with an average approximation around 5 cm. Not all horizontal dimensions could be recorded, as often debris and sand prevented access to some points, and only a very limited set of vertical measurements could be taken. In contrast, the photogrammetric surveys of Umm al-Dabadib and subsequent computer-based alignment and georeferencing of the data enabled the generation of a highly detailed dense point cloud, effectively representing all visible physical dimensions and characteristics of the structure. From this, a 3D model of the Fort was produced with a considerably much higher level of accuracy and precision as to structural dimensions and aspects of construction, that cannot be matched by traditional survey and hand measurements. To sum up, the existing surveys of the other forts cannot match those carried out at Umm al-Dabadib; nevertheless, if one bears in mind these limitations, a discussion of the available evidence can be extremely productive. For the Late Roman forts of Qasr al-Gib and Qasr al-Sumayra, two schemes are presented below (cf. figures 3, 4 and 6): the measurements actually taken and recorded in 2001 by the author (in blue, above), and a schematic reconstruction of the dimensional pattern in cubits (in red, below). The measurements are given in metres, with one decimal figure in most of the cases, to remark that the average error may reach 5 cm. The red schemes are, in both cases, directly based on the blue measurements, thus offering an acceptable level of reliability. The situation of Qasr al-Lebekha is slightly different. This fort was originally surveyed by Deleuze and Braun, and plans and sections to scale were published before NKOS started its operations.14 Warner later integrated the original survey by adding further details and notes; however, measurements were not taken again.15 This means that, while for Qasr al-Gib and Qasr al-Sumayra we possess the original measurements, in order to derive those of Qasr al-Lebekha one further step must be added, that is, they must be retrieved by measuring the published drawing. Plans of the latter appeared to have been produced to a scale slightly inferior to 1:100, and therefore one must take into account a plotting error, potentially ranging between 5 and 10 cm, which adds to the inherent difficulty of precisely measuring such a small drawing. This difficulty, in turn, negatively reflects on a reliable conversion from metres to cubits, in particular when palms are involved. For this reason, the analysis of the dimensional pattern of Qasr al-Lebekha is limited to only a few elements. The analysis of this building, in other words, is less reliable than then other two, and by itself would not be able to support the argument; however, as some of its elements appear to fit with the pattern suggested by the other forts, it eventually offers a ‘second-hand’ confirmation to the general interpretation. Figure 3: Sketch plan of Qasr al-Gib showing some measurements in metres taken in 2001 and a corresponding dimensional scheme in cubits. Drawing by Rossi. Qasr al-Gib Qasr al-Gib, perched on top of a hill, stands out in the flat landscape and, from the distance, looks like a large and solid building. In fact, it is smaller than expected, and also quite ruined inside; most of the material that once constituted the upper floors must have been removed over the centuries, as the central space is relatively empty. The two rows of lateral rooms at ground level were well-preserved, and offered the chance to take several measures and to reconstruct the overall layout. Little information could be retrieved on the first floor, and even less for the upper levels.16 The measurements taken in 2001 indicate that the plan of Qasr al-Gib corresponded to a square 30×30 cubits, into which a slightly rectangular space of 23×21 cubits was occupied by rooms and other spaces (figure 3). The plan was divided into three north-south bands, each 10 cubits wide; the central courtyard most probably measured just 10×10 cubits. The only entrance gate for the building17 pierced the southern wall on the right side of the central 10-cubit module and corresponded to 3 cubits. Inside, the two rows of lateral rooms were 5+1/2 cubits deep and 5 cubits wide; the visible niches (not marked on the red scheme) are all 1 cubit (slightly over 50 cm) wide. The area of the staircase is very ruined and only a few measurements could be taken, but the overall impression is that it was included in a 5×5 cubit square and revolved around a central element made of 1-cubit thick walls. The thickness of the external wall corresponded to 5 cubits along the northern and southern sides, and to 3+1/2 cubits along the eastern and western sides. The thickness of the internal walls at ground floor measured 1 cubit along the central courtyard and 2+1/2 cubits inside the rooms along the two sides: this value composed by one central wall of 4 headers (corresponding to 1+1/6 cubit, or 1 cubit + 1 palm), flanked by two layers of mudbricks set vertically to form the vaults, each ca. 30 cm thick, inclusive of mudbrick, mortar and plaster. The combination of 4 headers is also the thickness of the walls that flanked the fort’s gate along the southern side. Qasr al-Sumayra The plan of Qasr al-Sumayra was difficult to acquire, as the building is reduced to a heap of ruined mudbricks; only a few measurements could be taken in 2001 and 2002, and only a basic subdivision of the internal space could be reconstructed.18 The outer line of the building’s plan corresponded to a square of 22×22 cubits, consisting of a 3-cubit thick wall that outlined an internal square of 16×16 cubits (Figure 4). The round buttresses at the four corners do not form sharp angles with the outer wall, but are rather connected by a continuous curve, which gives them a slight oblong shape in plan, extending for 2 cubits in one direction and 2+1/2 cubits in the other. The internal 16×16-cubit space was subdivided into three north-south bands: two lateral stripes each corresponding to 6 cubits, and one central passage of 4 cubits. The width of the lateral rooms is difficult to establish; the room located in the north-eastern corner might have been 4+1/2 cubits wide, and 5 cubits deep. The roughly-built room located immediately to the right of the entrance appears to be only 4 cubits deep; thick debris prevented any further exploration. Figure 4: Sketch plan of Qasr al-Sumayra showing some measurements in metres taken in 2001 and 2002 and a corresponding dimensional scheme in cubits. Drawing by Rossi. Qasr al-Lebekha The topographic survey carried out by Deleuze and Braun highlighted the marked irregularities that characterized the construction of this building, as well as the widespread use of curving walls, absent in the other forts.19 The presence of sloping walls, the addition of layers of masonry, the overall irregularity of the entire building, and the scant information on the dimensions of various architectural elements all combine into a picture which is not easily interpreted. The lack of precise measurements of the interior prevents the published plans (both by Deleuze and Braun and NKOS) from being considered precise in terms of dimensions and proportions of the rooms that filled the building. For instance, from the published drawings some rooms along the southern and western sides appear to be about 3.5 cubits wide, but the plotting error prevents us from establishing whether this approximate value corresponded precisely to 3 cubits + 2 palms (or 3+1/3 cubits, that is 1.73 m), 3 cubits + 3 palms (precisely 3+1/2 cubits, that is 1.82 m), or 3 cubits + 4 palms (or 3+2/3 cubits, that is 1.90 m). Figure 5: Photograph of the interior of Qasr al-Lebekha (the area of the entrance looking eastwards) showing vertical walls endowed with lateral steps on which the vaults used to rest. Photograph by Rossi, 2013. Moreover, a comparison between some photographs taken inside the building and the published plan shows that, at least in some cases, the thickness of the walls reported on the plan (ca 50 cm, that is 1 cubit) corresponds to the portion of wall rising between the vaults, which rested on steps in the masonry located at lower level. This indicates that the base of the wall was therefore thicker, and thus the actual width of the rooms is inferior to the value that the published drawings seem to suggest (figure 5). Measuring the external outline of the building appears to be less difficult. It seems that at ground floor the fort occupied a rectangular area of 31×33 cubits, and that its internal space corresponded to a rectangle measuring 24×26 cubits (figure 6). The central courtyard seems to have been 9×12 cubits; its surrounding wall measured 1 cubit and the rooms that surrounded the courtyard were either 5 or 6 cubits deep.20 The external wall appears to have been 3+1/2 cubits thick along the southern, western and northern sides, and 4 cubits along the eastern side, where several layers of masonry appear to have been added over the time. Figure 6: Dimensional scheme in cubits superimposed on the sketch plan of the ground floor of Qasr al-Lebekha, based on Deleuze and Braun’s survey. Drawing by Rossi. Superimposing these red squares to the outer wall highlighted a detail that had gone unnoticed until now. Different from the other ‘towers’ (the inverted commas are due to the fact that they do not contain rooms, but are just decorative elements), the south-eastern one was obtained by ‘withdrawing’ the wall from the external alignment and then curving it outwards to achieve the profile of a round buttress, which remained basically included within the external square and did not protrude. There might be more than one explanation for this arrangement; one is that the small outcrop on which the fort rests slopes down quite dramatically in that area (figure 7), and a solution to construct a substantial foundation to support a protruding ‘tower’ was not sought. This problem, however, could have been avoided by reducing the extent of the building’s plan, or changing its shape, or shifting the whole building westwards. Evidently, these solutions could or would not be taken into account. Another possible factor is the chance that the building might have been built in phases, and that the round ‘towers’ might have been added later by adjusting the new design on the available space and basement. Reddé suggested that Qasr al-Lebekha might have started its life as an isolated tower corresponding to the south-eastern corner of the present building,21 but the later analysis by NKOS did not confirm this specific suggestion.22 However, the presence of different layers of masonry along the eastern face does suggest that this part of the building underwent several modifications during its life, that perhaps also reflected on the overall geometrical pattern that can be detected inside (see below). Only a more precise survey, paired with archaeological excavations, might clarify these points. Figure 7: Photograph of Qasr al-Lebekha seen from south-east, showing the sloping ground at the foot of the round buttress. Photograph by Rossi, 2013. Comparing the plans Paradoxically, the detailed metrological analysis of the Fort of Umm al-Dabadib did not provide specific information on the dimensions of the internal court and of the outer line of the external wall. The first of these two values might correspond to 13×15 cubits, but this remains hypothetical until further investigations are carried out. The second can be calculated as 33×34 cubits by projecting the sloping profile of the wall. It is important to bear in mind, however, that this value cannot be verified as the basement of the wall is currently invisible. It is buried deep under an external buttress that encapsulates the lower portion of the building, as well as at least two metres of sand. On the contrary, although the approximate character of the surveys of the other forts would not support a detailed metrological analysis, the shape of their ruins allowed us to take some basic measurements from which the internal dimensions and external outline of the buildings could be retrieved. A comparison between the four plans of the four Late Roman forts that have been analysed so far allows further comments and observations. Figure 8 contains the four plans aligned according to their distribution scheme (position of the entrance in relation with the interior), which in three cases out of four corresponds to their orientation in relation with the four cardinal points.23 Figure 8: The plans of the four forts and their dimensional schemes in cubits. Drawing by Rossi. In general, Umm al-Dabadib, Qasr al-Lebekha and Qasr al-Gib are similar in terms of dimensions, but different in terms of external appearance: Qasr al-Lebekha and Qasr al-Gib were both endowed with a very thick external wall completed by round buttresses at the four corners, while Umm al-Dabadib had a significantly thinner external wall, was endowed with two square towers, as well as a slightly larger internal courtyard. Inside, all these buildings share extremely similar characteristics, as the dimensions of all the vaulted rooms are generally between 4 and 6 cubits. Two buildings are square, two slightly elongated, with a difference of only 2 or 3 cubits between the two sides. In the case of Qasr al-Sumayra the only entrance is located in the middle, otherwise in the other forts it is placed to the side, and gives access to the internal courtyard from either the right or the left corner. Little can be said about the internal courtyards. The dimensions of that of Umm al-Dabadib are unclear, those of Qasr al-Gib are uncertain and those of Qasr al-Lebekha are irregular. The courtyard of Qasr al-Gib might have been square, while it is likely that the other two were rectangular;24 the largest dimension was the width from the point of view of those arriving from the entrance. The central space of Qasr al-Sumayra, instead, might have been nothing more than a ventilation shaft.25 Figure 9 is based on the same data, but elaborated in a different way, in order to show how the ground plan area might have been subdivided by means of a grid of orthogonal lines. Umm al-Dabadib appears to be laid out by crossing lines spaced every 10 cubits along a north-south direction (corresponding to the vertical cuts running in the masonry), and every 9 cubits along an east-west direction, thus combining a basic module of 3 with one of 5 cubits.26 Qasr al-Lebekha’s nearly square plan was divided in a quadripartite, symmetric way by four vertical cuts. 6 and 12 cubits are a recurring measures, and might have been combined in different ways, either as a sequence of 6+12+8 cubits bands, or as a sequence of 6+6+6+8 bands (at least in an east-west direction).27 Figure 9: The plans of the four forts and their internal alignments and subdivisions in cubits. Drawing by Rossi. The layout of Qasr al-Gib appears to be strikingly regular, and to correspond to a grid 10×7 cubits; it is possible that future, more detailed surveys will highlight slight irregularities that could not recorded during the first survey. The spacing underlying the plan of Qasr al-Sumayra followed a pattern 6+4+6 cubits along the east-west line; along the north-south line, as the southern rooms are 4 cubits wide, future excavations might be able to test how the remaining 12 cubits were divided. In general, the grids drawn on these four plans suggest that these buildings were planned on simple geometrical figures based on whole number of cubits. The tendency to divide the ground plan into three parts favoured and/or reflected the adoption of multiples of 3 cubits, combined with even numbers generated by the underlying bilateral symmetry of the plans. In general, it must be underlined that numbers do not recur and are not necessarily commensurable, thus suggesting that these buildings were not built on the basis of a specific geometric module. The only modular element that can be detected is its smallest constituting item, the mudbrick itself. Conclusions The metrological analysis performed on the Late Roman forts of Qasr al-Gib, Qasr al-Sumayra and Qasr al-Lebekha cannot match the one performed on the Fort of Umm al-Dabadib in terms of precision and extent, as the accuracy of the available surveys of these three buildings differs in a substantial way. However, the analysis of the available measurements suggests that these buildings, too, were planned and built using the reformed Egyptian cubit as basic unit of measurement. This is not surprising in itself, as all these buildings are not only contemporary, but also belong to the same strategic plan to protect and control the outskirts of the Kharga Oasis: in fact, they share a number of architectural elements and solutions, and clearly have a common origin.28 The most interesting conclusion that can be drawn from this short study is that the presence of mudbricks measuring 34×17×8 cm may be considered as an indicator of the use of Egyptian (reformed) cubits, thus potentially enlarging the discussion to a vast number of buildings dating to the Roman Period, located in the Kharga Oasis as well as elsewhere. This suggestion should be carefully tested on the field, though, or verified on reliable surveys. The use of Egyptian units of measurements in Roman Period buildings highlights some interesting points. First of all, it is necessary to specify that the Kharga forts were not ‘Roman’ just because they were built in the Late Roman Period. They were conceived and constructed according to a specific strategic design to control and protect the frontier, and such an enterprise could only be inspired, funded and carried out by the Roman authorities. Experts of strategy and constructions must have been involved in these operations, for which a significant familiarity with the terrain and the broader region was mandatory. This is perhaps the moment in which the label ‘Roman’ ceases to be so well-defined. The officers in charge of the strategic project must have been connected with the army, of which, in turn, we know very little. The scant information points to a mixture of local and foreign elements, in which the former quickly appears to take over the latter. The Notitia Dignitatum lists only one garrison in Kharga, the Ala Prima Abasgorum (Or XXXI), evidently made of soldiers recruited from among the Abasgi, a population situated on the eastern coast of the Black Sea. It is difficult to date the information that was included in the Notitia; the document itself was compiled towards the end of the IV century AD but may well preserve information gathered years or even decades earlier.29 The only other extant mention of this garrison is, apparently, a papyrus dating to the beginning of the same century, to the year 309 AD (SB 18 13852). In this document the name of the ala is reconstructed in a lacuna, on the basis of the information provided by the Notitia. If this interpretation is correct, it would then seem that the Ala Prima Abasgorum was stationed in Kharga for about one century. In this case, its arrival in the oasis is likely to have been a consequence of the re-organisation of the Egyptian frontier ordered by Diocletian during his travel in Egypt in 297-8.30 A wooden tablet mentions another garrison stationed in the Hibis area under Constantine and Constans (second quarter of the IV century AD), an unnamed cohors headed by an officer called Diphilos (SB 20 14884). The text lists eighty soldiers, whose names are Greek (in the majority of cases), Egyptian and Latin; whilst the presence of Greek and Latin names does not necessarily indicate a specific origin of the soldiers, the presence of Egyptian names suggests that part of the cohors had been raised in Egypt.31 The patchy picture that emerges from these documents appears to describe an army with foreign origins (at least in part) but soon rooted in the area, and mainly composed of either natives of the area or, at least, natives of the country.32 Along with this insight, it may be highlighted that the archaeological evidence from the IV century AD settlements that punctuate the northern portion of the Kharga Oasis suggests that all these sites were inhabited by Egyptians, using and producing Egyptian material culture typical of the time and adopting Egyptian burial customs; no foreign element has been detected so far.33 In this context, it is likely that the officers in charge of the strategic building programme were Egyptian and that they relied on a local workforce. The use of the Egyptian cubit in both the planning and building phase appears to point in this direction. The similarities in terms of construction techniques and architectural solutions shared by all the buildings dating to the Roman Period (broadly speaking) in the Kharga Oasis suggests the existence of a local, consolidated administrative and building tradition. In the Late Roman Period, when the necessity to build a chain of strategic installations arose, the Roman authorities possibly encouraged and successfully exploited this situation. Only future fieldwork, hopefully leading to the retrieval of written sources, may be able to provide evidence on the identity of the builders of the chain of Late Roman forts in the Kharga Oasis. For the moment, we may conclude that the major building operations that characterized Kharga in the Late Roman Period appear to be the result of a concerted effort that moved along a continuous line, linking the Roman strategic necessities with Egyptian personnel and workforce.⬈"
}