{
  "articleId": "isaw_paper5",
  "text": "ARTICLE_ID: isaw_paper5\nThis brief note draws attention to a passage from the Syriac Cause of All Causes that describes the Pillars of Hercules, but as being three in number rather than two.The Syriac text in question has been well-known since it was published in 1889.This particular passage is studied and commented on here especially as it appears in a recently cataloged manuscript from Dayr Al-Zau2018faru0101n, in which the passage is completely divorced from its context in the Cause of All Causes. Subjects: Manuscripts, Syriac; Geography, Ancient.Among the great mass of scientific material that Syriac scholars and translators brought into their language from Greek are various incarnations of natural philosophy.Parts of the pseudo-Aristotelian De Mundo, translated by Sergius of Reu0161 `Ainu0101 (d. 536), for example, served as a sort of handbook for Syriac readers interested in Greek wisdom on the natural world, both on this planet and beyond.1 The eminent scholar Jacob of Edessa (c. 630-708) incorporated Greek knowledge on the natural world into his Hexaemeron commentary2 and some centuries later Gregory bar u2018Ebru0101yu0101 (Barhebraeus, 1225/6-1286)3 would combine this Greek-inspired heritage of Syriac learning with the developing scholarship in Arabic on these fields.#p1Geographical knowledge, part of the study of natural philosophy, on a large (rather than local) scale in the classical world would have been incomplete without reference to the Pillars of Hercules,4 the limits of the known world, and this inclusion was also carried over into Syriac scholarship in the field.5 The Pillars of Hercules were most well known as the extreme end of the Mediterranean Sea and entrance into the Atlantic Ocean. The northern Pillar, without dispute, was the Rock of Gibraltar, while the identity of the corresponding southern Pillar in northwest Africa was open to disagreement (see below).#p2What exactly could a Syriac reader have known of the Pillars of Hercules?The De Mundo was mentioned above.In the Greek original of this work, the Pillars are called u1f29u03c1u03acu03bau03bbu03b5u03b9u03bfu03b9 u03c3u03c4u1fc6u03bbu03b1u03b9 (393a18, 393a24, 393b10) and u1f29u03c1u03b1u03bau03bbu03adu03bfu03c5u03c2 u03c3u03c4u1fc6u03bbu03b1u03b9 (393b23, 393b32), and the Syriac translator of the work uses the same Greek word in his Syriac version: su1e6du0113las.6 Rather than the Greek loanword of Sergius, Jacob of Edessa in his Hexaemeron uses the native, but etymologically equivalent, Syriac term qimu0101tu0101.7 Barhebraeus gives both terms, but then later only the Greek word.8#p3To this short (and incomplete) inventory of Syriac references to the Pillars of Hercules we can add another from The Cause of All Causes.9 The complete text, rather lengthy, was published by Karl Kayser in 1889,10 and the passage in question will be found on pp. 259-260 in his edition. A somewhat motley and disarranged manuscriptu2014and therefore one very difficult to dateu2014in the collection of Dayr Al-Zau2018faru0101n (Mardin, Turkey), now numbered 197, has recently been found to have a fragment of this very passage on a single folio (70r), but it is completely isolated from its original context, and there is no reference to The Cause of All Causes as a whole or to its title. As to this fragment's immediate surroundings in the manuscript:#p4On f. 68v is an olitu0101 (lament) having nothing to do with what immediately follows.It is also in a different hand.The diagram on f. 69r is that which appears in Kayser's edition on p. 241, that is, a rather long way from our fragment. (69v is blank.)71r has the circle of the Zodiac with the signs and with the Syriac names, together with a list (in Syriac) of 1. the signs of the seven planets (sun, moon, Mercury, Venus, Mars, Jupiter, and Saturn), and 2. their metals. On f. 71v begins a brief commentary in Garu0161u016bnu012b on the Nicene Creed (u0710u0720u0729u0718u0720 u0725u0720u071d u0710u0720u0710u0721u0710u0722u0717u0308 u0710u0720u072cu0720u072cu0721u0710u071du0717 u0718u072cu0721u0710u0722u071du0717u0308 u0725u072bu072a u0718u072cu0726u0723u071du072au0717u0710).The text of the fragment in question runs as follows:#p5u0718u071du0721u0710 u072au0712u0710 u0715u0710u0718u0729u071du0710u0722u0718u0723 u0723u0713u0308u071du0710u0710 u0710u0721u0323u072au071au0718 u0718u072au0715u0718 u0712u0717 u0720u0713u0718 u0718u0710u072cu071fu072au071fu0718 u0712u0717 u0719u0712u0722u0710 u0715u071du072au0308u071au0710 u0723u0713u0308u071du0710u0710 u0718u0723u071f u0720u0710 u0710u072bu071fu071au0718 u0723u0718u0726u0710 u0721u0722 u072cu071au0718u0323u0721u0710.. u0713u0719u072au0308u072cu0710 u0715u071du0722 u0729u0720u071du0720 u0710u071du072c u0712u0717. u0721u0722u0717u071du0722 u0715u0721u071du072cu072au0308u0722 11 u0712u0712u0722u0308u071du0722u072bu0710. u0718u0721u0722u0717u071du0722 u0720u071du072c u0712u0717u071du0722 u0710u0722u072b u0710u0720u0710 u071au071du0308u0718u072cu0710 u0722u0718u071fu072au0308u071du072cu0710 u0715u0720u0710 u0710u072cu071au0719u071du0722 u0712u0710[u072c]u072au0308u0718u072cu0710 u0710u071au072au0308u0722u0710. u072cu0721u0722 u0710u071du072cu071du0717u0307 u0713u0710u0715u071du072au0710 u0713u0719u072au072cu0710 u0710u071du071fu0710 u0715u0710u0729u071du0721 u0710u072au0710u0729u0720u071du0723 u0713u0722u0712u072au0710 u0718u0722u0712u071du0710 u0715u071au0308u0722u0726u0710 u0720u0308u0729u071du0721u072cu0710 u072cu0720u072c u0717u0722u071du0722 u071bu0712u0308u071du0712u072c 12 u0712u0725u0720u0721u0710 u0718u0710u0723u071bu071du0308u0720u0710u0723 u072au0308u0721u072cu0710 u0710u071du071f u0715u0720u0715u0718u071fu072au0722u0717 u0720u0721 u0715u0722u072bu072cu072cu0710u0723 13 u0725u0718u0717u0715u0722u0717 u0712u071fu0720u0717u0718u0722 u0715u072au0308u0710 u0715u0725u0720u0721u0710.. u0718u0710u0722 u0717u0722u0710 u0710u072cu0726u072au0723 u0718u0723u0712u0323u0720 u071fu0720u0717 u0717u0307u0718 u0725u0721u0720u0710 u072au0712u0710 u0715u0712u0719u0712u0722u0710 u0723u0713u071du0710u0710 u0718u072bu0726u0720u0710 u0715u0725u0721u0710 u072au0712u0710 u0718u0723u0718u0713u0710u0710 u0715u0722u0726u0729u0308u072cu0710 u0715u0725u0718u072cu072au0710 u0715u0720u0710 u0721u0722u071du0722u0710 u0718u0721u072cu0729u0720u0710 u0725u0712u0715 u0718u0710u0729u071du0721 u0720u0717u0720u071du0722 u0729u071du0308u0721u072cu0710 u072cu0717u071du072au0308u072cu0710 u0710u071du071fu0722u0710 u0715u0720u0710 u0722u072cu0725u071bu0710 u0725u0718u0717u0715u0722u0717 u0721u0722 u0725u0720u0721u0710 u071fu0715 u071du0718u072cu072au0722 u0720u071du072c u0721u0722 u0717u0307u0718 u072bu0726u0720u0710 u072au0712u0710u0703 u0721u0715u071du0722 u071au0722u0722 u072bu0308u0726u0720u0710 u0718u0721u0308u0710u071du0722u0710 u0710u071du071fu0722 u0720u0710 u0721u072cu0726u072au0723u071du0722u0722 u07 15u0722u072bu0712u0718u0729 u0720u0722 u0725u0718u0717u0715u0722u0710 u071bu0712u0710 u0712u0725u0720u0721u0710. u0712u071du0715 u0725u0741u0712u0308u0715u0710 u071bu0712u0308u0710 u0718u0715u0718u0712u072au0308u0710 u072bu0726u071du072au0308u0710. u0710u071du0715 u0715u0725u0712u0715u0718 u0710u0712u0717u0308u071du0722 u0729u0715u0308u0721u071du0710 u0715u0710u072cu0715u0712u072au0718 u072cu0729u0722u0710u071du072c. u0718u0712u0725u0720u0721u0710 u0721u0741u0722 u0717u0722u0710 u0710u072cu0722u0728u071au0718 u0718u0710u072cu0729u0720u0723u0718. u0718u0729u0722u071du0718 u072bu0721u0710 u071bu0712u0710 u0718u0710u072cu072au072bu0721 u072bu0721u0710 u0715u0722u0728u071au0308u0722u071du0717u0718u0722 u0710u071du0720 u0715u0720u0715u0718u071fu072au0722u0710 u071bu0712u0710 u0725u0715u0721u0710 u0725u0715u0721u0710 u0720u072bu0718u0720u0721u0710u0700 u0718u0712u0725u0720u0721u0710 u0715u0725u072cu071du0715 u071du072au072cu071du0722 u0721u0720u071fu0718u072cu0710 u072bu0721u071du0722u071du072cu0710 u0718u071au0308u071du0710 u0715u071fu0710 u0725u0712u072au071du0722u0709 u0715u0720u0717u0718u0722 u0722u072bu072cu0718u0710 u0710u0726 u071au0722u0722 u0712u0728u0720u0308u0718u072cu0717u0718u0722 u0710u0721u071du0722..A marginal note in the outer margin and in the same hand runs:14 #p6u0717u0720u071du0722 u072cu0720u072c 15 u0729u071du0308u0721u072cu0710 u0710u0729u071du0721 u0710u0722u071du0722 u0712u072cu071au0718u0721u0710 u0715u0721u072cu0725u0721u072au0722u071du072cu0710 u0718u0710u0722 u0713u0307u0715u072b u0718u0721u072cu0715u071au071du0 710 u0710u0720u0726u0710 u0720u072cu0721u0722 u0721u0722 u0729u071bu071du072au0710 u0715u072au0308u0718u071au0710. u0726u0723u0729u071du0722 u0721u0308u0720u071au0710 u0723u0712u072au0710 u0715u071au071du0308u071du0717u0718u0722. u0721u071bu0720 u0715u0720u0710 u0721u0728u071du0722 16 u0715u0722u0717u0726u071fu0718u0722 u0721u0722 u072cu0721u0722. u0721u0722 u0728u0720u0307u071du0710 u0715u071du0721u0710. u0717u0304 u0715u0721u072bu072cu072au0308u0713u0720u0722 u0723u0726u0308u071du0722u072cu0710 u0718u0710u0719u0720u0308u0722 u0712u0728u0720u0307u071du0710 u0715u071du0721u0710 u0718u0720u071du072c u0720u0721u0717u0726u071f. 17Translation, with the marginal note inserted in its proper place (in italics):#p7Many have dared to travel within the great sea, Ocean, and have gone about in it for months at a time, but they still have not found the edge of its limit. For there are some islands in it, some of which abound in people, some of which only have strange animals which are not seen elsewhere.There [at the edge of the world] is an island, Gadeira,18 where Hercules, the hero and prophet19 of the pagans, set up three20 columns, those that are famous in the world, high pillars, so that his commemoration, along with his memory might be brought21 into all generations of the world. These three22 columns he set up at the border of the inhabited world, and if it happens that a ship is propelled there by the force of the winds, sailors give up hope for their lives, since they would then be unable to return from there, the whirlpool of the sea, that is, because boats continually rush at the whirlpool and cannot return.23 If [i.e. since] he took pains and endured all this great labor for a long time and the humiliation of a great people,24 and made a considerable monetary expense without number or weight, he set up these marvelous columns, lest his memory be wiped out from the earth, there [otherwise] being no benefit from that great effort. Therefore, we, weakened and inactive, how will we leave ourselves a memory without taking pains?Especially for the seemingly unique reference to three, and not two, Pillars of Hercules, this short fragment, which at least once was circulated independently, deserves broader notice, but even more generally, it is worth being made better known as another specific witness to Syriac interest in Greek (natural) philosophy."
}