{
  "articleId": "isaw_paper18_1",
  "text": "ARTICLE_ID: isaw_paper18_1\nISAW Papers 18.1 (2020) Introduction Franziska Naether, Leipzig University/Stellenbosch University In Franziska Naether, ed. 2020. Cult Practices in Ancient Literatures: Egyptian, Near Eastern and Graeco-Roman Narratives in a Cross-Cultural Perspective. Proceedings of a Workshop at the Institute for the Study of the Ancient World, New York, May 16-17, 2016. ISAW Papers 18. URI: http://hdl.handle.net/2333.1/1ns1rz35 Library of Congress Subjects: Rites and ceremonies in literature--Congresses; Magic, Ancient--Congresses. Table of Contents Introduction Methodological Remarks Analyzing the Phenomena Acknowledgements Bibliography Notes Abbreviations used by Contributors More About the Workshop Video Recordings of the Talks Contributors and Abstracts Heroic stories and novels, tales, travel fictions and wisdom texts in the ancient world, from Egypt to Greece, from Anatolia to Rome, contained rituals, magic, and divination. In a two-day workshop held at the Institute for the Study of the Ancient World on May 16–17, 2016 senior and emerging scholars who study rituals, magical, and divinatory practices in the context of literary texts were invited to contribute to a wide-ranging discussion of such cult practices and their functions in regard to ritual and literary studies. Topics included secret knowledge, presentations of the divine and of fate, and practitioners of cult practices as protagonists in the narratives. Particular attention was devoted to the portrayal and identity of “wise” men and women – priests, magicians, wizards, etc. – and their female counterparts. Among the practices, magical spells and oracles communicated through inspiration, dreams and other methods of divination came in for special discussion. The essays and abstracts collected here represent the proceedings of this workshop. The research questions laid out here touch not only issues of content, but also of methodology: what information do we have about ritual participants, locations, instruments, etc., and how should we analyze our sources from the view of religious studies? What perspectives do narratives and wisdom texts offer for the study of cult practices, and what are their limitations? How can language, story lines and ritual quotations be explained in terms of literary studies? The analysis of cult practices as situations of communication between actants in particular offers great insights for the discussion of literary studies in our fields and in ritual studies. As far as I can see, the topic of this publication has been discussed only rarely on a transdisciplinary level, e.g. for the novel in Graeco-Roman Egypt.1 This stands in stark contrast to the fact that religious action is very often part of the plot of ancient works of literature. Typically, scholars have commented only on individual phenomena but have not tried to put together a larger research group containing contributors from different fields, e.g., Bible Studies and the Ancient Near East. In this workshop, we took “cult practice” to mean the totality of all religious, ritual, divinatory and magical practices. It is a neutral term that encompasses all problematic terms and phenomena, e.g. “magic” or “ritual power.” Such cult practices were performed both during the official cult in the temple and in private areas. A few of the papers discuss the issues of categorization of rituals as “public” or “private,” and reflect on emic and etic perspectives of “magic” and “witchcraft” (in contrast or as part of “religion”), such as the Sumerian “Kishpu,” the Egyptian “Heka,” or the Greek “Mageia” and “Goeteia” in the ancient cultures and from a modern scholarly viewpoint (see the contributions of Gina Konstantopoulos, Edward Love, Philippe Matthey, and Mark Roblee). The approach of many of the papers presented in this workshop is phenomena- and genre-based. The contributions focus on novels, tales, and dramas. Those texts follow the broad definition of literature which has been proposed by scholars such as Elke Blumenthal and Willy Clarysse: that texts could be reused and read aloud to an audience and therefore are by definition literary.2 In fact, the actual number of literate people in ancient cultures must have been very small in regard to the total of the population.3 Hence, we are dealing with the output of a small élite, which was consumed by an audience mainly by oral culture. Methodological Remarks The texts which we dealt with in the workshop spanned several millennia. They originated from numerous royal dynasties and cultures in the ancient world. Some of them might have been transmitted in long lines of tradition. Oftentimes, they were composed in different languages and likely underwent several redactions. One particular focus of our workshop was the rich material in Demotic from Egypt (ca. 700 bce until 500 ce), which has been gaining more and more attention over the last three decades. The texts feature different belief systems: pagan religions from Mesopotamia, Egypt, Greece and Rome, and Christianity, among others. During the millennia, cult practices and the access of priests and the public to the gods changed, and the functions of individual divinities underwent a transition. It is therefore crucial to contextualize the narratives in their historical settings, if possible, both that in which the texts were composed and the one in which the narratives are set, which could differ considerably if narratives are set in a distant past. However, our understanding about certain phenomena is restricted by the evidence. Some works of literature survive in only one copy, such as the stories from the Egyptian Papyrus Westcar (see Rita Lucarelli’s contribution), while the “Alexander Romance” treated by Philippe Matthey is available in numerous copies and languages through the ages, forming different avenues of reception. The Greek comedies and dramas which form the base of Elena Chepel’s research have been transmitted through the copies of monks in Medieval times. Each of these forms of transmission is complex and requires special methodological attention when it comes to interpretation. Another issue is the credibility of the mentions and descriptions of cult practices: how accurate should we take them to be? How do the intentions of authors and subsequent bias or otherwise affect such descriptions, and should one assume that they might have priestly connections? All of these considerations suggest an approach based on phenomena, or an analysis of cult practices by the methods of the sociology of religion and socio-linguistics, and by embedding the narratives into their socio-historical context. Analyzing the Phenomena While working in transdisciplinary environments like that at ISAW and particularly within this workshop, it is always practical to start by asking simple “W-questions,” to establish common ground and fundamental differences. First of all, the WHAT: cult practices themselves and their treatment in literary texts can be analyzed according to their method of ritual category. The Egyptian pḥ-nṯr, literally “reaching a god,” a term for an oracular consultation, is discussed in a couple of contributions (Philippe Matthey, Mark Roblee, and Edward Love). Rituals might contain interesting motifs such as hierophagy (for prophecy) in Meredith Warren’s paper or the intoxication with alcohol whose effects worked like or alongside magic as presented by Lucas Livingston. Another popular subject was that of transformation: transforming oneself, a person or an object into someone or something else. In studying topics like incubation or the ingestion of alcohol, the literary evidence could be paired with archaeological remains, such as temples where certain practices might have been performed or artifacts from the material world (see the contributions by Gil Renberg and Lucas Livingston). A main focus of the papers presented and collected here lies in the quest for the WHO: the practitioners, such as priests, mantic specialists, wandering personnel, shamans, holy, old, and “wise” men and women, however they are called in the sources and the secondary literature. They form one part in the chain of communication between the human and the divine, often taking an important intermediate position because of their status within the élite or otherwise professional or priestly hierarchy. They might be royal or central members of the community. One common denominator is that they are literate and initiated into arcane knowledge. They could represent petitioners – locals like villagers or even the king within the cult practices in front of the gods. The tasks of such intermediaries were to perform offerings, write down oracle questions, or interpret divine replies to the persons who approached them for help. Furthermore, we could assume a public or audience of some sort depending on the accessibility of the rituals. While in Egypt the practitioners are most often part of the temple hierarchy and male, we can establish a literary figure of the “priest-magician” as a common protagonist of narratives (see Rita Lucarelli, Edward Love, Philippe Matthey, Mark Roblee, and Gil Renberg) – contrary to the Greek world (Lucas Livingston and Elena Chepel). Mesopotamian literature offers more women, e.g., the wise (old) “um-ma” or “witch” (treated by Gina Konstantopoulos, Ainsley Hawthorn, and Rita Lucarelli). This character is completely absent in the Nile Valley.4 In Late Antiquity there was a shift of cult practices from temples and churches to individuals, which produced further specific characters such as the holy man who could be a church father, a hermit, or a monk (Meredith Warren). Some scholars in this volume thematize a “democratization” of cult practices (e.g., Gil Renberg, Mark Roblee, and Meredith Warren). This means that formerly restricted rituals were available to more and more petitioners through the ages. Other participants of the communication process are gods, demons and other entities people sought out for counsel, therapy, and information on past, present and future. Sometimes, it is not easy to discern these personages when it comes to terminology (e.g., defining a demon). WHERE cult practices could take place is also varied and connected to the practitioners: in big cult centers, local temples, royal courts, caverns, or open waters and fields. Tackling the question of WHEN, it is obvious that rituals occurred at certain times of the year according to calendars of religious festivals. In contrast, magical practices are sometimes performed at night under the cover of darkness. In the literary texts, there is a tendency for cultic action to occur when the story demands it, following the intention of the author. By which means or HOW an individual cult practice has been executed is, finally, another important question: there is a variety of expressions used for “casting spells” (Edward Love, Gina Konstantopoulos). Many of these practices have been marked as “foreign” (e.g., incubation, the witch in Mesopotamia, the Nubian sorcerer, etc.), though this is more a social designation used by groups in order to discredit the “other” rather than implying an actual import from elsewhere. An exciting and popular literary setting in the narratives are battles and duels of wizards. A story with a quite famous battle is the Second Setna Novel (often referred to as Setne II by the contributors), in which Setna’s son, the wunderkind Si-Osiris, is fighting against a “shaman” from Nubia (ȝte n igš in Egyptian). I have treated this and other comparable tales such as the unpublished Demotic narrative The Story of King Djoser and Imhotep and the Sumerian epic tale Enmerkar and the Lord of Aratta elsewhere.5 Here, duels are also featured in the contributions by Gina Konstantopoulos, Rita Lucarelli and Edward Love.6 Heroes and magical battles – not only the ancient narratives, but also the treatments by the authors of this collection – provide an exciting read. Gil Renberg and Meredith Warren have recently published monographs about their research. Both of them agreed to provide short summaries of their work with links to their larger projects. Elena Chepel and Lucas Livingston kindly provided extended abstracts as well. Mark Roblee did not deliver a paper at the workshop but agreed to write a contribution. With this volume, we hope to instigate further research on this fascinating topic of reading literary texts with an eye to religious phenomena and their performance. Acknowledgements: The workshop was made possible by funding from the Volkswagen Foundation (Germany) and additional funding by ISAW. It was a requirement of the grant to invite chiefly North American and emerging scholars. I am very grateful for this generous financial support. During the academic year of 2015–16, I was a Visiting Research Scholar at ISAW working on my project “Cult Practices in Ancient Egyptian Literature,” which I submitted as a habilitation thesis to Leipzig University. This workshop aimed to put my research in context with other ancient cultures and I am grateful that the editors of ISAW Papers accepted this proposal and made this publication possible (Roger Bagnall, Sebastian Heath, David Ratzan, and Zoe Blecher-Cohen). Thanks are also due to Marc LeBlanc, Andrea Chang, Shaun Gaffney, Maggie Pavao, Beate Pongratz-Leisten, Julianna Reitz, Irene Soto Marin, and Kristen Soule for their support organizing the workshop, as well as to my colleague Kerstin Seidel from the Egyptological Institute at Leipzig University for her assistance in administrative affairs on the German side. They all helped to make this cooperation project of NYU and LU a success. The publication was prepared while I was in New York and Leipzig and while holding a “EUROSA” grant by the European Union at Stellenbosch University in South Africa. Several anonymous peer reviewers provided the authors with helpful commentaries and suggestions."
}