{
  "articleId": "isaw_paper10",
  "text": "ARTICLE_ID: isaw_paper10\nPreliminary Report on Early Byzantine Pottery from a Building Complex at Kenchreai (Greece). ISAW Papers 10. content : This paper presents the results of preliminary study of Early Byzantine pottery from a large building near the waterfront at Kenchreai in southern Greece.Kenchreai served as the eastern port of Corinth throughout antiquity.The building was first excavated in 1976 by the Greek Archaeological Service, and it has been investigated since 2014 by the American Excavations at Kenchreai with permission from the Ministry of Culture under the auspices of the American School of Classical Studies at Athens. The pottery is characterized by the presence of many Late Roman Amphora 2 rims as well as stoppers and funnels.This indicates that the building had a role in the distribution of regional agricultural products during its final phase, which is dated to the very late sixth or early seventh centures by African Red-Slip and Phocaean Red-Slip tablewares. A wide range of lamps, glass vessels, and other small finds has also been recorded. Results to date are preliminary but ongoing work may allow further precision as to the chronology and use of this building. n nLibrary of Congress Subjects: Kenchreai (Greece); Pottery, Roman; Pottery, Byzantine; Economic history--Medieval, 500-1500. n nContents n nIntroduction n nThe Site of Kenchreai n nTowards a Chronology of the Threpsiades Complex n nPreliminary Quantification of Amphoras n nLarge and Small Late Roman Amphora 2 n nLRA2 Stoppers and Two Funnel Types n nActivities Within the Building n nOther Amphoras n nThe Threpsiades Site and Regional Change n nAcknowledgements n nReferences n nNotes n nIntroduction n nIn 1976 the Greek Archaeological Service under the direction of Kalliopi Kristalli-Votsi, then Ephor of the former 4th u0395 u03a0 u039a u0391 of the Argolidocorinthia, and her assistant, Elisavet Chatzipouliou, excavated a large building at Kenchreai, the town that served as the Aegean port of the major city of Corinth. The building is located very close to the ancient harbor, alongside the National Highway to Epidavros (figs. 1 and 2).Attention was drawn to the site following plans for construction by the landowners at the time, whose surname Threpsiades now serves as the name of the excavated area.The Threpsiades property is a declared archaeological site under the oversight of the Hellenic Ministry of Culture, and the finds recovered in 1976 are stored in the Isthmia Museum.1 n nAs is usual for excavation in a Mediterranean urban environment, pottery makes up the overwhelming bulk of the assemblage. This material is remarkable for a large number of regional and imported amphoras, the latter in much smaller amounts, along with numerous stoppers for the regional vessels and a small group of funnels.The pottery is the main focus of this preliminary report.There is, however, also a rich variety of small finds, including a large group of Late Roman to Early Byzantine glass, including cylinder-blown window panes, trail-decorated flasks with funnel- to U-shaped mouths of a type common in the Byzantine to Islamic Middle East, and possible evidence for glassmaking. These diverse and copious finds suggest that the building complex on the Threpsiades property played a role in the movement of regional agricultural products, and perhaps of consumer goods as well, during the very late sixth to early seventh centuries 2 They provide important new evidence for local vitality, long-distance exchange, and dynamic communication in the northeastern Peloponnese during the Early Byzantine period. n nA summary of the work in 1976 by the Archaeological Service work was published in 1984.3 That report noted the presence of many amphoras and provided basic observations about the building and a massive destruction event involving burning and structural collapse. To date, however, no full study has appeared.In 2013 Ms.Kristalli-Votsi transferred her rights to the site and its finds to Joseph Rife, Director of the American Excavations at Kenchreai.All work at the site and on the finds takes place with the permission of Ministry of Culture and the oversight of the Corinthian Ephoreia under the auspices of the American School of Classical Studies at Athens.In May 2014, Sebastian Heath and Phyllis Graham, with the assistance of Gavin Blasdel, began study of the material in the Isthmia Museum. Rife and Jorge Bravo III, Co-Director of the American Excavations at Kenchreai, began comprehensive re-evaluation of the building on the Threpsiades property in June 2014.The results of these new investigations offer a firmer basis for determining the date of activity in the complex than was previously published.4 Moreover, preliminary quantification of amphora rims provides evidence for assessing the role of Early Byzantine Kenchreai in the regional and Eastern Mediterranean economy. The numbers appearing below are drawn from processing of 93 crates of pottery that hold well over 50,000 sherds.Quantification was done in 2014 and study continued in 2015.While this ongoing work is the beginning of a multi-year process that will lead to full publication, we believe that a timely announcement of our research may be useful to readers and that any responses will benefit us as we move toward more complete results. n nThe Site of Kenchreai n nThe port town of Kenchreai lies at the western end of the Saronic Gulf at the point where the shore is easily reached from Corinth, which lies some 10 km inland and to which Kenchreai was connected by road during the Roman era. The long, irregular ridge of Mount Oneion extends inland just south of the site, and the coast immediately to the north has low cliffs that would have made landing and loading or unloading trade-vessels difficult.Between these coastal stretches, the small, curved bay and beachline today provide access to the water, and movement inland is relatively easy.It is this landward topographic aspect that contributed to the placement of Corinth u2019s eastern harbor, a role that Kenchreai may have served throughout antiquity. While Hellenistic and earlier remains at the site are not well preserved, excavations begun in 1963 under the general direction of Robert Scranton of the University of Chicago for the American School revealed the extensive remains of the Roman port.5 Two massive breakwaters erected probably under Augustus facilitated the reception of maritime traffic and sustained seaborne commerce for centuries.The moles defined clear northern and southern limits of the port and turned an exposed landing into a deep, protected harbor with good anchorage and a long quay. n nThe literary testimony for Kenchreai during the Early to Middle Roman periods attests to local prosperity, social, cultural and religious diversity, and a bustling economy. Strabo (Geographies 8.6.22) wrote of Kenchreai that the Corinthians, u201cuse [it] for trade from Asia. u201d Ovid (Tristia 1.10.9) reported that he boarded the vessel Minerva there and then disembarked at Tempyra on the Thracian coast before proceeding on foot to his exile in Tomis.Kenchreai is briefly mentioned in the New Testament, first as an early stopping point in Paul u2019s journey from Corinth to Syria via Ephesus (Acts 18:18) and then as the home of the deaconess Phoebe (Romans 16:1), whom Paul commends to the Roman church. In his brief description of the port-town, the second-century travel writer Pausanias (Description of Greece 2.2.3) mentions sanctuaries and a bronze statue of Poseidon at the harbor.6 Kenchreai is also the setting for the last book of Apuleius u2019 Metamorphoses (Book 11), in which the protagonist Lucius is initiated into the local cult of Isis.These passages illustrate Kenchreai as a well-connected port and a prosperous community during the first and second centuries n nIt was the report of Pausanias and the visible presence of ancient architecture that motivated the start of excavation in 1963. The initial publication of the site aimed to assimilate the extant architectural remains to the temples of Aphrodite and Isis cited by Pausanias, but subsequent scholarship has called these identifications into question, and they are not now widely held.7 The early phase of the American Excavations in the 1960s also uncovered extensive architectural and artifactual evidence for the Roman port u2019s commercial life. More recent fieldwork has focused on the necropolis and residential quarter on the ridge northeast of the harbor.8 n nUrban development continued at Kenchreai during and beyond the third century.The local community witnessed substantial renovation and expansion of the portside structures during the fourth century.In the late fourth century, one or more seismic disasters led to the abandonment and filling of a fountain court on the south mole. This space was temporarily being used for the storage of crates with over 120 glass panels in opus sectile depicting harbors, Nilotic scenes, and cultural celebrities.9 The difficulties indicated by the loss of these panels, however, were not the end of Roman Kenchreai. A church was built on the south mole around the late fifth or early sixth century, and another early church is located roughly 1 km up the coast in the port u2019s northern suburbs. These structures did not stay in use for very long and seem to have fallen into disrepair by the late sixth or early seventh centuries, perhaps around the time of the unknown destruction event at the Threpsiades complex under consideration in this article.The immediate circumstances of Early Byzantine Kenchreai u2019s further decline in the seventh to ninth centuries are unclear, as are the circumstances that lead to a renewal of activity in the Middle Byzantine period. Today the toponym Kechries ( u039a u03b5 u03c7 u03c1 u03b9 u03ad u03c2) refers to a small village lacking any municipal identity or business and consisting largely of weekend and summer homes. n nTowards a Chronology of the Threpsiades Complex n nThe Threspiades property is located ca. 35 meters due west of the mid-southwest part of the modern public beach, which represents roughly the shoreline of the Roman harbor. It is situated at the northwest corner of the intersection of the highway to Epidavros (Ethniki Odos 10) and the road through the village of Kechries (Odos Apostolou Pavlou).10 Although constrained by existing property lines and modern roads, the excavators in 1976 uncovered multiple large rooms flanking wide halls and an ornate peristyle, all enclosed in a trapezoidal arrangement.The building had a second story indicated by a well-built staircase. This spacious plan and its interior decor suggest that the complex was not built solely as a work-space; perhaps its original use was as a lavish private residence or a monumental public building.In any case, it is clear that the building had developed mainly into a work-space in its final phase before abandonment and its gradual burial under colluvial sediment. n nAt the current stage of study, the date of the earliest phase of the building remains uncertain, though either Middle or Late Roman seems most likely. Moreover, while it is clear that the fabric and use of the building were disrupted by a catastrophic destruction, stratigraphic study of the Threpsiades complex has not yet revealed when this destruction happened.Two scenarios seem most likely.In the first, destruction struck the site at some point in the sixth century and damaged the impressive private or public complex, after which point it was reoccupied for more utilitarian or industrial use that ended in the seventh century. In the second, destruction struck the site at some point in the early seventh century and brought an end to the utilitarian or industrial final use of a formerly impressive private or public complex.It is also possible that the area suffered multiple episodes of destruction. n nAlthough a full and precise chronology of the Threpsiades complex remains elusive, current investigation allows the final phase of activity in the building to be assigned confidently to the very late sixth to early seventh centuries. This date is mainly based on red-slipped tablewares. A nearly complete African Red-Slip (ARS) Hayes form 105 (Fig. 3) with no interior stamped decoration gives a strong terminus post quem of 580.11 Another large fragment of a Hayes 105-type base along with similar, less-well preserved base sherds strengthen this chronology, as do small ARS Hayes form 99c rim sherds.In addition, three well-preserved ARS Hayes II lamps with late discus designs are not inconsistent with the ARS table vessels. We have also recorded a Phocaean Red-Slip (PRS) Hayes form 3f of the sixth century, five PRS Hayes form 10c rims (PRS) and nine Hayes form 10a rims (examples illustrated in Fig. 3).12 While the imported tableware assemblage only supports limited precision on the order of decades the ARS does suggest that the deposit closed by the early seventh century.The material from multiple deposits at Corinth published under the rubric u201cAssemblage 4 u201d within a sequence of Late Roman material is relevant here. ARS forms 107 and 109 are present at Corinth but not identified in the Threpsiades assemblage, which can suggest a closing at Kenchreai before 600.13 Among more recently published early seventh-century assemblages, the material from the so-called u201cBishop u2019s House u201d at Nicopolis is a useful parallel, particularly because ARS Hayes form 105 also contributes to establishing its date, as does a coin of the emperor Phocas (602-610).14 Moreover, discussion of the absence from Nicopolis of ARS Hayes form 109, which as noted also does not occur in the Threpsiades complex, further suggests that overly precise dating from ceramic forms is problematic in the face of competing chronologies and uncertain stratigraphy.15 n nCare is warranted in establishing the chronological limits of the total assemblage from the building and in assessing how much of it was associated with the final phase of activity. Some but not all of the original recording system for the stored artifacts is recoverable.There has been mixing of material between plastic storage crates u2014this has proven that the bottoms of such containers break if overloaded u2014and not all tags were readable at first inspection.Furthermore, we stress that the data appearing in this article were collected during an initial survey of the material. Almost all sherds remain unwashed, so that full processing of the assemblage will reveal more detail.Future clearing of spoilage at the site will undoubtedly contribute more evidence to the finds already stored at Isthmia.Finally, it may be possible to assess more exactly the stratigraphic associations of the finds, in which case our understanding of the depositional sequence and the building u2019s chronology may shift. n nDespite these concerns, we can now characterize certain basic features of the assemblage. It displays a striking degree of consistency.As will be discussed below, the regionally produced Late Roman Amphora 2 (LRA2) predominates.Except for a small number of Hellenistic and perhaps earlier sherds and a small number of Early and Middle Roman sherds, we agree with the original excavator that much of this material is associated with the final phase of occupation.Thus, as this important group of pottery is studied and further cited, it should be kept in mind that it may include a small but uncertain number of sherds that predate Late Antiquity. These would affect the accuracy of any quantification of sherds dated to the late sixth and early seventh centuries. n nPreliminary Quantification of Amphoras n nLate Roman transport amphoras form the most abundant component of the ceramic record in the Threpsiades complex.Preliminary quantification (fig. 4) of 501 rims from the well-known series of Late Roman Amphoras 1 through 5/6 provides a firm basis for situating Kenchreai in both regional and Eastern Mediterranean economic networks.16 It is the case, however, that essentially all the quantification undertaken at this stage of study has been by rim counts. In his review of quantification methods, Pe u00f1a described such data as u201cnot statistically valid. u201d17 While recognizing the shortcomings of this approach, we do believe that the overall impression offered by Figure 4 and Table 1 is useful in discussing the relative amounts of these amphoras present in the complex during Late Antiquity.Moreover, the first two seasons of work have identified amphora forms other than these most widely recognized ones, which will be briefly discussed below. n nType Count Percent Origin LRA2 361 72.1 Aegean LRA1 51 10.2 Cilicia/Cyprus LRA5 46 9.2 Palestine LRA4 39 7.8 Palestine/Gaza LRA3 4 0.8 SW Anatolia n nLarge and Small Late Roman Amphora 2 n nThe round-bodied, high-necked form Late Roman Amphora 2 makes up approximately 72% of the rim count at the Threpsiades site.18 Slane and Sanders have appropriately warned against simplistic usage of this term and we intend it here in a very generic sense.19 As they note, multiple Aegean regions produced this form, a point reinforced by Reynolds u2019 analysis of assemblages at Beirut and Butrint as well as by other studies.20 In the context of this article it is important that the Argolid, which is linked to Kenchreai over the mountainous passes of the southeastern Corinthia, is recognized as a major producer of LRA2 vessels. A kiln-site producing the form near Porto Cheli in the southern Argolid is dated by the presence of ARS, PRS and a coin of the emperor Phocas (602-610).21 That region u2019s workshops produced vessels with an identifiable pinkish fabric and a beige surface.22 The fabric of many of the LRA2 rims, other diagnostics, and body sherds from the Threpsiades excavations is likely of or closely related to this Argolid variety, which has also been identified at Corinth. A further indication that Kenchreai is within one of the multiple active regions of LRA2 production and use comes from the Eastern Korinthia Archaeological Survey (EKAS), whose members recognized that combed body sherds were among the most abundant Late Roman artifact categories.23 When one considers LRA2 broadly, the recent publication of kilns at Dilesi in Boeotia adds to the increasing firm evidence that production was widespread.24 n nThere is diversity among the LRA2 vessels from the Threpsiades complex. Among those rims measured, we have noted a range of maximum exterior diameters of 9-12 cm.Very large vessels have rim heights just over 5 cm and neck heights just over 9 cm.Rim heights of less massively constructed LRA2 vessels are just under 4 cm but the neck height remains around 9 cm.The rims on the largest vessels are often slightly offset from the neck.We have not refit body sherds, but we note the predominance of deep wavy combing. It is of interest that some LRA2 body sherds bear black characters or symbols.These markings are distinct from the red dipinti that are not uncommon on LRA2 vessels.These preliminary observations suggest directions for future study.In sum, the Threpsiades group of LRA2 amphoras is large enough to encompass differences, but those differences fall within a range that is well-known for the form.25 n nIn addition to the many typical LRA2 amphora rims, we counted 222 rim sherds of distinctly smaller vessels. Figure 5 shows a comparison of the rim and neck profiles of the full-sized or u201clarge u201d and u201csmall u201d types.The smaller version has a less substantial rim that is of more even thickness, and there is often a distinct exterior demarcation as neck turns to rim.The distinction is subtle, presumably because the smaller version was very closely inspired by the larger, but familiarity makes the differences discernible, even between small rim and handle sherds. Further study may show that the u201cLRA2 Small u201d form is best considered a fractional container, meaning that it was produced at a regular and measured proportion of its larger mate.26 n nBeyond Kenchreai, smaller variants of LRA2 are known from Argos, Corinth and Pyrgouthi, among other sites.27 An approximate parallel for the small Threpsiades vessels appears in the late-sixth-century u201cAssemblage 3 u201d at Corinth, which consists mostly of material from an underground chamber near the Baths of Aphrodite; the rim of that vessel appears thicker than ours in the published profile.28 There is an unpublished parallel at Athens, which is illustrated in an excavation notebook that the Agora Excavations makes available online.29 The Sikyon Survey Project has also published an LRA2 rim of small dimension. Other published profiles of smaller LRA2 vessels do not appear to be very close matches.30 A category of u201cLRA2-related u201d so-called amphorette known from Dichin, Bulgaria is very different.31 This brief survey may be enough to suggest that the Kenchreai u201cLRA2 Small u201d vessels and related forms are an LRA2 companion whose distribution far outside the Corinthia and nearby regions may be limited. At Kenchreai the form presumably had a role in surplus-oriented economic activities.At this early stage of study, however, we stress that the exact use of these small containers is unclear, and indeed they may have had multiple uses. Another noteworthy feature of the assemblage is the presence of 222 “small handled stoppers” (Fig. 7). While the total counts of stoppers and vessels are not equivalent, there is no doubt that the stoppers were used to seal both the large and small LRA2 amphoras with which they were found. We note that the smaller stoppers fit well in the small LRA2s (Fig. 8), while the larger ones likewise fit well in the mouths of large LRA2s.32 Furthermore, many of the stoppers are too small for the typical LRA2s and would only work in an LRA2 Small. This is an indication that the contents of LRA2 Smalls were sealed by stoppers in preparation for some combination of transport and storage. Also present is a much smaller number of stoppers formed by the widely attested technique of cutting down LRA2 body sherds. The small handled stoppers bear more comment. The association between these objects and LRA2 vessels is well established and paired examples are occasionally published.33 Often a phrase such as hastily made is applied to them and there is every reason to think that such objects were made efficiently.34 It is, nonetheless, appropriate to recognize some skill in matching stopper to vessel, however that was accomplished. To put that another way, these Late Roman stoppers, each of which served the essential role of keeping an LRA2 amphora’s contents inside it during transport, were made with sufficient care to meet their purpose. Workers handling liquid goods in the Early Byzantine Threpsiades complex also used at least two forms of funnels. One large form displays a proportion of spout to body (Fig. 9) that generally matches the overall profiles of late funnels published from Lechaion and farther afield from Athens, Crete, and Sicily.36 The second form has a much longer tube, one of which is illustrated in Figure 10, topped by a shallower bowl with an overhanging rim everted just below its upper lip.37 The narrow diameter of the long-tube form may have allowed air to pass out of an amphora while a worker filled it. We have also observed that the spout of the large funnels do fit well into the mouths of large LRA2s so that form might likewise work in the filling of amphoras. A general but still useful comparandum is a 29-cm-long bronze funnel said to be from Methylion in Thessaly and now in the British Museum (Fig. 11). This implement, which is tentatively dated to the sixth century, is notable for an inscription identifying it as property of the city.38 Among the finds from the Threpsiades complex is also a pierced screen from a strainer, a form that again would be useful in moving liquids between containers. Activities Within the Building The presence of two sizes of LRA2 alongside a substantial number of stoppers and funnels in the Threpsiades complex points to the export of amphora-born goods via Kenchreai’s active port. In this regard, it is worth stressing that LRA2s reached many regions of the Mediterranean as well as to the British isles.39 But beyond this general statement many questions remain and many narratives are possible. Did local products come to the Threpsiades complex in LRA2 Smalls before being poured into larger vessels for seaborne transport? As we have already speculated, filling might have involved the long-spouted funnels, though the shorter form was also available as needed. Any specific reconstruction of activity in the building will likely remain conjectural, though further study of stratigraphic relationships may increase the confidence with which we address these issues. The published group of finds most directly comparable to the Threpsiades material in terms of both composition and geographic proximity comes from Isthmia.40 A group of LRA2 and related objects was deposited in the Roman bath during the fifth century, when the building had fallen into disuse. The deposit contained ten amphoras, at least two funnels, and an unspecified number of stoppers that are either cut down from LRA2 sherds or are of the “small handled” variety that are common at the Threpsiades complex. Considering the basic similarity between the Isthmia Bath material and the Kenchreai assemblage, it is interesting to note that both belong to the late or secondary phases of activity in the two structures. At Isthmia, the amphoras were placed among the hypocaust pilings in one former hotroom, where they have been tentatively interpreted as liquid-containers used by workmen living or working nearby. While this is a reasonable suggestion, it is important in the context of our study to note that the placement of these amphoras does not indicate a role in the export of regional agricultural products. This apparent localized use of the vessels in the dilapidated Isthmia Bath distinguishes them from the much larger group of vessels in the seaside Threpsiades complex.The Threpsiades group of LRA2 amphoras that encompass two sizes, along with stoppers and funnels, should be understood in its regional economic context. To the extent that surplus agricultural production was ongoing in ca. 600, such activity supported and relied on a ceramic industry that in turn produced variants possibly intended only for local or regional use. That industry also produced specialized forms such as the funnels that allowed liquids to be poured into or out of amphoras. We can assert with confidence that such handling of liquid goods took place at Kenchreai. The remains from the Threpsiades complex thus attest to interrelated and perhaps self-sustaining complexity on the local and regional scales during the Early Byzantine period at Kenchreai. Other Amphoras Complexity is also reflected in the imported amphoras from this assemblage (Table 1).41 LRA1, a type produced in both Cyprus and Cilicia, is well-represented. LRA4 and LRA5 from ancient Palestine occur regularly in the complex. Moreover, a few sherds of the reduced-fired variant of the Palestinian baggy amphora from Beit She’an (LRA6), some preserving traces of white-swirl decoration, were found. LRA3 is rare.42 Preliminary study also identified the uppermost part of a North African Keay 62 type hooked rim, a spatheion in unslipped and pale non-Tunisian fabric, a flat-bottomed amphora base in coarse brown fabric near to Reynolds’ “Beirut 8”, rims of a well-fired form previously known from Kenchreai and also present at Corinth,43 and short spike toes of “Samos Cistern” amphoras. Many less frequently transported amphoras from the Eastern Mediterranean are becoming more widely recognized by Roman ceramicists, and close inspection of the Threpsiades group may well augment the variety of forms known from Kenchreai. Full washing of the diagnostics and body sherds will surely reveal further diversity.45 A few stubs from handles and a single rim of Neiderbeiber 77/Middle Roman Amphora 7 were present. Since MRA7s are very common in the third through fifth centuries, we again take their very low occurrence in this assemblage as a sign of its late date.46 A few “pinched handle” Middle Roman Amphora 4 handles are perhaps residual. As we have already noted, it may not be possible to reconstruct the original stratigraphic relationships between earlier and later deposits. The LRA4s and LRA5s show that Palestinian vessels comprise the greatest share of the imported amphoras stored in the building. LRA1s, broadly speaking from Cyprus and Cilicia, are second, though they form a greater portion than either LRA4 or LRA5 individually. It is significant that the LRA4s and LRA5s both display a diversity of fabrics, though especially the LRA5s. Most examples of the type are in the typical reddish, coarse fabric with the ridged surface giving way to combing at the shoulder and varying in color from red to pale. At least two well-preserved vessels are in a slightly less coarse, reddish fabric with a distinct coating of pale wash. One LRA5 stands out due to its very pale light brown fabric. Among the examples of LRA4, most are in the distinctive dark brown fabric that makes the type very recognizable, but some are in fabric very similar to the standard LRA5 fabric. Both this diversity of fabrics and the coincidence between fabric and form are consistent with a growing awareness of the geographic overlap of the regions that produced these two forms.47 While the designations “LRA4” and “LRA5” remain useful rubrics for our preliminary processing that facilitate a concise and accessible summary of the data, these artificial modern terms should not prevent us from appreciating the intersection in the vessels’ production. As we consider the question of economic complexity, it is significant that the products of multiple Palestinian workshops made their way to Kenchreai. We tentatively suggest that this makes any direct institutional or private connection between Palestine and Kenchreai unlikely. This is not “tied trade” in which goods are mobilized by a landowner with interests in both regions.48 Instead, goods are on the move because of the cumulative demand of Aegean consumers in combination with the relatively dominant market at Constantinople, which by the late sixth century was home to the largest concentration of mouths to feed.49 Further highlighting the strong connection between the Corinthia and Palestine at this time is the rare occurrence of so-called “Palestinian String Cut Casseroles” among the finds from the Threpsiades complex.50 It will be interesting to produce a complete count of this vessel type in relation to more regional utilitarian vessels. Although the remains on the Threpsiades property are limited, they represent a single complex that local residents used in its final phase for storing and filling amphoras during the very late sixth to early seventh centuries. This one locus of activity at Early Byzantine Kenchreai has a place in the regional narrative of long-term change.51 The construction of the Hexamilion, a defensive wall stretching across the Isthmus not far north of the harbor, in the early fifth century signals the evolving strategic circumstances of the Empire. Justinian (527-565) initiated a campaign of repair to the Isthmian fortifications and the addition of towers. This massive operation precedes by perhaps only a few decades the activity at Kenchreai represented by the finewares and amphoras from Threpsiades. Justinian’s military construction anticipated the real threat of incursion by the Avars and Slavs in the 580s. We use the generic term “Slavs” for new settlers whose arrival in Macedonia, central Greece, and the Peloponnese from the northern Balkans marked new circumstances for local communities.52 The main port on the closest major Saronic island, Aegina, sustained a sizable community represented by monumental architecture and a diverse range of artifacts into the seventh century. Only a few kilometers north of Kenchreai, the coastal establishment at Akra Sophia was active during the sixth century and probably into the seventh.54 The published LRA2 and beehive sherds, together with scattered fineware and structural remains, suggest this was a rural villa of sorts with opulent residential space and a small harborage, combining luxurious living with commercial engagement.55 Moreover, the countryside north and west of Kenchreai and across the central Isthmus has been systematically explored by the Eastern Korinthia Archaeological Survey in 1999-2002.56 Close analysis of surface ceramics has led to the conclusion that this rural space remained economically vibrant throughout the sixth century and that such activity then diminished over the course of the seventh and eighth.5 By the middle to late sixth century, the commercial capacity of the port at Kenchreai was declining from its Early to Middle Roman heyday. Alterations to the Fountain Court in which the glass opus sectile panels had once been stored are one step within a sequence of rebuilding that impinged upon the first-century commercial horrea, or storerooms, fronting the south pier.58 A late fifth or early sixth-century church dominated the landward end of this mole, and it is unclear to what degree the south harbor was still accessible for mooring. It also seems that the two moles were submerged during coseismic subsidence in Late Antiquity, thus permanently altering the built landscape of the port. Nonetheless, the protected shoreline and any extant facilities between Kenchreai’s moles would have still allowed the loading and unloading of ships from the Late Roman to Early Byzantine periods. Within this setting, the Threpsiades complex provides rich evidence for local, if fleeting, prosperity and connectivity to an economic network. In this regard, the building’s situation so close to the waterfront is significant: it would have had direct or near direct access to maritime traffic, even if the structure was in partial ruin during its final years. It also must have been close to the main road heading inland toward Corinth. The Early Byzantine pottery kept inside such an advantageously located building illustrates a nexus of two-way trade, and it may capture a moment or trace a sequence in the decline of that trade. We suspect that many of the LRA2s, particularly the large ones, were destined to be shipped out from Kenchreai, perhaps containing Corinthian commodities. The ships that would have carried them away may well have been the same ones that brought the eastern amphoras, the ARS and the PRS, and glass vessels to the port. Such imports could have been sent off to consumers on coastal or rural settlements, such as the villas at Akra Sophia or on the central Isthmus, or the larger market at Corinth. It is hard to know whether the end of storing and pouring in the Threpsiades complex at some point in the early seventh century was a seminal event in the life of the harbor or a symptom of more generalized changes. In any case, no one maintained the building for continued use after this time. Further study of this important building and all its contents will help us to understand better just what that use was. The American Excavations at Kenchreai conducts its work with permission from the Greek Ministry of Culture under the auspices of the American School of Classical Studies at Athens. Professor Joseph L. Rife (Vanderbilt University) is the Director and Jorge J. Bravo III (University of Maryland) is the Co-Director. We are grateful to the staff of the Isthmia Museum and to the Corinthian Ephoreia for their support and assistance in our work. Phyllis Graham (Crocker Art Museum) oversaw small finds processing. Gavin Blasdel, Austin van Namen, and Clayton Petti, students from Vanderbilt University, assisted with ceramic processing. A. Glynnis Fawkes (University of Vermont) and Tina Ross (London, Ontario) prepared the drawings, and Daniel M. Curtis (Minneapolis, Minnesota) prepared the digital photography. Administrative and financial support was provided by the Center for Hellenic Studies of Harvard University. The Institute for the Study of the Ancient World of New York University provided travel funds for Sebastian Heath (New York University). A Tier 1 Grant from the University of Maryland at College Park provided research funds for J. Bravo This paper presents the results of preliminary study of Early Byzantine pottery from a large building near the waterfront at Kenchreai in southern Greece.Kenchreai served as the eastern port of Corinth throughout antiquity.The building was first excavated in 1976 by the Greek Archaeological Service, and it has been investigated since 2014 by the American Excavations at Kenchreai with permission from the Ministry of Culture under the auspices of the American School of Classical Studies at Athens. The pottery is characterized by the presence of many Late Roman Amphora 2 rims as well as stoppers and funnels.This indicates that the building had a role in the distribution of regional agricultural products during its final phase, which is dated to the very late sixth or early seventh centures by African Red-Slip and Phocaean Red-Slip tablewares. A wide range of lamps, glass vessels, and other small finds has also been recorded. Results to date are preliminary but ongoing work may allow further precision as to the chronology and use of this building. n nLibrary of Congress Subjects: Kenchreai (Greece); Pottery, Roman; Pottery, Byzantine; Economic history--Medieval, 500-1500. n nContents n nIntroduction n nThe Site of Kenchreai n nTowards a Chronology of the Threpsiades Complex n nPreliminary Quantification of Amphoras n nLarge and Small Late Roman Amphora 2 n nLRA2 Stoppers and Two Funnel Types n nActivities Within the Building n nOther Amphoras n nThe Threpsiades Site and Regional Change n nAcknowledgements n nReferences n nNotes n nIntroduction n nIn 1976 the Greek Archaeological Service under the direction of Kalliopi Kristalli-Votsi, then Ephor of the former 4th u0395 u03a0 u039a u0391 of the Argolidocorinthia, and her assistant, Elisavet Chatzipouliou, excavated a large building at Kenchreai, the town that served as the Aegean port of the major city of Corinth. The building is located very close to the ancient harbor, alongside the National Highway to Epidavros (figs. 1 and 2).Attention was drawn to the site following plans for construction by the landowners at the time, whose surname Threpsiades now serves as the name of the excavated area.The Threpsiades property is a declared archaeological site under the oversight of the Hellenic Ministry of Culture, and the finds recovered in 1976 are stored in the Isthmia Museum.1 n nAs is usual for excavation in a Mediterranean urban environment, pottery makes up the overwhelming bulk of the assemblage. This material is remarkable for a large number of regional and imported amphoras, the latter in much smaller amounts, along with numerous stoppers for the regional vessels and a small group of funnels.The pottery is the main focus of this preliminary report.There is, however, also a rich variety of small finds, including a large group of Late Roman to Early Byzantine glass, including cylinder-blown window panes, trail-decorated flasks with funnel- to U-shaped mouths of a type common in the Byzantine to Islamic Middle East, and possible evidence for glassmaking. These diverse and copious finds suggest that the building complex on the Threpsiades property played a role in the movement of regional agricultural products, and perhaps of consumer goods as well, during the very late sixth to early seventh centuries 2 They provide important new evidence for local vitality, long-distance exchange, and dynamic communication in the northeastern Peloponnese during the Early Byzantine period. n nA summary of the work in 1976 by the Archaeological Service work was published in 1984.3 That report noted the presence of many amphoras and provided basic observations about the building and a massive destruction event involving burning and structural collapse. To date, however, no full study has appeared.In 2013 Ms.Kristalli-Votsi transferred her rights to the site and its finds to Joseph Rife, Director of the American Excavations at Kenchreai.All work at the site and on the finds takes place with the permission of Ministry of Culture and the oversight of the Corinthian Ephoreia under the auspices of the American School of Classical Studies at Athens.In May 2014, Sebastian Heath and Phyllis Graham, with the assistance of Gavin Blasdel, began study of the material in the Isthmia Museum. Rife and Jorge Bravo III, Co-Director of the American Excavations at Kenchreai, began comprehensive re-evaluation of the building on the Threpsiades property in June 2014.The results of these new investigations offer a firmer basis for determining the date of activity in the complex than was previously published.4 Moreover, preliminary quantification of amphora rims provides evidence for assessing the role of Early Byzantine Kenchreai in the regional and Eastern Mediterranean economy. The numbers appearing below are drawn from processing of 93 crates of pottery that hold well over 50,000 sherds.Quantification was done in 2014 and study continued in 2015.While this ongoing work is the beginning of a multi-year process that will lead to full publication, we believe that a timely announcement of our research may be useful to readers and that any responses will benefit us as we move toward more complete results. n nThe Site of Kenchreai n nThe port town of Kenchreai lies at the western end of the Saronic Gulf at the point where the shore is easily reached from Corinth, which lies some 10 km inland and to which Kenchreai was connected by road during the Roman era. The long, irregular ridge of Mount Oneion extends inland just south of the site, and the coast immediately to the north has low cliffs that would have made landing and loading or unloading trade-vessels difficult.Between these coastal stretches, the small, curved bay and beachline today provide access to the water, and movement inland is relatively easy.It is this landward topographic aspect that contributed to the placement of Corinth u2019s eastern harbor, a role that Kenchreai may have served throughout antiquity. While Hellenistic and earlier remains at the site are not well preserved, excavations begun in 1963 under the general direction of Robert Scranton of the University of Chicago for the American School revealed the extensive remains of the Roman port.5 Two massive breakwaters erected probably under Augustus facilitated the reception of maritime traffic and sustained seaborne commerce for centuries.The moles defined clear northern and southern limits of the port and turned an exposed landing into a deep, protected harbor with good anchorage and a long quay. n nThe literary testimony for Kenchreai during the Early to Middle Roman periods attests to local prosperity, social, cultural and religious diversity, and a bustling economy. Strabo (Geographies 8.6.22) wrote of Kenchreai that the Corinthians, u201cuse [it] for trade from Asia. u201d Ovid (Tristia 1.10.9) reported that he boarded the vessel Minerva there and then disembarked at Tempyra on the Thracian coast before proceeding on foot to his exile in Tomis.Kenchreai is briefly mentioned in the New Testament, first as an early stopping point in Paul u2019s journey from Corinth to Syria via Ephesus (Acts 18:18) and then as the home of the deaconess Phoebe (Romans 16:1), whom Paul commends to the Roman church. In his brief description of the port-town, the second-century travel writer Pausanias (Description of Greece 2.2.3) mentions sanctuaries and a bronze statue of Poseidon at the harbor.6 Kenchreai is also the setting for the last book of Apuleius u2019 Metamorphoses (Book 11), in which the protagonist Lucius is initiated into the local cult of Isis.These passages illustrate Kenchreai as a well-connected port and a prosperous community during the first and second centuries n nIt was the report of Pausanias and the visible presence of ancient architecture that motivated the start of excavation in 1963. The initial publication of the site aimed to assimilate the extant architectural remains to the temples of Aphrodite and Isis cited by Pausanias, but subsequent scholarship has called these identifications into question, and they are not now widely held.7 The early phase of the American Excavations in the 1960s also uncovered extensive architectural and artifactual evidence for the Roman port u2019s commercial life. More recent fieldwork has focused on the necropolis and residential quarter on the ridge northeast of the harbor.8 n nUrban development continued at Kenchreai during and beyond the third century.The local community witnessed substantial renovation and expansion of the portside structures during the fourth century.In the late fourth century, one or more seismic disasters led to the abandonment and filling of a fountain court on the south mole. This space was temporarily being used for the storage of crates with over 120 glass panels in opus sectile depicting harbors, Nilotic scenes, and cultural celebrities.9 The difficulties indicated by the loss of these panels, however, were not the end of Roman Kenchreai. A church was built on the south mole around the late fifth or early sixth century, and another early church is located roughly 1 km up the coast in the port u2019s northern suburbs. These structures did not stay in use for very long and seem to have fallen into disrepair by the late sixth or early seventh centuries, perhaps around the time of the unknown destruction event at the Threpsiades complex under consideration in this article.The immediate circumstances of Early Byzantine Kenchreai u2019s further decline in the seventh to ninth centuries are unclear, as are the circumstances that lead to a renewal of activity in the Middle Byzantine period. Today the toponym Kechries ( u039a u03b5 u03c7 u03c1 u03b9 u03ad u03c2) refers to a small village lacking any municipal identity or business and consisting largely of weekend and summer homes. n nTowards a Chronology of the Threpsiades Complex n nThe Threspiades property is located ca. 35 meters due west of the mid-southwest part of the modern public beach, which represents roughly the shoreline of the Roman harbor. It is situated at the northwest corner of the intersection of the highway to Epidavros (Ethniki Odos 10) and the road through the village of Kechries (Odos Apostolou Pavlou).10 Although constrained by existing property lines and modern roads, the excavators in 1976 uncovered multiple large rooms flanking wide halls and an ornate peristyle, all enclosed in a trapezoidal arrangement.The building had a second story indicated by a well-built staircase. This spacious plan and its interior decor suggest that the complex was not built solely as a work-space; perhaps its original use was as a lavish private residence or a monumental public building.In any case, it is clear that the building had developed mainly into a work-space in its final phase before abandonment and its gradual burial under colluvial sediment. n nAt the current stage of study, the date of the earliest phase of the building remains uncertain, though either Middle or Late Roman seems most likely. Moreover, while it is clear that the fabric and use of the building were disrupted by a catastrophic destruction, stratigraphic study of the Threpsiades complex has not yet revealed when this destruction happened.Two scenarios seem most likely.In the first, destruction struck the site at some point in the sixth century and damaged the impressive private or public complex, after which point it was reoccupied for more utilitarian or industrial use that ended in the seventh century. In the second, destruction struck the site at some point in the early seventh century and brought an end to the utilitarian or industrial final use of a formerly impressive private or public complex.It is also possible that the area suffered multiple episodes of destruction. n nAlthough a full and precise chronology of the Threpsiades complex remains elusive, current investigation allows the final phase of activity in the building to be assigned confidently to the very late sixth to early seventh centuries. This date is mainly based on red-slipped tablewares. A nearly complete African Red-Slip (ARS) Hayes form 105 (Fig. 3) with no interior stamped decoration gives a strong terminus post quem of 580.11 Another large fragment of a Hayes 105-type base along with similar, less-well preserved base sherds strengthen this chronology, as do small ARS Hayes form 99c rim sherds.In addition, three well-preserved ARS Hayes II lamps with late discus designs are not inconsistent with the ARS table vessels. We have also recorded a Phocaean Red-Slip (PRS) Hayes form 3f of the sixth century, five PRS Hayes form 10c rims (PRS) and nine Hayes form 10a rims (examples illustrated in Fig. 3).12 While the imported tableware assemblage only supports limited precision on the order of decades the ARS does suggest that the deposit closed by the early seventh century.The material from multiple deposits at Corinth published under the rubric u201cAssemblage 4 u201d within a sequence of Late Roman material is relevant here. ARS forms 107 and 109 are present at Corinth but not identified in the Threpsiades assemblage, which can suggest a closing at Kenchreai before 600.13 Among more recently published early seventh-century assemblages, the material from the so-called u201cBishop u2019s House u201d at Nicopolis is a useful parallel, particularly because ARS Hayes form 105 also contributes to establishing its date, as does a coin of the emperor Phocas (602-610).14 Moreover, discussion of the absence from Nicopolis of ARS Hayes form 109, which as noted also does not occur in the Threpsiades complex, further suggests that overly precise dating from ceramic forms is problematic in the face of competing chronologies and uncertain stratigraphy.15 n nCare is warranted in establishing the chronological limits of the total assemblage from the building and in assessing how much of it was associated with the final phase of activity. Some but not all of the original recording system for the stored artifacts is recoverable.There has been mixing of material between plastic storage crates u2014this has proven that the bottoms of such containers break if overloaded u2014and not all tags were readable at first inspection.Furthermore, we stress that the data appearing in this article were collected during an initial survey of the material. Almost all sherds remain unwashed, so that full processing of the assemblage will reveal more detail.Future clearing of spoilage at the site will undoubtedly contribute more evidence to the finds already stored at Isthmia.Finally, it may be possible to assess more exactly the stratigraphic associations of the finds, in which case our understanding of the depositional sequence and the building u2019s chronology may shift. n nDespite these concerns, we can now characterize certain basic features of the assemblage. It displays a striking degree of consistency.As will be discussed below, the regionally produced Late Roman Amphora 2 (LRA2) predominates.Except for a small number of Hellenistic and perhaps earlier sherds and a small number of Early and Middle Roman sherds, we agree with the original excavator that much of this material is associated with the final phase of occupation.Thus, as this important group of pottery is studied and further cited, it should be kept in mind that it may include a small but uncertain number of sherds that predate Late Antiquity. These would affect the accuracy of any quantification of sherds dated to the late sixth and early seventh centuries. n nPreliminary Quantification of Amphoras n nLate Roman transport amphoras form the most abundant component of the ceramic record in the Threpsiades complex.Preliminary quantification (fig. 4) of 501 rims from the well-known series of Late Roman Amphoras 1 through 56 provides a firm basis for situating Kenchreai in both regional and Eastern Mediterranean economic networks.16 It is the case, however, that essentially all the quantification undertaken at this stage of study has been by rim counts. In his review of quantification methods, Pe u00f1a described such data as u201cnot statistically valid. u201d17 While recognizing the shortcomings of this approach, we do believe that the overall impression offered by Figure 4 and Table 1 is useful in discussing the relative amounts of these amphoras present in the complex during Late Antiquity.Moreover, the first two seasons of work have identified amphora forms other than these most widely recognized ones, which will be briefly discussed below. n nType Count Percent Origin LRA2 361 72.1 Aegean LRA1 51 10.2 CiliciaCyprus LRA5 46 9.2 Palestine LRA4 39 7.8 PalestineGaza LRA3 4 0.8 SW Anatolia n nLarge and Small Late Roman Amphora 2 n nThe round-bodied, high-necked form Late Roman Amphora 2 makes up approximately 72% of the rim count at the Threpsiades site.18 Slane and Sanders have appropriately warned against simplistic usage of this term and we intend it here in a very generic sense.19 As they note, multiple Aegean regions produced this form, a point reinforced by Reynolds u2019 analysis of assemblages at Beirut and Butrint as well as by other studies.20 In the context of this article it is important that the Argolid, which is linked to Kenchreai over the mountainous passes of the southeastern Corinthia, is recognized as a major producer of LRA2 vessels. A kiln-site producing the form near Porto Cheli in the southern Argolid is dated by the presence of ARS, PRS and a coin of the emperor Phocas (602-610).21 That region u2019s workshops produced vessels with an identifiable pinkish fabric and a beige surface.22 The fabric of many of the LRA2 rims, other diagnostics, and body sherds from the Threpsiades excavations is likely of or closely related to this Argolid variety, which has also been identified at Corinth. A further indication that Kenchreai is within one of the multiple active regions of LRA2 production and use comes from the Eastern Korinthia Archaeological Survey (EKAS), whose members recognized that combed body sherds were among the most abundant Late Roman artifact categories.23 When one considers LRA2 broadly, the recent publication of kilns at Dilesi in Boeotia adds to the increasing firm evidence that production was widespread.24 n nThere is diversity among the LRA2 vessels from the Threpsiades complex. Among those rims measured, we have noted a range of maximum exterior diameters of 9-12 cm.Very large vessels have rim heights just over 5 cm and neck heights just over 9 cm.Rim heights of less massively constructed LRA2 vessels are just under 4 cm but the neck height remains around 9 cm.The rims on the largest vessels are often slightly offset from the neck.We have not refit body sherds, but we note the predominance of deep wavy combing. It is of interest that some LRA2 body sherds bear black characters or symbols.These markings are distinct from the red dipinti that are not uncommon on LRA2 vessels.These preliminary observations suggest directions for future study.In sum, the Threpsiades group of LRA2 amphoras is large enough to encompass differences, but those differences fall within a range that is well-known for the form.25 n nIn addition to the many typical LRA2 amphora rims, we counted 222 rim sherds of distinctly smaller vessels. Figure 5 shows a comparison of the rim and neck profiles of the full-sized or u201clarge u201d and u201csmall u201d types.The smaller version has a less substantial rim that is of more even thickness, and there is often a distinct exterior demarcation as neck turns to rim.The distinction is subtle, presumably because the smaller version was very closely inspired by the larger, but familiarity makes the differences discernible, even between small rim and handle sherds. Further study may show that the u201cLRA2 Small u201d form is best considered a fractional container, meaning that it was produced at a regular and measured proportion of its larger mate.26 n nBeyond Kenchreai, smaller variants of LRA2 are known from Argos, Corinth and Pyrgouthi, among other sites.27 An approximate parallel for the small Threpsiades vessels appears in the late-sixth-century u201cAssemblage 3 u201d at Corinth, which consists mostly of material from an underground chamber near the Baths of Aphrodite; the rim of that vessel appears thicker than ours in the published profile.28 There is an unpublished parallel at Athens, which is illustrated in an excavation notebook that the Agora Excavations makes available online.29 The Sikyon Survey Project has also published an LRA2 rim of small dimension. Other published profiles of smaller LRA2 vessels do not appear to be very close matches.30 A category of u201cLRA2-related u201d so-called amphorette known from Dichin, Bulgaria is very different.31 This brief survey may be enough to suggest that the Kenchreai u201cLRA2 Small u201d vessels and related forms are an LRA2 companion whose distribution far outside the Corinthia and nearby regions may be limited. At Kenchreai the form presumably had a role in surplus-oriented economic activities.At this early stage of study, however, we stress that the exact use of these small containers is unclear, and indeed they may have had multiple uses."
}