{
  "articleId": "isaw_paper19",
  "text": "ARTICLE_ID: isaw_paper19\nAbstract: Despite his later prominence in the Coptic Orthodox Church, it is hard to see clearly the position of the abbot Shenoute of Atripe in his own time and the following century. His own name is virtually unknown before him, and it is rare in the papyri in the century following his death (generally said to be 465 ce), with most instances in areas near his monastery. It is suggested that its later popularity is the result of Shenoute's importance to the non-Chalcedonian church as it developed a full structure in the later sixth century, particularly under Pope Damian. The name of the famous abbot of the White Monastery federation has acquired a certain familiarity, even fame, among those who work on Late Antique Egypt as well as in the Coptic Orthodox Church. It seems at first glance to be almost ubiquitous; it occurs commonly in documents in Coptic and Greek (mostly as Senouthios or Sinouthios, with various endings) from the late sixth to eighth centuries (a total of 894 attestations of all periods in Trismegistos Names) and has had a long posterity in the Coptic community of Egypt, where Shenoute has been venerated as one of the great figures of Egyptian monasticism and popes have borne his name.1 It is for this reason easy to lose sight of its rarity before the time of the archimandrite and, even more, the peculiar character of its chronological and geographical distribution after his life.2 These observations are not, I shall hope to show, mere curiosities without real interest for Shenoute as an historical figure and, even more, a posthumous figure of veneration, but rather markers of important aspects of his origins and later fame. At first glance, “rarity” might seem an inappropriate term for the name before Shenoute’s lifetime. There are twenty-three attestations that do or could date before the period of Shenoute’s visible ministry, according to TM Names.3 But this number turns out to be a mirage on closer examination. Six of them do not in fact contain this masculine name, and a seventh is very insecure: P.Kellis Copt. 1.19 (two uses), 26, and 48 in fact have the feminine Coptic name Tjemnoute (the initial tu is lacking in 48). O.Stras. 1.564.8 reads not Σενούθου but Σενμούθου; the error is in the Duke Databank of Documentary Papyri, TM’s source. P.Vind.Bosw. 15.7 was reread by P. J. Sijpesteijn (BL 8.197), and Σενουθίου vanished in favor of Ταπινούτιος. SB 20.14783, a graffito at Shams-ed-Din (Mounesis) was read by Wagner with considerable doubt (he took it as a feminine name, cf. below), and it cannot be verified on the photograph in the editio princeps. Of the remainder, eleven are assigned to vast spans of years and almost certainly belong to the sixth century or later, certainly not before the later fifth century: SB 1.4859 and 1.4936, two “Byzantine” fragments in the Louvre, likely to be late like most of their companions. SB 1.2072, a ceramic disk commemorating St. Senouthis, certainly from after the archimandrite’s death but undatable. O.Edfou 2.316.15, which belongs to the seventh century at earliest. SB 16.12525.29, “comptes byzantins” no doubt belonging no earlier than the middle of the fifth century, as the names suggest. SPP 8.1178, of which the editor’s date of fifth-sixth century is certainly too early; as Jean Gascou points out in a note, the signer is the same as in P.Pintaudi 27.7, of the later seventh or early eighth century. BKU 3.2.430.1, an undated Coptic text. P.Prag. 2.139r.i.12, a Hermopolite text dated to the fifth century by the editor, and of which the hand looks later rather than earlier. CPR 7.23, a somewhat uncertain reading and in any case certainly of the later fifth century or of the sixth. CPR 9.56.24, again of the fifth/sixth century. SB 1.4622, an undated graffito from Kalabsha. There are two early instances to be considered: Oslo 6 conv. 2, from the Fayyum, dated to the first century by the editor, who reads Σενοῦθ̣ις. Although this is not impossible, on a photo kindly provided by Jens Mangerud I would prefer omega in place of ου. Theta, dotted by Amundsen, is possible but not inescapable. 7 (Philadelphia). On the online image this seems plausible if not certain. Princ. 10 col. 17, dated AD 34, reading Σενουθ( ) as the patronymic of one Melankomas. On a photo kindly provided by Don C. Skemer, it is clear that this reading is not correct. The visible traces appear rather to be ρμουθ, with the theta raised. There is space before this where one or a few letters could have stood but are now effaced. 4 In any event, this cannot be considered a good attestation of Senouthis. , 300-465), there appear to be (other than the archimandrite himself) exactly two datable male individuals known bearing the name Senouthios/Sinouthios. But one of these also turns out to be doubtful. Oxy. 4090). At first glance, the name seems free of doubt: Σινούθιος. But a look at the online image shows that above the last two letters are two letters not noted in the edition, ων. Taking those into account, it would seem that an ending in θιωνος was the writer’s final intention. At the same time, the initial sigma is not free of difficulty, and what was read as upsilon before it could instead be the start of a pi. As it happens, the only attested name in –ινουθιων is Πινουθίων, evidently a variant of the very common Πινουτίων, a name extremely well known from the Hermpolite and from Aphrodito. Taking all of this into account, it seems unwise to take this papyrus as evidence for an early attestation of Sinouthios. Aurelius Sinouthes son of Victor, from Hermopolis, a rower in the state galley of the praeses of the Thebaid, who is known from a group of documents from ca. Grenf. 80, 81, 81a, and 82. The last two of these do not appear in TM Names, because the name is there spelled Σενν- and was mistakenly classified under the feminine Senpnouthes. 1018, Thebes, 129 BCE. 4190, a mummy label from Bompae in the Panopolite, dated ca. 5 The multiple attestations make this Sinouthes unimpeachable. It is the first such. Unfortunately, the names of Shenoute’s mother and father are not preserved in the hagiographic and biographical tradition known as the Life by Besa. , but listed in TM Names as Pkol (Πκωλ). This name, unlike Senouthios, is well known in Demotic (Pȝ-gyl), and the DNB renders it (p. 279) as “Der Fremde.” Its typical Greek form is Πκῦλις. This name is well attested in a number of regions of Egypt in the period down to 300, including some five mummy labels from Panopolite cemeteries. But Pkylis in the period after 300 is overwhelmingly Hermopolite (40 of 49 examples in a DDbDP search for after 300, 9 of 11 between 300 and 500), and none of the examples come from the Panopolite, Shenoute’s supposed origin. What are the implications of all of this information? First, Senouthios/Senouthes or Sinouthios/Sinouthes as a masculine name was extremely rare before the abbot: indeed, there are no instances at all before him, even before his adulthood. That fact should encourage us to see the giving of this name to children after his lifetime as an indicator of posthumous veneration, as there is no other obvious channel by which the name would have become popular. Second, one might hazard a suggestion that Shenoute’s family originated in the Hermopolite nome and were newcomers in the Panopolite; or, to be more specific, that at least his mother’s family were from the Hermopolite. To be sure, this proposal rests, in the case of Shenoute’s name, on only one case, but this is the totality of our evidence for the name from the fourth and first half of the fifth century, and probably all of our evidence for any period before Shenoute’s lifetime; and in the case of his maternal uncle’s name, on the preponderance of a larger body of evidence. Perhaps “the outsider” was not a bad name for Pkol or for Shenoute. Could his famously difficult relationship with Panopolis have some connection to this status? More complex is the question of Shenoute’s reputation as a holy man outside his monastic federation during and after his life. 8 This onomastic evidence is of interest in light of the fact that the Monastery of Shenoute owned land in Aphrodito. Aphrodito is only about 45 km northwest from Sohag, and on the same side of the Nile, so these strong connections in the immediate vicinity are not very surprising and are unlikely to be coincidental. Attestations known from the early to middle sixth century for Antinoopolis also come from the archive of Dioskoros, who spent a number of years in the provincial capital. Only after the middle of the sixth century do we start to get any evidence from elsewhere: the Hermopolite (BGU 19.2810, of 559/560, is the first, followed by P.Grenf. 2.80 in 596), about 180 km distant, and Shenoute’s home base, the Panopolite (P.Cair.Masp. 2.67170, of 562-564—from the archive of Dioskoros, perhaps not coincidentally). And it is not until the last decade of the century that we get the first Oxyrhynchite references (P.Amh. 2.150 and P.Münch. 3.98, of 592-594, the same man’s patronymic), at a distance of 270 km. Also from 592 comes the first reference from This, one of the closest neighboring cities at only 34 km distance from Sohag (P.Paris 21bis). This is still a tiny number of attestations securely datable to the sixth century, and none of them come from as well documented a nome as the Arsinoite. It is true that there are a number of attestations of the name in documents dated more vaguely to the sixth/seventh century, some of which may belong to the later part of the sixth century, but none of them offer any particular reason to date them that early. Overwhelmingly, the evidence of Greek documents for the name comes from the seventh century or even later. This is true, for example, in the Memphite, Herakleopolite, and Antinoite nomes, at Apollonopolis Heptakomia and Apollonopolis Magna, and in the Theban region.9 Even more striking, in some ways, is the small number from the nomes nearer the monastery from which there is the sixth-century evidence already mentioned. Some of these nomes have relatively few published texts, it is true, but this cannot be said of the Hermopolite. It is noteworthy that P.Lond.Herm. (sixth century) has no examples of the name, and even in the early seventh century tax register P.Sorb. 2.69 there are only three instances, one of them an Antinoite (54A5).10 The lack of precise, or even approximate, dates assigned to Coptic documents makes it impossible to control the picture that emerges from the Greek documents by using Coptic evidence. None of it is dated with any confidence before the seventh century except a few instances from Aphrodito. If we step away from the chronological question, however, the Coptic evidence shows later popularity of the name in the Arsinoite (where we hear in a Greek letter of a relic from Shenoute’s clothing sent from the White Monastery to an Arsinoite women’s monastery to try to heal a case of demonic possession11) and Hermopolite, along with Djeme and the Theban region generally. Obviously the popularity of the name in the seventh and eighth centuries was widespread and strong. But in the sixth century it was not nearly so great, and it was very localized. The cult of Shenoute was far from instant and took time to spread.12 This lack of early attestations of the name presents a strikingly different picture from the general popularity of saints’ names in the papyri from the middle of the fifth century on.13 The very limited evidence outside the White Monastery federation for knowledge of Shenoute’s works and of the hagiographical tradition attributed to Besa is also relevant here. ”16 It is dated by Heike Behlmer to the seventh century or at the earliest to the latter part of the sixth. The third is a trilingual liturgical codex on paper, with Coptic, Greek and Arabic, and thus clearly from after the conquest. These three give us no clear evidence for any dissemination of Shenoute’s works outside the immediate region of his monastery, nor any wider distribution earlier than the seventh century. ”18 Moses of Abydos (late fifth or first half of the sixth century) is the earliest and the source of three of the seven quotations that Emmel lists. Abydos is just 51 km from Sohag, one of its nearest important neighbors. The other quoters are Constantine, bishop of Lykopolis in the late sixth-early seventh century (110 km); John, bishop of Hermopolis in the late sixth century; Moses, a seventh-century bishop of Coptos (165 km following the river); and Stephen, bishop of Herakleopolis Magna in the sixth century. Only Stephen was at any great distance from the White Monastery. The situation with the corpus attributed to Besa is not much different. Of six manuscripts recorded in Trismegistos (LDAB), five come from the White Monastery, and the sixth (TM 108115; Vienna, K9323), of unknown provenance, is dated to the ninth-tenth century.19 There is thus no evidence for any early dissemination of the hagiographic tradition outside Shenoute’s home base, however likely such spreading of the word may otherwise be. Slightly more informative, perhaps, are the ostraka with excerpts from Shenoute’s works found in monasteries on the West Bank at Thebes.20 A couple of these lack provenance, but the majority come from the Monastery of Epiphanius, and one now from the Monastery of Cyriacus (TM 118678). Like the bulk of the ostraka from the region of Jeme, they are dated to the end of the sixth or early seventh century. 21 I turn now to a pair of much more speculative suggestions. The first is founded on the prominence of Shenoute’s name and monastery in the life of Aphrodito already in the second quarter of the sixth century. ”22 As she also noted, “It is indicative of something—of the nature of our evidence, if little else—that it is hard for the scholar to reconstruct Dioscorus’s personal piety. ” The juxtaposition of these two remarks is suggestive, and when one considers Aphrodito’s unique position in the documentation for the use of Shenoute’s name in the first half of the sixth century, it is hard to escape a suspicion that Shenoute’s posthumous grip on Aphrodito is related to a local predominance, and certainly a preference in Dioskoros’s own family, for the non-Chalcedonian side that Shenoute himself favored as a staunch supporter of Egypt’s patriarchs. That leads to an attempt to explain why it is only at the end of the sixth or even the start of the seventh century that we begin to see the name Senouthios appear more commonly and find his works being cited. I start from a perceptive remark of Heike Behlmer: The consolidation of the less formalized visits and pilgrimages of Late Antiquity into a more rigid scheme is shown in a manuscript from the Late Middle Ages, which describes a procession undertaken by the monks and the people of Akhmim. Even in its heyday, though, the White Monastery did not become the object of pilgrimage tourism from abroad or, like Abu Mena, of imperial patronage. . . . Rather, it remained well into the late Middle Ages a center of monophysite spirituality and learning, until the monastery fell into ruins and only the church remained.24 She points out in a note (367 n. 135) that “the White Monastery is not mentioned in any work of the ample Byzantine travel literature.” 26 As Stephen Emmel has pointed out (2008: 35-36), the title of this work in the only complete Coptic manuscript is “A few of the miracles and marvels which God effected through our holy father the prophet Shenoute, the priest and archimandrite, which the holy Apa Besa, his disciple, witnessed.” Its popularity, and that of Shenoute himself, may be the result of a deliberate attempt to valorize Shenoute as an opponent of the Chalcedonian church in the last quarter of the sixth century rather than any earlier circulation. The ostraka from the West Bank fit well into such a hypothesis. During exactly the period of their production, the non-Chalcedonian bishop of Hermonthis, Abraham, was resident in the nearby Monastery of Phoibammon. It would hardly be surprising if local abbots of desert monasteries in his vicinity encouraged their monks to copy and learn excerpts from Shenoute, if the non-Chalcedonian hierarchy was in fact using him as I have suggested.⬈ There is thus a certain appropriateness in the fact that one of the men named Senouthios who appear in the Hermopolite tax codex (P.Sorb. 2.69) is named Senouthios son of Damianos. Senouthios, not as the historical monk, but as the figure of veneration known today, is indeed in some real sense the offspring of Damianos and of the needs of the non-Chalcedonian hierarchy that he was engaged in building."
}