{
  "articleId": "isaw_paper13",
  "text": "ARTICLE_ID: isaw_paper13\nAn Overview of the numismatic evidence from imperial Roman Africa.ISAW Papers 13 (2018),Daniel Hoyer This article describes a database of 50,970 coins from the Roman Empire minted in the 'high' imperial period (23 BCE-275 CE). It includes mainly coins found in the regions that were part of imperial Rome's African provinces, with some material from Western Europe for comparative purposes.This database represents data culled from numerous sources and previous publications, representing one of the largest single collections of numismatic material from Roman Africa during this period currently available; though it is by no means exhaustive, and further research is needed to supplement the present project. I present here an overview and some notes on the quantification of this material, highlighting the most prominent and interesting patterns. This quantification suggests certain interpretations concerning key topics in the monetary history of the western Empire, which I point to briefly.Further, the complete dataset is provided for download as both a csv file and a more structured data file (JSON file) to facilitate future research on Roman Africa's numismatic record as well as related information.My intention is, thus, both to advance the study of Africa's numismatic heritage in general as well as to contribute to the available corpus of accessible, digital information concerning the ancient world. n nLibrary of Congress Subjects: Numismatics, Roman; Economic History--to 500. n nContents n nIntroduction n nConstructing the Database of African Coins n nPrevious scholarship on the numismatics record of Roman Africa n nThe Data: Quantitative Overview n nWhat Does Africa's Numismatic Record Reveal About Rome's Monetary System? n nConclusion n nAppendix: Sources of Numismatic Data n nAppendix: Links to Downloadable Data n nNotes n nBibliography n nIntroduction n nThis article presents a summary, overview, and quantification of a large sample of numismatic material from Roman Africa u2014 modern day Morocco, Algeria, Tunisia, and Libya u2014 during the high imperial period. This includes any type of coin found in the region, whether in a hoard, through an archaeological excavation, or as a stray find, minted anywhere in the Roman world (though the vast majority were minted at Rome) between the years 23 BCE and 275 CE.Africa is one of the richest regions of the Roman Empire in terms of its archaeological heritage, including of course coinage.My purpose in writing this article and offering the database in digital format are twofold: firstly, no systematic summary or overview of the coinage from Roman African currently exists, despite the region being one of the largest and most prosperous areas of the Empire and having been subject to many years of study by some of the world's leading numismatists. The overview, elucidation, and interpretation of the material offered here is meant to contribute to the study of Roman numismatics generally as well Roman economic history and the history of North Africa.My second goal is to supply a digital record of the complete database on which this overview is based in a structured, accessible, stable, and reusable way. n nA crucial part of making this material useful for other scholars is providing ready access to the data. An open digital publication ISAW Papers, provides the most suitable venue for such an effort.Admittedly, offering the complete dataset for public consumption in this way is perhaps a bit unusual for a scholarly article dealing with ancient material evidence.Scholars in Classics and the Humanities generally, however, are coming more and more to appreciate the opportunities afforded by digital technologies for enhancing and aiding academic research. In particular, digital datasets and a linked data approach are being increasingly utilized not merely as a means of presenting an argument, but as an indispensible tool in the gathering, organization, and interpretation of evidence.1 In order to reap the full rewards of this 'digital revolution', though, it is essential for scholars to share their data in an open, accessible, and structured way.The database appended to this article will, I hope, contribute in a small way to this overall project. n nIn the next section, I explain how the database was constructed and what is, and is not, included. I then provide a brief, general discussion of previous scholarship on coinage from Roman Africa, outlining some of the problems one encounters trying to gather together evidence from scattered sources. I next provide a quantitative analysis of the numismatic material. This allows me to point out the most salient patterns and peculiarities displayed by the material, concentrating on the material from Africa itself, but bringing in evidence from other regions by way of providing context to explain the African data.Then, I offer some interpretations about these patterns. I explore how this material can elucidate the Roman monetary system and the production, distribution, and use of both small and large denomination coins. Essentially, I argue that Roman Africa featured a robust monetized economy reflected in the numismatic record from the region.More importantly, I suggest further that the broader economic, political, and military history of the region suggests that coinage was coming into the area primarily for the use of the region u2019s inhabitants, as opposed to being principally the result of spending by the state.2 Finally, I conclude by summarizing the key points brought up in the earlier sections before ending the article pointing out the benefits and, indeed, importance of providing access to the complete dataset in a digital publication such as ISAW Papers. n nConstructing the Database of African Coins n nIn all, the database consists of 50,970 coins plus associated information, including each coin's denomination, its metal, find-spot, mint date, weight (where that information was available), and find context (namely, whether it came from a secure hoard or as a stray find, as from an archaeological excavation). It also includes the name of the Roman province corresponding to the modern-day find spot for coins found in North Africa (though, for simplicity's sake, not for coins found in Europe).These coins were all minted by Roman authorities, mainly the legitimate rulers of the Roman state but including also coins minted by rival claimants to legitimate power such as the rulers of the so-called Gallic Empire. I have not included coins which have been positively identified as ancient imitations, although this is an interesting topic which deserves some treatment.3 The majority of the coins come from the territory of Roman Africa (35,559), but I include also a smaller number of coins from Europe: the Gallic provinces (13,587), and small numbers from Spain (1,207) and Britain (617).4 The non-African material is included for comparison and to provide some context for discussion of the patterns revealed by simple analyses of the African evidence. In compiling this database, I chose to focus on coins minted before 275 CE, the date of Aurelian u2019s defeat of the last rulers of the breakaway Gallic Empire.Aurelian u2019s victory was followed by a reunification of the territory in the northwestern Empire as well as the beginnings of a radical overhaul of Rome u2019s monetary policy, culminating in Diocletian u2019s reign at the beginning of the fourth century. Certainly the events of the fourth and fifth centuries CE are very interesting in their own right and many of the developments of Late Antiquity have their origins in the events of the third century.It is, though, beyond the scope of this work to investigate this later period. n nThe African material in the database is the result of a detailed survey of the available records (I list sources of this information in the Appendix). This work was conducted primarily at the American Numismatic Society, supplemented with a stint at the Cabinet des M u00e9dailles in the Biblioth u00e8que nationale de France in Paris; two of the largest collections of numismatic resources in the world.My primary goal was to survey the numismatic record from Roman Africa in support of broader arguments about the Roman economy.The resulting database has supported analyses presented in several publications.5 I offer the full database here in order to facilitate continued investigation into Roman Africa's rich numismatic record, saving scholars from having to reduplicate such labor-intensive effort in the future. My hope is that the database will continue to grow, as scholars with access to records I was not able to find supplement the database, or as new discoveries are made and added to the list; the more that we present the fruits of our labour to the scholarly community through open, digital publication of data, the more we all benefit from the collective effort. n nIn building the database, I relied on the excellent tradition of numismatic research concerning Roman Africa. Although no single collection of coins found in the region has previously been attempted, there has been a great deal of work in the past on particular finds or on sites that have produced coins.Many impressive numismatic studies have been produced in recent decades by local Moroccan, Algerian, Tunisian, and Libyan scholars as well as by European numismatists.The majority of Roman coins that have been uncovered in North Africa, however, were discovered and published in the nineteenth or early twentieth centuries, largely by French scholars working in what was at the time French colonial territory in Tunisia and Algeria. Unfortunately, the publication of this material is not as complete or detailed as desired, or as informative as would be demanded of a modern scholar.This issue, in fact, plagues work on the ancient world generally.The importance of this is that many of the Roman coins discovered in Africa before about the 1970s are recorded without a full, detailed catalogue and feature only cursory information about denomination, type, find-spot, mint location, and minting date. n nAnother, related issue is that many of the coins discovered in the region before the middle of the twentieth century have dispersed, sometimes with no clear record of where the coins actually ended up, or at least have become unavailable for scholarly study for a variety of reasons. Much ancient material, including Roman-era coinage, was allowed to leave the region, some of which ended up in museum holdings, but which mostly ended up in the hands of private owners.The result of all this is the frustrating situation that many finds of Roman-era coinage are known as they are mentioned in various archaeological reports from the region, but they are described in only vague terms often without detail even on the exact number of coins which were found, making it very difficult to perform any usable analysis on the material. n nAs it stands, the database offered here represents the most comprehensive single collection of numismatic data concerning coins found in Roman Africa published to date. It is, however, by no means an exhaustive or completely comprehensive set of Africa's numismatic record.There are certainly gaps, as I was not able to access all published material, due to records being lost, or simply a lack of the resources needed to track down rare material in far-flung collections.This is particularly problematic with coins found in excavations, as certain excavation reports I have simply not been able to track down, while other excavation reports (particularly those conducted prior to the 1970s) do not provide sufficient details on the coins found. The database I provide here, therefore, should be considered provisional and always a work-in-progress; I will consider this project a success only if work continues on this important topic and the database is supplemented in the future. n nThe only resource that provides detailed information about individual coins are lists of specific hoards or archaeological reports cataloging the numismatic finds. These resources are invaluable to any attempt at reaching generalizations or interregional analysis, yet it is extremely difficult and time-consuming to track down all of the information scattered across so many different publications held in libraries across the globe and written in several different languages.This is why I am eager to provide the complete database that I was able to assemble over the course of years of research; my primary intention is to free up future scholars from having to repeat these efforts, allowing them instead to concentrate on combining this material with other evidence and analyzing the data to reach novel conclusions. n nFurther, I am only concerned here with Roman coins produced between 23 BCE and 275 CE. There was a rich numismatic tradition in the region during the Punic period as well as with the Numidian kingdoms before the reorganization of the region into Roman provinces under Augustus as well as into the later antique period after Diocletian's reforms; each of these developments deserves its own study, so I do not treat that material here.6 Within these limits, this article and the appended database represents an attempt to present in straightforward and systematic fashion a synthetic overview of available numismatic evidence through quantitative survey and to provide complete, open access to the data. n nSuch synthetic analysis is, unfortunately, somewhat rare in ancient numismatic scholarship, not including general typological surveys such as the Roman Provincial Coinage volumes.7 There are several very informative and learned general studies of Roman numismatics, but these do not provide comprehensive detail about the material being analyzed.8 Pierre Salama, one of the most prolific scholars working on the numismatic history of North Africa, has in recent years attempted to provide something like an overview of Roman coin-finds from the region.9 These articles provide a list of all known finds of Roman coinage in the region, concentrating on the hoard finds. These are invaluable and much needed works, although Salama is not interested in providing a detailed synthesis of the information provided by the numismatic material.Similarly, Georges Depeyrot in 2011 posted online an unpublished article10 containing the provisional findings of a project on the monetary history of North Africa begun in 2010 which, in his words, u201c u00e9tait de faire conna u00eetre et d' u00e9tudier les d u00e9couvertes mon u00e9taires dans cette region [was meant to make a report and study of the coin finds from that region]. u201d The impetus for the project was, clearly, his observation that no systematic treatment of the African material had been completed and his hope that future researchers will pick up where he left off and see the project to completion. The work presented here takes up this challenge. n nPrevious scholarship on the numismatics record of Roman Africa n nRoman Africa is a large and diverse region.At its core was the province of Africa Proconsularis , centered on modern-day Tunisia (and the ancient capital of Carthage, roughly modern Tunis) and including parts of what today is Algeria and Libya.The region enjoyed a relatively high degree of productivity and stability, even during the later half of the third century CE when the rest of the western Empire was experiencing a wave of crises (I explain this more below).11 Proconsularis in particular is considered one of the wealthiest regions of the Empire, and was certainly one of the most highly urbanized and economically productive. Though the other provinces u2014Numidia, Mauretania Caesariensis, Mauretania Tingitana u2014were also fairly productive. n nThe conditions and causes of economic expansion in the early years of the Empire have been dealt with at length in previous works,12 and I will not rehash these arguments here.Suffice it to note that Africa, and especially parts of Proconsularis and Numidia, featured extremely productive agricultural land. Integration into the imperial economy allowed wealthy landowners in the region to take advantage of markets for agricultural produce in Rome, as well as other parts of Italy, Carthage, and elsewhere.Favorable institutions allowed these wealthy Romans to accumulate large tracts of land, taking advantage of scale factors in expanding production of agricultural produce and manufactures, and provided less well-off property owners and tenant farmers the opportunities to contribute to the regional economy as well. Through the first two centuries CE, Africa experienced an economic boom.This boom was built largely on the production and distribution of wheat and olive oil, two of the Roman world's most important and sought-after consumer goods.Countless studies have exposed the archaeological remains of this productivity: showing ceramic material involved in hauling oil,13 uncovering the processing facilities used to press the olives as well as thrash wheat and produce other goods (fish-sauce, clothing dyes, and other items),14 and revealing improvements made to the region's port facilities to aid in the transport and distribution of these goods.15 All of this productive capacity grew on the back of investments made into the region's infrastructure, providing the impetus for a great deal of urban growth Proconsularis and Numidia especially. n nUnfortunately, despite the great tradition of scholarship into the African economy and specifically on the region's material remains, little attention has been paid to the numismatic record. Yet, I would argue that coins hold great promise in elucidating how the African economy functioned, much the same as studies of the region's ceramic material have revealed so much about the importance of olive oil in the region's economic boom.Exactly what types of coins were circulating in the region at different times?How many coins were there, and what does that tell us about the regions' economic functioning? How were these coins being used?Do the numismatics accord with the indications from other material, such as ceramics, epigraphic evidence, or even the literary record?Are there significant differences between the different African provinces in terms of coin use and availability?How does the African experience compare with other parts of the western Empire?Does the numismatic evidence help to explain larger economic dynamics in the western Empire over the course of the imperial period? n nAll of these questions are critical to advance our understanding of the region and of the Roman economy generally. Answering them requires bringing together and cataloguing that as many of the imperial Roman coins found in Africa as possible, so that future scholars working on a variety of inter-related issues can assess patterns and reach reasonable conclusions based on the empirical record.This article, and the accompanying database, is an attempt at starting such a dialogue. n nThe Data: Quantitative Overview n nFor each coin included in the database, I recorded information concerning the find-spot where the coin was discovered including the corresponding Roman province (for the African material only), the context of the find (hoard or site find), the denomination of the coin, the weight, date and place it was minted, and an estimate of how long the coin spent in circulation when it came from a hoard.16 Not every coin was able to provide data for all categories, but all of the information that I was able to capture is provided in the database appended to this article. Moreover, there is sufficient data here to support quantitative analysis and some interesting insights about the monetary history of North Africa in the first three centuries CE.In this section, I provide a fairly detailed overview of the data, highlighting the most significant patterns that emerge from a quantification of the full body of numismatic material from the region. I focus on four categories for this quantitative analysis: denominational, regional, chronological, and contextual patterns. n na) Denominational Patterns n nI was able to capture information on 33,514 coins minted in the high imperial period which were discovered somewhere in North Africa; 32,357 from various hoards and 1,157 from archaeological stray or site finds (including the 'main' imperial denominations and exclude clear imitations). A breakdown of the number of coins by denomination and type of find is presented in Table 1. As can be seen, the majority (20,037; 60%) of the coins found are antoniniani, an important and interesting feature that I discuss in detail below.Bronze sestertii make up the next-largest denomination group (8,214; 25%), followed by the silver denarius (4,738; 14%) and then lower denomination bronze fractional coinage, including the as, dupondius, quadrans, and small unidentified bronze coins recovered from excavations at about 1.45%, along with a handful (39; <1%) of the highest value currency of the era, the gold aureus. n nDenomination Hoard Site Find Total % of Total antoninianus 19665 372 20037 60 as 4 215 219 1 aureus 38 1 39 <1 denarius 4603 135 4738 14 dupondius 1 69 70 <1 dupondius/as 1 u00f8 1 <1 quadrans 1 10 10 <1 sestertius 8045 169 8214 25 unidentifiable bronze u00f8 186 186 <1 Total 32357 1157 33514 n nThe antoninianus was a substantially overvalued billon coinage first introduced by Caracalla, then briefly abandoned before being reintroduced probably in 235 CE.17 The coinage seems to have been tariffed at 2 denarii,18 although the coin u2019s intrinsic, metallic value was significantly less, since it contained initially only about 1.5 times the amount of silver as was in the denarius. After its reintroduction, the antoninianus quickly became the most frequently appearing coinage in finds from the mid- and late-third century throughout the western Empire. I will come back to this point in the interpretation section, but for now it is useful to separate the antoniniani found in Africa from the other coins.For, the 230s CE represent a transitional time between the stable, tri-metallic monetary system (namely, coins minted in gold, silver, and bronze) in effect for most of the imperial period and the reformed coinage of the late third century CE. n nNot including antoniniani, there are 13,477 imperial coins known from North Africa from the period under consideration here. This can be elucidated further: if only coins minted before 235 CE are included, this leaves 7,985 coins (Table 2).All but 15 of these coins come from the mint at Rome.19 235 CE is chosen as this is the likely date that antoniniani were reintroduced and certainly when they begin to appear in great numbers.The extremely high numbers of antoniniani which were minted between roughly 235 and 275 CE altered the landscape of imperial coinage, although other denominations were still being minted until Aurelian u2019s and Diocletian u2019s reforms. It is also worth pointing out here that less than 8,000 coins found in hoards or as site finds is not a very large quantity from a study area that includes the entire region of North Africa, comprising four Roman provinces, and covers a period of 249 years, 23 BCE to 235 CE.It is notable that roughly the same number of coins from Gaul during this same period are included in the database, although as I discuss here I did not make as exhaustive a survey of the Gallic material as with the African, meaning that it is likely that Gaul actually has left significantly more coins than this in the archaeological record. n nDenomination Hoard Site Find Total % of Total antoninianus 12 10 22 <1 as 4 208 212 3 aureus 38 1 39 <1 denarius 3428 134 3562 45 dupondius 1 69 70 <1 dupondius/as 1 u00f8 1 <1 quadrans u00f8 10 10 <1 sestertius 3753 134 3887 49 unidentifiable bronze u00f8 182 182 2 Total 7237 748 7985 n nSomewhat ironically, North Africa's stability and prosperity during the imperial period may actually be one of the primary reasons that it has left relatively few coins compared to other regions. This is because coins are available to be studied by modern scholars when the coin is lost or buried in antiquity and never recovered.Coins certainly do represent a snap-shot of the monetary economy of the area in which they are recovered, but it is a somewhat skewed picture.Coins left unrecovered u2014in the ground, waiting to be found and studied u2014tend to either be of very low quality/value (essentially 'discarded' or lost), or hoards of coins buried together and, for a variety of reasons, never dug up again. The chief reason that ancient hoards went un-collected is that the people who buried it moved away or died before they had a chance to recover the material, spend it, move it, or melt it down for its metal; and the most common cause of this in antiquity was warfare.In other words, the number of coins found in a given region, especially those found in hoards, can be a strong positive proxy for the level of military and political turmoil in that region.20 n nThis is not to say that hoarding itself was driven solely by warfare, that people would bury coins out of fear of invading troops. Rather, warfare resulted in the death or dislocation of large numbers of people u2014people who had buried coins and, thus, were not able to recover them.Ancient warfare is a key element in the modern-day recovery of coins from antiquity, because in other cases stored coins tended to be recovered or found by someone else, re-used, worn-down, and, eventually, melted down to recuperate the metal the coin contained u2014meaning, critically, that the coins are not available to be found and studied in modern times. This is a particularly salient point when considering the numismatic record from North Africa, for the region remained remarkably stable in terms of military conflict, political instability, disease, and other markers of turmoil compared to northwestern Europe throughout the imperial period and even into the chaotic third century CE.21 The relative paucity of numismatic material from Africa during this period, then, may be in part a product of this relative freedom from warfare, rather than an indication of a poorly-functioning monetary economy. Moreover, the relative economic stability enjoyed by the region would have contributed to this pattern for similar reasons, for a stable monetary economy means that coins retain their value for longer periods, so that they are less 'expendable' and so do not become stray finds and so hoards containing those coins remain 'worth recovering'. I treat the important topic of recoverability in more detail below. n nConcerning the evidence that we do have, as is immediately apparent from Table 2, of coins minted before 235 CE, the denarius and sestertius are by far the most frequently occurring in the evidence, representing 45% and 49% of the total, respectively. It is expected that these would be the two most frequently found denominations, as these were two of the staples of the imperial monetary system.What is curious is that they were found in nearly the same quantity: 3,562 denarii (3,428 from hoards; 134 from site finds) and 3,887 sestertii (3,753 from hoards; 134 from site finds).Traditionally, it has been often assumed that the highest value coins available are hoarded together, whereas site finds tend to be the lowest value coins. It is notable, therefore, that there are not significantly more high-value silver denarii hoarded than lower-value bronze sestertii,22 nor substantially more sestertii than denarii recovered as site finds.More expected is that asses and dupondii were mostly found as site finds, and only a handful of these very low value bronze coins were found in hoards, while aurei exhibit the opposite pattern. n nDenomination Hoard Site Find Total % of Total antoninianus 19653 362 20015 78 as u00f8 8 8 <1 denarius 1175 1 1176 5 sestertius 4292 35 4327 17 unidentifiable bronze u00f8 4 4 <1 Total 25120 410 25530 n nDenomination Hoard Site Find Total % of Total as u00f8 8 8 <1 denarius 1175 1 1176 21 sestertius 4292 35 4327 78 unidentifiable bronze u00f8 4 4 <1 Total 5467 48 5515 n nThe fact that denarii and sestertii minted before 235 CE appear in Africa in roughly equal numbers, then, is a significant finding and deserves some more attention (Table 3). Interestingly, when only the coins minted after 235 CE are considered (Table 3a), there are 4,327 sestertii, the most represented coin in this period after antoniniani.When the antononinianus is not included (Table 3b), this represents a surprising 78% of the 5,515 total.Denarii, in turn, account for only 1,176 (4%) of all African coins minted between 236-275 CE (Table 3a), 21% without antoniniani (Table 3b). n nTaking a larger snapshot and looking at the entire period 23 BCE to 275 CE (Table 4), 13,478 coins are known from Africa, not including antoniniani. Of these, 8,214 or 61% are sestertii (8,045 hoards; 169 site finds), 4,738 or 35% are denarii (4,603 from hoards; 135 site finds), 39 are aurei, and the rest are fractional bronzes.This demonstrates that sestertii from all periods represent a greater percentage of the non-antoninianus total than sestertii minted pre-235, specifically 61% as opposed to 49%.The proportion of denarii, of course, decreases in turn. Still, it is quite significant that both denarii and sestertii of the imperial period have been found in fairly large numbers, although very few hoards contain both bronze and silver coins in any significant quantity.Also, nearly 1.75 times the number of sestertii as denarii have been found in the region overall, including the hoard evidence. n nDenomination Hoard Site Find Total % of Total as 4 216 220 2 aureus 38 1 39 <1 denarius 4603 135 4738 35 dupondius 1 69 70 <1 dupondius/as 1 u00f8 1 <1 quadrans u00f8 10 10 <1 sestertius 8045 169 8214 61 unidentifiable bronze u00f8 186 186 <1 Total 12692 786 13478 n nUnderstanding the proportional representation of the different denominations is revealing, for the African evidence does not mirror the numismatic record from other parts of the Empire. This is especially striking in the case of the Gallic provinces, encompassing roughly the modern countries of France, Belgium, Luxembourg, Switzerland, and parts of western Germany.Roman Gaul was a large (although significantly smaller) and economically important region as was Roman Africa and has been home to some of the best numismatic research in the last several decades.Much, therefore, is known about the monetary history of the region in the imperial period. The consensus among scholars is that, during the second half of the third century CE, the tri-metallic monetary system of the high imperial period essentially collapsed into a bimetallic system u2013 the gold aureus and the billon antoninianus.23 In short, antoniniani dominate Gallic coin finds, while the vast majority of the non-antoniniani coins are bronze coins minted in the Antonine period, not later.24 n nMore importantly for the issue of denominational patterns, when discussing the rise of antoniniani in the western Empire during the third century, Estiot records that roughly 300,000 antoniniani have been found in the western half of the Empire in hoards, while an additional 30,000 have been identified in excavations; the vast majority of which were found in France, Belgium, or Britain.25 Presumably these figures include some of the African material, although Estiot did not attempt an exhaustive survey of African coins, but was rather mainly concerned with the evidence from northern Europe. Even if all of the African antoniniani were known to Estiot, I am able to reconstruct from the available evidence only 20,037 antoniniani recovered from Africa (Table 1), a mere 6% of the total number identified by Estiot.It is important to stress again that more coins have been found in Gaul and in Britain than in Africa overall, although, crucially, this is heavily weighted with antoniniani.Indeed, in an important study of third century coinage found in Gaul and Britain, Depeyrot and Hollard studied over 350,000 Roman coins minted between 238 and 276 CE found in 65 separate hoards, which in itself dwarfs the total number of coins I was able to identify from Africa for the entire high imperial period.26 Of these 350,000 mid-third century coins, the authors identify only 229 denarii, about 0.06% of the total, and no sestertii.27 n nInterestingly, my own albeit partial survey of the Gallic numismatic material likewise includes fewer denarii and sestertii from that region than from Africa. This search revealed 6,694 sestertii, less than the 8,214 known from Africa. I also found 3,360 denarii in Gallic hoards,28 compared with 4,738 from Africa.When the roughly 300,000 antoniniani identified from northern Europe by Estiot are considered, the number of denarii and sestertii from Gallic hoards represent on the order of 1-2% of the total number of pre-Aurelian coins known from the region, considerably less than the ratio from Africa.29 A similar picture emerges with the coins from Roman Britain. Indeed, a single hoard from Cunetio in southeastern Britain, one of the largest single collections of Roman coins ever found, offers a fairly representative picture of the circulation history of the region and encompasses in itself more than the total number of coins I have been able to identify from all of Africa.The Cunetio hoard features 54,951 coins dating from the late first century CE to the reign of Aurelian, of which only 630 are denarii (about 1.5% of the total) and only one sestertius.30 n nThis all implies strongly that antoniniani did not circulate to nearly the same extent in Africa during the mid-third century as they did in northern Europe. There are fewer denarii and sestertii known from the Gallic provinces and Britain than I have been able to gather from Africa.What this means in terms of the type of coins circulating in different parts of the Empire, then, is that the coin populations of Roman Africa seem to have been considerably more stable than in northern Europe at least up to the mid-third century;31 although in both regions the preponderance of antoniniani minting certainly had a significant effect on circulation patterns after 235 CE, sestertii and denarii remained in circulation after this date in greater numbers in Africa than elsewhere. n nb) Chronological Patterns n nPerhaps the most important patterns, and the aspect which most sets Africa u2019s monetary history apart from that of other areas of the western Empire, are the chronological ones. I mentioned above that Africa displays a more steady, stable numismatic record over the course of the high imperial period than can be seen in northern Europe. This is borne out by a close look at the chronological patterns.Figures 1 and 2 present histograms of the number of coins found in Africa, both hoards and site finds, by decade in which the coins were minted.32 These illustrations clearly reveal that there is a fairly steady representation of coins throughout the high imperial period. n nFigure 1 includes antoniniani, which represent the majority of overall coin finds, as noted above. Since this coinage was not minted before 215 CE, this skews the results towards the right half of the graph.Still, it is notable that there is an uneven distribution throughout the period when antoniniani were being minted in great numbers, after about 235 CE.Coins from the 260s and 270s are by far the most numerous of any category, representing 21% and 37% of the total, respectively.This further demonstrates that, while antoniniani came to dominate the circulation pattern of Africa as it did in the rest of the western Empire, this dominance did not occur until the 250s at earliest, well into the period when antoniniani were being minted. The relatively stable circulation pattern enjoyed by Africa is illustrated more plainly in Figure 2, which is a breakdown of coins by decade in which they were minted not including antoniniani.This Figure shows that nearly all decades of the high imperial period are well represented. n nMore significant is that the early 200s, covering the Severan period, are well-represented in the number of coin finds, shown clearly in Figure 2. This is important because, as mentioned, it is a very different pattern from that recorded in Gaul and Britain.Owing likely to a variety of factors including military, political, and economic turmoil along with dwindling metal supplies, the coinage circulating in northwestern Europe was essentially not restocked after the Antonine period, a gap that was eventually filled with antoniniani.33 As Estiot remarks, there is essentially a hiatus in the numismatic evidence from 193 to about 260 CE between the last nadir of minting good quality imperial silver and bronze coins in the late Antonine period and the appearance in huge numbers of antoniniani.34 Her remark, however, is based almost exclusively on evidence from northwestern Europe, on finds from Roman Gaul, Germany, and Britain; in the rest of the western Empire, namely Italy, Spain, and, of course, Africa, this gap is far less severe.35 #p31Further, finds from the different African provinces largely conform to this pattern as well. As can be seen in Figure 3, the distribution by mint date of coins found in Africa Proconsularis as well as in Mauretania Caesariensis are heavily skewed towards the 250s and later because of the large numbers of antoniniani found in these provinces.Conversely, Numidia and Mauretania Tingitana show more even distributions, although it is perhaps significant that Numidia shows many coins minted in the 220s through 240s, which may be related to the high rate of hoarding the province experienced during the strife of the 250s as scholars such as Salama have posited, discussed above. When antoniniani are not included, the distribution of all provinces is much more even (Figure 4).36 Crucially, Numidia still shows a large number of non-antoniniani minted after 220 CE, which strongly suggests that it was not simply high-quality Antonine and Severan issues which were hoarded in that region, as Salamas model would suggest.Figure 4a.Number of coins found in Africa Proconsularis by mint date, not including antoniniani (n=4,005) Figure 4b. Number of coins found in Numidia by mint date, not including antoniniani (n=7,019) Figure 4c.Number of coins found in Mauretania Caesariensis by mint date, not including antoniniani (n=1,776) Figure 4d.Number of coins found in Mauretania Tingitana by mint date, not including antoniniani (n=677) Figure 4 demonstrates that a large number of coins from the region were minted in the 200s, even when antoniniani are removed from analysis. The 160s CE produced the most coins found in the regionu2014during the relatively prosperous Antonine dynasty.The Severan period in the early third century, however, is likewise well represented.Further, only in the two Mauretanian provinces do coins minted earlier represent the largest group; Mauretania Caesariensis shows the most coins from the 30s and 60s CE in the first century CE, while the early second century produced the most number of coins found in Mauretania Tingitana. These results are significant, again, largely because they contrast so strongly with the patterns exhibited by other regions.Notably, when only non-antoniniani are included, Gaul shows a very even curve with the Antonine period being very well represented, typically with coins from the reigns of Trajan, Hadrian, and Antoninus Pius the most frequent.37 Conversely, as discussed above, there is a conspicuous lack of Severan coins found throughout the Gallic provinces, which has led several scholars to assert that the coinage, particularly the bronze denominations, was essentially not restocked after the reign of Commodus. Figure 5.Number of coins found in Gaul by mint date, not including antoniniani (n=7,219) Another key revelation from this material is that denarii and sestertii are both found in relatively high numbers throughout Africa, as well as that large quantity of sestertii minted after the Antonine period have been found in the region.Coins of all denominations minted in the first and second centuries, up to the early Severan period, were circulating in Africa in relatively large numbers. Denarii and fractional bronzes show up in the region progressively rarely over the course of the third century, which is especially acute in site finds of the fractional bronzes, while antoniniani come to dominate the circulation pattern after 235 CE.The most curious feature of the pattern is that sestertii minted in the 200s CE do not exhibit a similar decline as the other non-antoniniani denominations, but are found in large numbers in both hoards and site finds. It is also notable that, although fewer denarii minted after 235 CE have been in Africa than specimens minted earlier, the denomination does not disappear completely until fairly late in the third century.This lends further support to the notion that Africa enjoyed a relatively stable monetary and economic life throughout the third century.It also suggests that, although the region likely did experience some inflationary tendencies after about 160 CE,38 inflation was not particularly severe there until the 250s at the earliest (I discuss the relationship between inflation and these changes in more detail below). The crucial point here is that both of these markers of stability are not echoed by the numismatic record of northern Europe.This picture is further confirmed by the circulation life of the coins found in Africa compared with those from Gaul.Admittedly, the notion that Roman Africa had a thriving economy for most of the imperial period is not an entirely novel one.The reason that the evidence presented here is important is in providing confirmation that the general impression given by other types of material from the region such as textual and epigraphic records; namely, that Africas market activity required a significant amount of coinage to pay wages, buy materials, and invest into the production of a variety of consumer goods.39 Furthermore, the suggestion that the African economy remained productive even during the turmoil of the mid-third century CE and that economic and financial difficulties were lower than in in the region than in other parts of the western Empire are perhaps more contentious ideas, yet they are certainly supported by the numismatic evidence. c) Regional Patterns Figure 6. Number of coins found in Africa by Province (n=33,514) The breakdown of coins found by province are illustrated in Table 5 and Figure 6.Striking in this regard is that the province of Numidia has produced the greatest number of coins minted before 235 CE, yet Africa Proconsularis contains the greatest number of coins overall.This requires elaboration.First, I will look at the patterns exhibited by the pre-235 CE coins, then turn to compare this with the evidence when all coins are considered. Table 5a.Number of coins found in Africa, by province and find context.DenominationtHoardtSite FindtTotalt% of Total Proconsularist17708t399t18107t54 Numidiat7729t13t7742t23 Mauretania Caesariensist6061t11t6072t18 Mauretania Tingitanat859t734t1593t5 Totalt32357t1157t33514t Table 5b.Number of coins found in Africa minted before 235 CE, by province and find context.DenominationtHoardtSite FindtTotalt% of Total Proconsularist2532t193t2725t34 Numidiat3839t9t3848t48 Mauretania Caesariensist730t8t738t10 Mauretania Tingitanat136t537t673t8 Totalt7237t747t7984t Table 5c. Number of coins found in Africa, by province and find context, antoniniani not included.DenominationtHoardtSite FindtTotalt% of Total Proconsularist3779t226t4005t30 Numidiat7010t9t7019t52 Mauretania Caesariensist1765t11t1776t13 Mauretania Tingitanat138t539t677t5 Totalt12692t785t13477t Looking only at coins minted before 235 CE and including both hoarded coins as well as site finds (Table 5b), 3,848 such coins (48% of total) were uncovered in the Roman province of Numidia, roughly what is today eastern Algeria. The next most represented province is Africa Proconsularis, which has produced 2,725 coins, or 34% of the total, with Mauretania Caesariensis having produced about 9% and Mauretania Tingitana the remaining 8.5%.Additionally, these coins come from 66 different sites, including both hoards and site finds: 23 from Africa Proconsularis, 20 from Mauretania Tingitana, 13 from Numidia, and 10 from Mauretania Caesariensis (Table 6a). This is noteworthy, as Proconsularis and Mauretania Tingitana have the largest number of find-spots, although Numidia has the largest number of actual coins found.The Numidian finds, coming from 10 hoards and 3 excavated sites, therefore comprise more coins per find on average than in the other provinces.This observation, however, must be tempered by the fact that one exceptionally large hoard, that from Guelma, contains 2,787 coins, 72% of the Numidian total.40 Similarly, I was able to find records of coins produced by 13 separate excavations around the site of Thamasida in Mauretania Tingitana. I count these as 13 different find-spots; but if they were all counted as a single find-spot, then the total number of sites in Muaretania Tingitana from which I found numismatic records would fall from 20 to 8. These results deserve further comment.Table 6a.Number of sites where coins were found in Africa, by province and find context.DenominationtHoardtSite FindtTotal Proconsularist23t12t35 Numidiat23t3t26 Mauretania Caesariensist22t4t26 Mauretania Tingitanat9t14t23 Totalt77t33t110 Table 6b.Number of sites where coins minted before 235 CE were found in Africa, by province and find context.DenominationtHoardtSite FindtTotal Proconsularist14t9t22 Numidiat10t3t13 Mauretania Caesariensist8t2t10 Mauretania Tingitanat7t13t20 Totalt39t27t66 To begin with, while it is certainly important to distinguish which Roman province has left the greatest number of Roman coins for the modern scholar, these results must be taken with great caution. For, it is likely that the results are in large part being driven by modern circumstances, both the historical circumstances of the different countries in question as well as academic considerations.In short, more sustained numismatic research has been conducted in certain places and at certain times than in others.This may have resulted in more coins being discovered in Tunisia and Algeria than elsewhere, as these countries have the strongest pedigree of numismatic scholarship dating back to the French colonial period, a tradition scholars in both countries have maintained to the present. There are also certain historical reasons that could explain this geographical patterning.As Salama recently noted, Algerian hoards have produced a greater number of coins from the imperial period than any other country in North Africa.He attributes this largely to the military unrest which occurred in southern Numidia in the 250s CE as a result of invading tribes from the Atlas Mountain range.41 Indeed, Salama notes that 14 hoards found in Algeria and Morocco have terminal dates in the 250s and are mainly comprised of coins from the high Empire, namely minted before 235 CE. This suggests that the unrest of the 250s led to much insecurity and, therefore, an increased preponderance of non-recovered hoarding.Moreover, the fact that the regions hoards are so heavily weighted with coins minted before 235 CE indicates also that the turmoil led to a disruption in the distribution of coins from the mint at Rome, which fits with evidence from other regions of the Empire, discussed below. The idea is not that coins did not circulate in other regions, rather that there would have been less unrecovered hoards in the more peaceful regions, meaning fewer of these coins will have been unrecovered and so available for discovery by modern archaeology.This line of thought, however, begs the question of why Mauretania Caesariensis and Tingitana have produced so few coins, since the tribal revolts of the 250s affected these areas as much as, if not more than, western Numidia? Furthermore, the greatest number of hoards have been found in central and southern Tunisia, even though the total number of pre-235 CE coins found there is less than were found in Numidia (Table 5b).This belies Salamas hypothesis, for it can provide no explanation for the large number of hoards recovered from Proconsularis.It is, therefore, quite difficult to reach any definite conclusions about the geographical distribution of finds of imperial coins minted before 235 CE. It is clear that Africa Proconsularis has produced the greatest number of find-spots, if the coins recovered in excavations at Thamusida are counted as a single find-spot, yet Numidia has produced the greatest number of pre-235 CE minted coins regardless of context, showing perhaps a regional disparity in the reason for hoarding coins, although again this figure is biased by the exceptionally large Guelma hoard. Particularly confusing, and also intriguing, about the geographical distribution of coin finds is that the pattern of pre-235 CE coins does not persist when post-235 coins are included.When all coins minted in the high imperial period are considered, Africa Proconsularis becomes by far the most well represented province with 18,107 examples, 54% of the 33,514 coins known from all of Africa (Table 5a). Numidia is then the second most well represented, with 7,742 (23%) coins, followed closely by Mauretania Caesariensis with 6,072 (18%), then Mauretania Tingitana with 1,593 (5%).Critically, the distribution of the sites in which these coins were found is actually fairly similar to the pre-235 CE sample.Taking all of the imperial coins found in Africa together, I record a total of 110 separate find-spots: 35 from the territory of Africa Proconsularis; 26 from Numidia; 26 from Mauretania Caesariensis; and 23 from Mauretania Tingitana (Table 6b. Compare this with the results of Table 6a).This is particularly interesting since, when all coins are considered including antoniniani, the provincial distribution in terms of the number of find-spots echoes that of the number of coins found, with Africa Proconsularis the most represented province in both categories, followed by Numidia, Mauretania Caesariensis, and lastly Mauretania Tingitana.This is not the case with only the pre-235 CE coins. The chief driving force behind the different regional patterns of number of coins exhibited by pre- and post-235 CE finds is clearly the antoniniani which, as discussed, were minted after the 230s in immense quantities and which seem to have circulated most heavily in Africa Proconsularis.For, looking at the full period 23 BCE-275 CE and excluding antoniniani (Table 5c), Numidia is the most well-represented province, providing 52% of the coins I was able to find, with Proconsularis at 30%, Mauretania Caesariensis 13%, and Mauretania Tingitana 5%. Antoniniani, therefore, seem to have circulated in Africa Proconsularis to a significantly greater degree than they did in the other provinces.Moreover, this leads to the important conclusion that a model centered on the notion that conflict drives hoarding and therefore the frequency of coin finds is somewhat flawed,42 for no conflict can be posited to account for the dramatic rise of antoniniani circulating and hoarded in Africa Proconsularis during the second half of the third century CE. An intriguing alternative explanation is that, while turmoil may represent one significant factor in the recovery rate of coins from a given area, the general monetary and economic health of that region may be equally important.Exploring the context of coin finds from Roman Africa offers some hint at how this model may help explain the patterns observed here. d) Contextual Patterns The final pattern I will comment on is the context in which African coins were foundu2014in a hoard or as a site find. Generally, large numbers of coins grouped togetheru2014hoardsu2014typically represent the accumulated wealth of an individual, family, or a group like a military legion or trade organization, and generally are made up of the highest-valued coins available to the hoarder.Conversely, site finds represent the lower-valued coins in circulation and are, in essence, 'loose change' lost or discarded during everyday activity and not recovered because the loss was unknown or was not worth the effort to recover. A relatively low but steady loss-rate of low denomination coins, thus, fits with the idea that Africa enjoyed a well-functioning monetized economy; an economy featuring, on the one hand, enough small-scale activity so that enough of such coins were in demand that they were lost and unrecovered with some regularity, yet, on the other hand, there was a high enough need for the coins that they were not discarded in any large quantity. Contrarily, higher value currency such as the silver denarius was useful as a store of value or for large-scale activity such as state expenditure or the exchange of luxury or bulk goods, things which occur less frequently than smaller-scale expenses and which require the accumulation of large groups of coins.This would explain why denarii are most commonly found in hoards.Sestertii, then, exist on the border of the two categories, for they are useful both in daily transactions such as paying wages on a local scale or for buying modest quantities of consumer goods, but also seem to have functioned as a store of value. Consistent with this, we see sestertii from North Africa found in relatively large numbers in hoards but also showing up as site finds.This also explains Africa's denominational patterns discussed above: a relatively stable supply of very low value bronze asses as site finds up to the late second century; a fairly steady loss rate of the medium-value bronze sestertii throughout the imperial period; and an increasing number of high-value silver denarii being lost over the course of the second century leading up to the introduction of the antoninianus in the mid-third century. It is curious to note from Figure 6 that Mauretania Tingitana is the only region where site finds outnumber finds of hoarded coins, largely due to the excavations at Thamusida which have produced many coins.43 In the other provinces, hoarded coins far exceed the number of stray finds found.Of the 110 coin find-spots that I have identified from Africa (Table 6b), 77 are hoards, while 33 are site finds from excavated contexts. Moreover, it is important to stress that most of the known hoards have terminal dates after 235 CE, namely 52 (68%).44 This means that the majority of the hoards known from Africa which contain imperial coinage were hoarded after 235 CE, a pattern that largely mimics that known from northern Europe.This may seem to lend support to the notion that some turmoil in the mid-third century caused a massive increase in the frequency of hoarding throughout Africa. As I discuss above, however, military conflict appears unable to explain the entire pattern of hoarding from Africa, so likely this would be political or, more likely, financial turmoil driving this pattern. I return to this critical observation in the following section.Figure 7a.Average estimated number of years in circulation of antoniniani found in hoards, showing coins found in Africa (blue; n=20,037) compared with those found in Gaul (red; n=6,356) Figure 7b. Average estimated number of years in circulation of sestertii found in hoards, showing coins found in Africa (blue; n=8,214) compared with those found in Gaul (red; n=6,694) This overall picture is further supported by the circulation life of the coins found in Africa compared with those from Gaul.As mentioned at the beginning of this section, my survey of the Gallic coins focused on the antoniniani and sestertii, so I will focus for these coins for comparison. Figure 7a illustrates the estimated circulation life of antoniniani found in African versus Gallic hoards.The average estimated circulation life is 5 years, similar to the Gallic antoniniani which show an average circulation life of 7 years.45 African sestertii, contrarily, have an average circulation life of only 45 years, compared with Gallic sestertii which circulated on average for 70 years (Figure 7b). The denarii contained in my database mirror this as well, with African denarii circulating for an average of 38 years and Gallic denarii for 95 years, although it is important to stress again that my survey of the Gallic denarii is not as exhaustive as my survey of the Gallic sestertii, so I do not illustrate this finding here.It is also worth noting that African asses and dupondii show the expected pattern, circulating on average 123 and 141 years, respectively.46 This, of course, does not mean that these coins were actually used in market transactions in each year for over a century. What it shows is simply that the majority of these types of coins which were found in Africa came in hoards which included also coins minted much later, meaning that the coins were available in the monetary system to be gathered and hoarded at a later date, or were part of u2018savings hoardsu2014groups of coins not compiled all at once but accumulated through time.47 The central point here is simply that these low-value coins were deemed worthy of inclusion in hoards either compiled in or persisting into the late second and third century, as most African hoards were, which again relates to Africas relative fiscal and economic stability. The question may fairly be asked whether it is worthwhile at all to even include evidence from site finds in such a numismatic overview.There is, in fact, great scholarly debate over exactly how to treat individual coins recovered as site finds, especially regarding the extent to which the stray finds of any given archaeological site reflect a true cross-section of the coinage which actually circulated during a given period.48 The problem is essentially the opposite of the issues with hoarded coins; coins lost accidentally or casually thrown away are generally the lowest denomination, most heavily worn coins in circulation at a given time and place. The picture that emerges from a study of stray finds, then, is strongly biased towards low value currency, whereas it is typically the highest value, heaviest, most pristine examples available to a person which are hoarded.Moreover, the number of site finds from a given area depends in large part on the number of large-scale excavations conducted in that area, whereas hoards are often found even without the deliberate exertion of effort to find them. Consequently, the focus of numismatic scholarship has traditionally been on hoarded coins, as hoards have been the most widely available and accessible context producing Roman coins.In a very important article, Reece argued that site finds should be subjected to closer scholarly scrutiny than they have in the past.49 He notes that there are 3 basic assumptions that make excavated, stray coinage suitable to analysis: first, that in a well conducted excavation, the coins uncovered will be close to the actual amount of coin loss at the site in antiquity; second, that the coins lost on a site must bear some relationship to the coinage in circulation at any given period, even if the precise relationship is not immediately apparent; and lastly, that it is possible to discern the major factors which produce stray coin finds. He expands on this third point, noting that a coin is most likely to be lost and unrecovered on a particular site: a) when it is among the least valuable coins in circulation; b) when it is small compared to other examples of the same type (which likewise has to do with the coins value, since smaller coins contain less metal); c) when it is dull, namely heavily worn; d) when there are more of that type of coin circulating than other types; and e) when there is more money in general circulating at the site than at other sites, i.e. that the loss rate of coins is related to the overall level of monetization.50 These arguments convincingly show that it is necessary to include analyses of site finds in order to judge what patterns these coins exhibited and how those patterns relate to the hoarded material, as long as the distinction between these radically different contexts is properly maintained. In terms of chronological arrangement, the site finds and hoarded material exhibit roughly the same pattern, with the majority of coins recovered as site finds minted in the third century CE.The denominational pattern is a little different, for site finds nearly always feature a greater concentration of lower value coinage than the hoarded material, as expected.While antoniniani comprise the majority of both hoard and site finds, they make up only 32% of the site finds, but 61% of the hoarded material. Moreover, there are proportionally fewer aurei, denarii, and sestertiiu2014 the higher value currencyu2014in site finds compared with hoards and consequently greater representation of the less valuable fractional bronze denominations, the as, dupondius, and quadrans, as well as the heavily worn and fractional unidentified bronzes recovered as site finds.This is all calculated from the data in Table 1.The most revealing analysis is to track the denominations represented by site finds over time. This is because, as Reece notes, typically the lowest coinage in circulation at any given site at any given time will be lost in greatest quantity, so a change in the denominational pattern of lost coins over time will indicate something about the areas monetary history.51 Figure 8 offers a comparison between the chronological distribution of the as, dupondius, sestertius, denarius, and antoninianus from site finds versus hoards. These graphs reveal some change over time, as the frequency with which asses and dupondii, relatively low-value coins, were lost sharply decreases after the 160s CE, while the loss rate of the denarius increases fairly steadily over time.Curiously, the sestertius loss rate does not mirror that of the denarius, but sestertii are lost at a fairly steady rate during most of the Antonine period as well as the late Severan period. This again suggests that Africa experienced some inflation after the 160s, since the increasing frequency of denarius losses coupled with the increasing rarity of losses of fractional bronzes suggests that the coin was progressively losing purchasing power and, thus, were becoming more 'losable'.This notion, however, is somewhat belied by the fact that sestertii continued to be lost at a steady rate along with denarii in the early third century. Perhaps the best explanation is that the region experienced an initial period of inflation in the later half of the second century CE, but that currency values more or less leveled off and remained fairly stable for the next 150 years.Once more, this pattern is fruitfully compared to the situation in northern Europe.Post-Antonine period finds in the Gallic provinces are very rare, which includes site finds as well as hoards. This has been convincingly interpreted52 as the result of fairly drastic debasements to the currency, resulting in a relatively severe degree of currency inflation, if not general price inflation.Such inflation would not only prompt the lower value denominations to be minted less frequently, but also could be the cause of the nearly complete disappearance of coins of all denominations from circulation after the Antonine period, something not observed in Africa. The distribution of coins lost in Gaul, thus, is much more staggered than in Africa, for it shows a fairly steady loss rate until the middle of the second century CE, then a near total gap until the later 230s when antoniniani came to flood the markets of northern Europe, as discussed above.Another crucial issue for which the evidence from site finds is potentially helpful is the degree of monetization in the different parts of the Roman world. As Reece notes, the more coins there are circulating at a given place and time, the more individual coins will be lost and not recovered.Yet, this relationship is not as simple as it may first appear.Reece himself hinted at this in an earlier publication, pointing out that a slow and steady representation of coinage produced by an excavation implies that the site enjoyed a normal, regular supply of coinage for frequent and general use.53 The idea being, in other words, that a highly functioning monetary system will produce a steady yet relatively low rate of coin loss, since the coins in such an environment would be used frequently enough that only a very few of the lowest value coins will be allowed to be lost and unrecovered. In a less active market environment, on the other hand, coins would be stock-pilled for a variety of purposes, such as at an army camp to be distributed to soldiers as their salary.54 Since the coins would be gathered together in a large group but actually used in market transactions less frequently, there would be less chance for individual low-value coins to be lost and scattered around a site.The most convincing idea to explain why a very large number of stray coins would be found in an excavation is that rapid debasement or a dramatic change in the monetary system suddenly makes a particular group of coins essentially valueless or demonetized, yet the intrinsic value of the coins' metal is not affected by the rising commodity prices brought on by inflation, so they are discarded in great numbers. Thus, a well-functioning market economy should exhibit a coin-loss rate somewhere in between the very sparse rate expected from an under-monetized area and the great number of coins expected to be lost in staggered rates during a period of monetary instability.This is of vital importance, for it suggests that the relatively steady yet still small amount of lost coins recorded in African archaeological sites is indicative of a well-functioning and highly monetized market based on numerous and frequent transactions involving the exchange of coin. This idea certainly deserves greater attention, although it is a very difficult notion to test as it relies essentially on an ex silentio argument, for it is concerned as much with the amount of coins not found as with the coins which were actually lost.Moreover, there is no threshold given for how many coins can be lost per year that indicate a well functioning monetized market before the loss rate becomes large enough to represent a different sort of market environment. Still, it is an appealing idea and would seem to explain the evidence fairly well, particularly the relatively steady but low loss rates of sestertii and asses experienced in Africa, since these were the two principal denominations used in medium- and small-scale market transactions.What Does Africa's Numismatic Record Reveal About Rome's Monetary System?The preceding discussion of the contextual patterns, including site finds alongside hoarded material, points to a different mode of coin distribution and use than has traditionally been thought. Indeed, numismatists and scholars of ancient monetary history typically assume that there was in all periods a strong link between state activity, particularly the needs of military personnel, and coinage.The central problem with models of Roman coinage focused only on state needs and particularly on military spending is that they leave little room for understanding how coins could have circulated without the mediation of large numbers of soldiers, yet there is an abundance of economic activity observable in many parts of the Roman world, including Africa, that seem not to involve the military at all. Africa featured only one legion, the legio III Augusta, whose main camp was moved from Numidia to near Lambaesis in Mauretania Caesariensis under Hadrian to be closer to the Aures Mountain ranges, the main area of turmoil throughout the imperial period including the revolts of the 250s CE.There were also auxiliary forces, most of which were based in camps or forts in southern Numidia and Mauretania Caesariensis, although many of these military bases were constructed during the second half of the third century precisely in response to these invasions from the Aures Mountain range.55 For most of the imperial period, then, the entire region was relatively under-militarized compared with other parts of the Empire, notably northern Europe.56 Crucially, analyzing the full range of Africa's numismatic evidence together demonstrates that the majority of coins found in the region come from Numidia and Africa Proconsularis and not in the areas of the two Mauretanian provinces where much of the military manpower of the region was concentrated. It is possible that soldiers in the two Mauretanian provinces used their pay to purchase goods from merchants who then took that money to Numidia and Proconsularis, or that many soldiers ended up moving to these eastern Provinces to spend their money there.Still, if soldiers pay was the initial and primary focus of coin distribution, we should expect to see numismatic material from the areas where these soldiers were concentrated at least on par with, if not greater than, the material left in less militarized areas. Army presence alone, then, simply cannot have been the central driving force behind the supply of coins to the region.Certainly, the state had other financial commitments besides the army that could have prompted the minting and distribution of coins into North Africa.The state had employees in each province, such as governors, proconsules, legates, etc., as well as other support staff who all needed to be paid in some form, potentially with coins. Moreover, public works projects organized and paid for by state finances would have put money into provincial markets.Still, this activity does not really explain the production or distribution of smaller-denomination currency in Africa or any other region.It is fairly clear, further, that only a very small portion of the imperial budget was spent in Africa;57 in other words, neither military spending, the salaries of imperial officials, nor imperial construction projects or largess of other sorts could have provided enough of an impetus to explain the numismatic evidence from the region as it currently stands. This, then, leaves two potential avenues to explain the distribution of this currency: firstly, that coins minted in Rome were distributed in Africa in large part to meet the economic needs of private citizensu2014directly as wages, indirectly as bulk shipments of coins (to money-changers, perhaps?), distributed through monetary transactions, etc.u2014that is, uses not tied directly to the activity of the state; or, secondly, that coins were brought into the region from economic exchanges between African producers and consumers elsewhere in the Empire. This latter possibility is appealing, although as Duncan-Jones notes monetized exchange should have created fairly homogeneous numismatic profiles in the different regions of the Roman Mediterranean, yet this is clearly not what the evidence reveals.58 Importantly, in both of these scenarios it is the needs of economic agents in Africa driving the distribution of coinage in the region, whether as producers of exchangeable goods or as consumers in a monetized market, rather than the needs of the Roman state.59 This idea has, in fact, been proposed in the past, although rarely with regards to the high imperial period.60 Working with the coinage uncovered by the British Excavations at Carthage, Reece notably concluded that the period of Vandal control over North Africa in the fifth and sixth centuries CE marked the first time that coins started to be minted and distributed to the region entirely to meet the demand of the general public, rather than for state needs.61 His reasoning is based on the fact that virtually all Vandal coins found in Carthage are small denomination copper, which he argues is pointless for the state purposes of paying high officials, or overseas trade, but is just what is needed for the markets. 62 As is evident from the analyses of the numismatic material explored in this article, Roman Africa likewise saw a fairly steady supply of lower denomination coins throughout the high imperial period.This does not mean necessarily that Reeces logic is flawed, but it does require that the willingness of a state to mint coins for reasons other than their own needs must at the very least be backdated before the Vandal conquest.63 As Reece himself admitted, we still know very little about coin supply in North Africa in the 4th , or earlier for that matter. 64 What we do know is that, until the 250s CE at least, people in all of the African provinces had access to the full range of Roman coinsu2014low- and high-valueu2014that the vast majority of coins found in Africa were minted at the state-run mint at Rome, and that spending on soldier salaries cannot have been the primary conduit by which coins minted in Rome ended up circulating in Africa. It is, in fact, one of the great mysteries of Roman coin production whether the imperial minting authorities took it upon themselves to decide when and in what quantities to send low value coins to different regions, or if the call for coins came from some authority or private citizen in the province receiving them.There is actually some evidence from the eastern Empire for this latter scenario.An inscription found at Rhodiopolis in Lycia from the second century CE honors Opramoas, a private benefactor of Rhodiopolis, for having paid for bronze coins to be minted at Rome and shipped to Rhodiopolis in order to be used by the citys residents.65 This suggests that the usefulness of small change in performing market transactions was recognized by people outside of the state apparatus, and there was demand from the users of coins to remain liquid in terms of the cash supply. Perhaps professional money-changers or bankers regularly 'bought' coinage from the mint in order to distribute to local consumers, charging, of course, a fee for the exchange.66 There was one major difference between the eastern and western portions of the Empire in terms of minting system, namely that civic mints throughout the East continued to mint their own bronze coins throughout the imperial period, unlike in the West where all coins were minted Rome during the second and most of third centuries CE. Unfortunately, no direct evidence of a similar procedure as what Opramoas undertakes survives from anywhere in the western half of the Empire.Still, local demand for coinage is a very persuasive alternate explanation for how and why coins ended up in the Roman provinces without appealing to soldiers presence.The key question here is why the Roman state would incur the costs of producing and distributing such large quantities of so many different types of coins for such a long period? In other words, what did the central imperial authorities get out of Romes state-controlled minting?It must be stressed here that the act of transforming metal into coined money was itself a fairly complicated, laborious, and, most importantly, expensive undertaking in any preindustrial society, particularly the ancient world.One of the main problems faced by ancient (and, for that matter, modern) minting authorities is that coins minted in low-value metals like bronze have much smaller marginal returns than silver or gold coins, since the production costsu2014mining ore, smelting, shipping the metal, melting the refined metal, shaping flans, producing dies, stamping the coins, transporting them towards the final users and tracking every step of the processu2014are roughly equivalent regardless of the metal involved. Yet, coins made from high-value metals provide a much greater return to the state which bears the cost of minting in terms of the buying power of the coins once minted than coins of less valuable metal.67 This seems, in fact, to be one of the reasons that scholars have long associated minting with large-scale state expenditure, as the easiest explanation for why an ancient state would bear the cost of minting coins is to assume that high-value coins were predominantly produced and that the main motivation was to cover the expenses incurred by the ruling authorities, namely paying soldiers and other dependents as well as rewarding loyal supporters and administrators. Surely, it is notable in this regard that the earliest coin-producing states in Asia Minor and in the Greek world concentrated on high-value metals like electrum and silver, and did not introduce low-value bronze coins until the very end of the fifth century BCE.68 It is, though, difficult to reconcile the appearance of low-value coinage with this line of reasoning.Moreover, this discussion of minting costs boils down to the idea that the real economic value of a coin to the minting authority in terms of its buying power must surpass the cost of minting that coin, otherwise the state mints at a deficit, which is unsupportable in the long term. Clearly, then, the higher the real value of the coin being minted, the easier it is for the minting authority to recover the costs of production; essentially, the marginal cost of coin production is inversely proportional to the value of the metal used in the coin.69 Further, there were limits to how small or light the state could make individual coins and still have them be large enough to be actually usable by people and acceptable as a legitimate currency.70 Thus, Roman bronze coins were only slightly fiduciary, meaning that the nominal, or face, value of the coins was not too far from their intrinsic value, or the value of the metal contained in the coin as a commodity.71 Significantly, the small marginal return from bronze coins which circulated at something approaching their intrinsic value as compared with the return on silver or gold coins means that bronze coins were particularly susceptible to changes in the value of the metal. In other words, a modest rise in the commodity price of the metals needed to produce bronze coins could push the production cost over the margin, making the cost of procuring and minting the raw material greater than the finished coins economic value.72 This may, in fact, have been one of the reasons for the abandonment of bronze denominations in favor of the billon antoninianus in the 230s CE.Given how costly it was to produce bronze coins compared to other denominations and given that silver and gold coins provided such a greater return in terms of spending power, the imperial authorities must have had some compelling reason for supporting a tri-metallic monetary system for as long as they did. The desire for small-denomination currency to use in low-value, daily transactions should not be discounted as a motive for the minting authorities.This is not meant to imply any great altruistic motive the Roman state had to support the welfare of the poor.Rather, I am arguing that it was in the states own interests to keep markets stocked with official low-denomination coinage.73 This is largely because transactions will occur whether or not the state is involved, meaning that counterfeit coins are made in increasing quantities when the official coins are insufficient to meet the demands of the market.74 Large quantities of imitation coins circulating in a given area can devastate a market, causing inflationary spikes or lack of trust in the coinage due to an unregulated increase in the amount of money in the economy and driving good quality coins out of circulation. Further, the state had a definite interest in ensuring that its high-value currency maintained its real economic value.75 This is important, because any change in the supply or value of one metal affects the others, for there was always an official exchange rate between the different denominations.Thus, if the intrinsic value of one denomination changed, it would put stress on the nominal rate at which the coin was exchanged with other coins. That would exacerbate inflationary periods, since the affected coin will effectively cease to be accepted in transactions at the official tariff as its nominal exchange rate no longer mimics its intrinsic value.In order for the state to continue to receive some return on minting the silver and gold coins which it used to meet its largest financial obligations, then, the value of the bronze denominations had to remain fairly stable. Thus, it was absolutely crucial to keep all parts of the tri-metallic monetary system intact.76 Support for these views is given by the appearance in very large numbers of imitation coins, especially imitation antoniniani, in northern Europe during the second half of the third century at a time when the area was insufficiently stocked with bronze coins, as noted above.Perhaps the most compelling explanation for why bronze coins gradually ceased to be produced and sent to these areas is that some combination of inflation and depleting metal stocks had driven up the commodity price of copper and the other metals needed for producing bronze. Since bronze coins were minted at a relatively low marginal return, at least when compared to the denarius and especially the antoninianus, this inflation would have caused bronze coins to be more costly to produce than the value they returned to the state qua coinage.Conclusion This article seeks to contribute to the field of Roman numismatics by offering a detailed overview of a large database containing detailed records of the imperial Roman coins recovered in North Africa. This database is the result of years of research.The chief value of this paper is offering the database to scholars, as it represents the most comprehensive collection of the Roman coinage found in North Africa during the first three centuries CE produced to date; though it is nevertheless incomplete, and is in want of further attention by numismatics and economic historians.This database has been utilized to investigate the Roman Africa's monetary and economic history. Some results from these analyses have been summarized here.In particular, I explore several key issues of Roman monetary and economic history; the relationship between coin finds and economic activity, the peculiarity of Roman Africa compared with the rest of the western Empire, particularly in the tumultuous third century CE, and the ways that consumer demand impacted minting and the distribution of coined money from Rome to a peripheral area such as North Africa. The key contribution that this article makes, however, is in providing access to the complete set of numismatic evidence. I mentioned very briefly in the introduction that scholars of antiquity are now beginning to realize the enormous potential of data-driven approaches to ancient history and the utility of open-access digital publications.This approach, though, requires that scholars allow general access to the material that informs and underlies the conclusions and interpretations offered about any number of topics concerning the ancient world. This is an unfamiliar practice to most scholars who deal with material, whether numismatic, epigraphic, ceramic, etc.Traditionally, the practice has been to produce overviews and articles on specific, narrowly-defined topics, keeping the data behind the arguments private and guarded.The database presented here is the result of years of research and effort pulling information from a variety of numismatic publications and resources scattered around the United States and Europe. It is important to ensure that I reap the proper rewards from this effort in terms of publications and credit, yet it would be disadvantageous for everyone to make any other scholar interested in the monetary history of Roman Africa repeat this labor; much better that we both have the opportunity to utilize the data that has already been collected, employing our efforts instead in adding to the body of material and performing interesting analyses on it to reach novel conclusions. In this same vein, another advantage of providing open access to such a database is that combining data from multiple sources produces larger datasets than would be possible for any individual to amass on their own.This, in turn, allows new and powerful analyses to be run, which can illuminate new aspects of the material as well as support interesting interpretations on a broader range of topics and areas that could not have been reached without accessible data. Several collaborative, interdisciplinary research projects have, in fact, been put together seeking to take advantage of the opportunities for large-scale, cross-cultural and diachronic analysis.77 The final and perhaps most important benefit of this publication is that exposing the evidence that forms the basis of a scholarly argument allows the research to be reproducible and, thereby, defensible. This aspect should not be undervalued, as the lack of reproducibility and falsifiability is arguably a major weakness of humanities research today.78 This article, along with the appended database, thus, seeks to contribute to future research that can take advantage of all three of these benefits, in addition to enriching the study of the monetary and economic history of Roman North Africa generally. This can be elucidated further: if only coins minted before 235 CE are included, this leaves 7,985 coins (Table 2).All but 15 of these coins come from the mint at Rome.19 235 CE is chosen as this is the likely date that antoniniani were reintroduced and certainly when they begin to appear in great numbers.The extremely high numbers of antoniniani which were minted between roughly 235 and 275 CE altered the landscape of imperial coinage, although other denominations were still being minted until Aurelian u2019s and Diocletian u2019s reforms. It is also worth pointing out here that less than 8,000 coins found in hoards or as site finds is not a very large quantity from a study area that includes the entire region of North Africa, comprising four Roman provinces, and covers a period of 249 years, 23 BCE to 235 CE.It is notable that roughly the same number of coins from Gaul during this same period are included in the database, although as I discuss here I did not make as exhaustive a survey of the Gallic material as with the African, meaning that it is likely that Gaul actually has left significantly more coins than this in the archaeological record. n nDenomination Hoard Site Find Total % of Total antoninianus 12 10 22 <1 as 4 208 212 3 aureus 38 1 39 <1 denarius 3428 134 3562 45 dupondius 1 69 70 <1 dupondiusas 1 u00f8 1 <1 quadrans u00f8 10 10 <1 sestertius 3753 134 3887 49 unidentifiable bronze u00f8 182 182 2 Total 7237 748 7985 n nSomewhat ironically, North Africa's stability and prosperity during the imperial period may actually be one of the primary reasons that it has left relatively few coins compared to other regions. This is because coins are available to be studied by modern scholars when the coin is lost or buried in antiquity and never recovered.Coins certainly do represent a snap-shot of the monetary economy of the area in which they are recovered, but it is a somewhat skewed picture.Coins left unrecovered u2014in the ground, waiting to be found and studied u2014tend to either be of very low qualityvalue (essentially 'discarded' or lost), or hoards of coins buried together and, for a variety of reasons, never dug up again. The chief reason that ancient hoards went un-collected is that the people who buried it moved away or died before they had a chance to recover the material, spend it, move it, or melt it down for its metal; and the most common cause of this in antiquity was warfare.In other words, the number of coins found in a given region, especially those found in hoards, can be a strong positive proxy for the level of military and political turmoil in that region.20 n nThis is not to say that hoarding itself was driven solely by warfare, that people would bury coins out of fear of invading troops. Rather, warfare resulted in the death or dislocation of large numbers of people u2014people who had buried coins and, thus, were not able to recover them.Ancient warfare is a key element in the modern-day recovery of coins from antiquity, because in other cases stored coins tended to be recovered or found by someone else, re-used, worn-down, and, eventually, melted down to recuperate the metal the coin contained u2014meaning, critically, that the coins are not available to be found and studied in modern times. This is a particularly salient point when considering the numismatic record from North Africa, for the region remained remarkably stable in terms of military conflict, political instability, disease, and other markers of turmoil compared to northwestern Europe throughout the imperial period and even into the chaotic third century CE.21 The relative paucity of numismatic material from Africa during this period, then, may be in part a product of this relative freedom from warfare, rather than an indication of a poorly-functioning monetary economy. Moreover, the relative economic stability enjoyed by the region would have contributed to this pattern for similar reasons, for a stable monetary economy means that coins retain their value for longer periods, so that they are less 'expendable' and so do not become stray finds and so hoards containing those coins remain 'worth recovering'. I treat the important topic of recoverability in more detail below. n nConcerning the evidence that we do have, as is immediately apparent from Table 2, of coins minted before 235 CE, the denarius and sestertius are by far the most frequently occurring in the evidence, representing 45% and 49% of the total, respectively. It is expected that these would be the two most frequently found denominations, as these were two of the staples of the imperial monetary system.What is curious is that they were found in nearly the same quantity: 3,562 denarii (3,428 from hoards; 134 from site finds) and 3,887 sestertii (3,753 from hoards; 134 from site finds).Traditionally, it has been often assumed that the highest value coins available are hoarded together, whereas site finds tend to be the lowest value coins. It is notable, therefore, that there are not significantly more high-value silver denarii hoarded than lower-value bronze sestertii,22 nor substantially more sestertii than denarii recovered as site finds.More expected is that asses and dupondii were mostly found as site finds, and only a handful of these very low value bronze coins were found in hoards, while aurei exhibit the opposite pattern. n nDenomination Hoard Site Find Total % of Total antoninianus 19653 362 20015 78 as u00f8 8 8 <1 denarius 1175 1 1176 5 sestertius 4292 35 4327 17 unidentifiable bronze u00f8 4 4 <1 Total 25120 410 25530 n nDenomination Hoard Site Find Total % of Total as u00f8 8 8 <1 denarius 1175 1 1176 21 sestertius 4292 35 4327 78 unidentifiable bronze u00f8 4 4 <1 Total 5467 48 5515 n nThe fact that denarii and sestertii minted before 235 CE appear in Africa in roughly equal numbers, then, is a significant finding and deserves some more attention (Table 3). Interestingly, when only the coins minted after 235 CE are considered (Table 3a), there are 4,327 sestertii, the most represented coin in this period after antoniniani.When the antononinianus is not included (Table 3b), this represents a surprising 78% of the 5,515 total.Denarii, in turn, account for only 1,176 (4%) of all African coins minted between 236-275 CE (Table 3a), 21% without antoniniani (Table 3b). n nTaking a larger snapshot and looking at the entire period 23 BCE to 275 CE (Table 4), 13,478 coins are known from Africa, not including antoniniani. Of these, 8,214 or 61% are sestertii (8,045 hoards; 169 site finds), 4,738 or 35% are denarii (4,603 from hoards; 135 site finds), 39 are aurei, and the rest are fractional bronzes.This demonstrates that sestertii from all periods represent a greater percentage of the non-antoninianus total than sestertii minted pre-235, specifically 61% as opposed to 49%.The proportion of denarii, of course, decreases in turn. Still, it is quite significant that both denarii and sestertii of the imperial period have been found in fairly large numbers, although very few hoards contain both bronze and silver coins in any significant quantity.Also, nearly 1.75 times the number of sestertii as denarii have been found in the region overall, including the hoard evidence. n nDenomination Hoard Site Find Total % of Total as 4 216 220 2 aureus 38 1 39 <1 denarius 4603 135 4738 35 dupondius 1 69 70 <1 dupondiusas 1 u00f8 1 <1 quadrans u00f8 10 10 <1 sestertius 8045 169 8214 61 unidentifiable bronze u00f8 186 186 <1 Total 12692 786 13478 n nUnderstanding the proportional representation of the different denominations is revealing, for the African evidence does not mirror the numismatic record from other parts of the Empire. This is especially striking in the case of the Gallic provinces, encompassing roughly the modern countries of France, Belgium, Luxembourg, Switzerland, and parts of western Germany.Roman Gaul was a large (although significantly smaller) and economically important region as was Roman Africa and has been home to some of the best numismatic research in the last several decades.Much, therefore, is known about the monetary history of the region in the imperial period. The consensus among scholars is that, during the second half of the third century CE, the tri-metallic monetary system of the high imperial period essentially collapsed into a bimetallic system u2013 the gold aureus and the billon antoninianus.23 In short, antoniniani dominate Gallic coin finds, while the vast majority of the non-antoniniani coins are bronze coins minted in the Antonine period, not later.24 n nMore importantly for the issue of denominational patterns, when discussing the rise of antoniniani in the western Empire during the third century, Estiot records that roughly 300,000 antoniniani have been found in the western half of the Empire in hoards, while an additional 30,000 have been identified in excavations; the vast majority of which were found in France, Belgium, or Britain.25 Presumably these figures include some of the African material, although Estiot did not attempt an exhaustive survey of African coins, but was rather mainly concerned with the evidence from northern Europe. Even if all of the African antoniniani were known to Estiot, I am able to reconstruct from the available evidence only 20,037 antoniniani recovered from Africa (Table 1), a mere 6% of the total number identified by Estiot.It is important to stress again that more coins have been found in Gaul and in Britain than in Africa overall, although, crucially, this is heavily weighted with antoniniani.Indeed, in an important study of third century coinage found in Gaul and Britain, Depeyrot and Hollard studied over 350,000 Roman coins minted between 238 and 276 CE found in 65 separate hoards, which in itself dwarfs the total number of coins I was able to identify from Africa for the entire high imperial period.26 Of these 350,000 mid-third century coins, the authors identify only 229 denarii, about 0.06% of the total, and no sestertii.27 n nInterestingly, my own albeit partial survey of the Gallic numismatic material likewise includes fewer denarii and sestertii from that region than from Africa. This search revealed 6,694 sestertii, less than the 8,214 known from Africa. I also found 3,360 denarii in Gallic hoards,28 compared with 4,738 from Africa.When the roughly 300,000 antoniniani identified from northern Europe by Estiot are considered, the number of denarii and sestertii from Gallic hoards represent on the order of 1-2% of the total number of pre-Aurelian coins known from the region, considerably less than the ratio from Africa.29 A similar picture emerges with the coins from Roman Britain. Indeed, a single hoard from Cunetio in southeastern Britain, one of the largest single collections of Roman coins ever found, offers a fairly representative picture of the circulation history of the region and encompasses in itself more than the total number of coins I have been able to identify from all of Africa.The Cunetio hoard features 54,951 coins dating from the late first century CE to the reign of Aurelian, of which only 630 are denarii (about 1.5% of the total) and only one sestertius.30 n nThis all implies strongly that antoniniani did not circulate to nearly the same extent in Africa during the mid-third century as they did in northern Europe. There are fewer denarii and sestertii known from the Gallic provinces and Britain than I have been able to gather from Africa.What this means in terms of the type of coins circulating in different parts of the Empire, then, is that the coin populations of Roman Africa seem to have been considerably more stable than in northern Europe at least up to the mid-third century;31 although in both regions the preponderance of antoniniani minting certainly had a significant effect on circulation patterns after 235 CE, sestertii and denarii remained in circulation after this date in greater numbers in Africa than elsewhere. n nb) Chronological Patterns n nPerhaps the most important patterns, and the aspect which most sets Africa u2019s monetary history apart from that of other areas of the western Empire, are the chronological ones. I mentioned above that Africa displays a more steady, stable numismatic record over the course of the high imperial period than can be seen in northern Europe. This is borne out by a close look at the chronological patterns.Figures 1 and 2 present histograms of the number of coins found in Africa, both hoards and site finds, by decade in which the coins were minted.32 These illustrations clearly reveal that there is a fairly steady representation of coins throughout the high imperial period. n nFigure 1 includes antoniniani, which represent the majority of overall coin finds, as noted above. Since this coinage was not minted before 215 CE, this skews the results towards the right half of the graph.Still, it is notable that there is an uneven distribution throughout the period when antoniniani were being minted in great numbers, after about 235 CE.Coins from the 260s and 270s are by far the most numerous of any category, representing 21% and 37% of the total, respectively.This further demonstrates that, while antoniniani came to dominate the circulation pattern of Africa as it did in the rest of the western Empire, this dominance did not occur until the 250s at earliest, well into the period when antoniniani were being minted. The relatively stable circulation pattern enjoyed by Africa is illustrated more plainly in Figure 2, which is a breakdown of coins by decade in which they were minted not including antoniniani.This Figure shows that nearly all decades of the high imperial period are well represented. n nMore significant is that the early 200s, covering the Severan period, are well-represented in the number of coin finds, shown clearly in Figure 2. This is important because, as mentioned, it is a very different pattern from that recorded in Gaul and Britain.Owing likely to a variety of factors including military, political, and economic turmoil along with dwindling metal supplies, the coinage circulating in northwestern Europe was essentially not restocked after the Antonine period, a gap that was eventually filled with antoniniani.33 As Estiot remarks, there is essentially a hiatus in the numismatic evidence from 193 to about 260 CE between the last nadir of minting good quality imperial silver and bronze coins in the late Antonine period and the appearance in huge numbers of antoniniani.34 Her remark, however, is based almost exclusively on evidence from northwestern Europe, on finds from Roman Gaul, Germany, and Britain; in the rest of the western Empire, namely Italy, Spain, and, of course, Africa, this gap is far less severe.35 #p31Further, finds from the different African provinces largely conform to this pattern as well. As can be seen in Figure 3, the distribution by mint date of coins found in Africa Proconsularis as well as in Mauretania Caesariensis are heavily skewed towards the 250s and later because of the large numbers of antoniniani found in these provinces.Conversely, Numidia and Mauretania Tingitana show more even distributions, although it is perhaps significant that Numidia shows many coins minted in the 220s through 240s, which may be related to the high rate of hoarding the province experienced during the strife of the 250s as scholars such as Salama have posited, discussed above. When antoniniani are not included, the distribution of all provinces is much more even (Figure 4).36 Crucially, Numidia still shows a large number of non-antoniniani minted after 220 CE, which strongly suggests that it was not simply high-quality Antonine and Severan issues which were hoarded in that region, as Salamas model would suggest.Figure 4a.Number of coins found in Africa Proconsularis by mint date, not including antoniniani (n=4,005) Figure 4b. Number of coins found in Numidia by mint date, not including antoniniani (n=7,019) Figure 4c.Number of coins found in Mauretania Caesariensis by mint date, not including antoniniani (n=1,776) Figure 4d.Number of coins found in Mauretania Tingitana by mint date, not including antoniniani (n=677) Figure 4 demonstrates that a large number of coins from the region were minted in the 200s, even when antoniniani are removed from analysis. The 160s CE produced the most coins found in the regionu2014during the relatively prosperous Antonine dynasty.The Severan period in the early third century, however, is likewise well represented.Further, only in the two Mauretanian provinces do coins minted earlier represent the largest group; Mauretania Caesariensis shows the most coins from the 30s and 60s CE in the first century CE, while the early second century produced the most number of coins found in Mauretania Tingitana. These results are significant, again, largely because they contrast so strongly with the patterns exhibited by other regions.Notably, when only non-antoniniani are included, Gaul shows a very even curve with the Antonine period being very well represented, typically with coins from the reigns of Trajan, Hadrian, and Antoninus Pius the most frequent.37 Conversely, as discussed above, there is a conspicuous lack of Severan coins found throughout the Gallic provinces, which has led several scholars to assert that the coinage, particularly the bronze denominations, was essentially not restocked after the reign of Commodus. Figure 5.Number of coins found in Gaul by mint date, not including antoniniani (n=7,219) Another key revelation from this material is that denarii and sestertii are both found in relatively high numbers throughout Africa, as well as that large quantity of sestertii minted after the Antonine period have been found in the region.Coins of all denominations minted in the first and second centuries, up to the early Severan period, were circulating in Africa in relatively large numbers. Denarii and fractional bronzes show up in the region progressively rarely over the course of the third century, which is especially acute in site finds of the fractional bronzes, while antoniniani come to dominate the circulation pattern after 235 CE.The most curious feature of the pattern is that sestertii minted in the 200s CE do not exhibit a similar decline as the other non-antoniniani denominations, but are found in large numbers in both hoards and site finds. It is also notable that, although fewer denarii minted after 235 CE have been in Africa than specimens minted earlier, the denomination does not disappear completely until fairly late in the third century.This lends further support to the notion that Africa enjoyed a relatively stable monetary and economic life throughout the third century.It also suggests that, although the region likely did experience some inflationary tendencies after about 160 CE,38 inflation was not particularly severe there until the 250s at the earliest (I discuss the relationship between inflation and these changes in more detail below). The crucial point here is that both of these markers of stability are not echoed by the numismatic record of northern Europe.This picture is further confirmed by the circulation life of the coins found in Africa compared with those from Gaul.Admittedly, the notion that Roman Africa had a thriving economy for most of the imperial period is not an entirely novel one.The reason that the evidence presented here is important is in providing confirmation that the general impression given by other types of material from the region such as textual and epigraphic records; namely, that Africas market activity required a significant amount of coinage to pay wages, buy materials, and invest into the production of a variety of consumer goods.39 Furthermore, the suggestion that the African economy remained productive even during the turmoil of the mid-third century CE and that economic and financial difficulties were lower than in in the region than in other parts of the western Empire are perhaps more contentious ideas, yet they are certainly supported by the numismatic evidence. c) Regional Patterns Figure 6. Number of coins found in Africa by Province (n=33,514) The breakdown of coins found by province are illustrated in Table 5 and Figure 6.Striking in this regard is that the province of Numidia has produced the greatest number of coins minted before 235 CE, yet Africa Proconsularis contains the greatest number of coins overall.This requires elaboration.First, I will look at the patterns exhibited by the pre-235 CE coins, then turn to compare this with the evidence when all coins are considered. Table 5a.Number of coins found in Africa, by province and find context.Denomination.Looking only at coins minted before 235 CE and including both hoarded coins as well as site finds (Table 5b), 3,848 such coins (48% of total) were uncovered in the Roman province of Numidia, roughly what is today eastern Algeria.The next most represented province is Africa Proconsularis, which has produced 2,725 coins, or 34% of the total, with Mauretania Caesariensis having produced about 9% and Mauretania Tingitana the remaining 8.5%. Additionally, these coins come from 66 different sites, including both hoards and site finds: 23 from Africa Proconsularis, 20 from Mauretania Tingitana, 13 from Numidia, and 10 from Mauretania Caesariensis (Table 6a).This is noteworthy, as Proconsularis and Mauretania Tingitana have the largest number of find-spots, although Numidia has the largest number of actual coins found.The Numidian finds, coming from 10 hoards and 3 excavated sites, therefore comprise more coins per find on average than in the other provinces. This observation, however, must be tempered by the fact that one exceptionally large hoard, that from Guelma, contains 2,787 coins, 72% of the Numidian total.40 Similarly, I was able to find records of coins produced by 13 separate excavations around the site of Thamasida in Mauretania Tingitana. I count these as 13 different find-spots; but if they were all counted as a single find-spot, then the total number of sites in Muaretania Tingitana from which I found numismatic records would fall from 20 to 8."
}