{
  "articleId": "isaw_paper22_1",
  "text": "ARTICLE_ID: isaw_paper22_1\nThis volume of ISAW Papers collects papers presented at Re-Rolling the Past Representations and Reinterpretations of Antiquity in Analog and Digital Games, a virtual conference hosted by the Institute for the Study of the Ancient World on November 11-13, 2020.This conference had its origins in a series of board game nights that our co-organizer, Gabriel Mckee, has been hosting at ISAW since 2015.These game nights have been enjoyable social events, but weve also used them as opportunities to dig into the interplay of mechanics and thematic representation in games that interact in some way with the ancient past. This conference emerged directly from the conversations we had surrounding these game night events about the good, bad, and strange ways in which games have turned history, archaeology, and anthropology into playable games.At ISAWs inaugural game night in 2015, a group including graduate students and staff from both ISAW and NYUs Department of Classics played Thebes (2007, originally published as Jenseits von Theben, 2004). A Eurogame by German designer Peter Prinz, the game is set at the height of colonialist archaeology at the turn of the 20th century. Players begin the game in Europe, gathering supplies, conducting research, and hiring assistants.At a certain point, they begin traveling to Greece, Egypt, Palestine, and Mesopotamia to conduct excavations, which are undertaken by reaching into a bag full of tokens.Some of the tokens are artifactsu2014and the game uses specific well-known artifacts from major museum collectionsu2014but the rest are dirt.After the dig is over, players keep the artifactsu2014but put back the dirt. Players get points for having the most, and best, artifacts; for putting on exhibitions; for having the most book-learning, and for attending the most conferences.Thebes is a lot of funu2014but there are a number of potential problems with its representation of archaeology.The games rules require its players to take on the role of colonialist plunderers.As historian Patrick Rael put it, what is actually being simulated is the process by which European imperialists denuded the colonized world of its material history.1 Contemporary archaeologists struggle with the past practices of their discipline and the modern-day legacy of Victorian Orientalism.Depictions of antiquity and archaeology in popular media are not a new phenomenon; visual media such as television programs and movies have long been used as a means of entertaining and educating people about the ancient past. Games about the ancient past, however, are a kind of simulation they formalize real-world events into a system of rules which are then enacted by players who take on the role of an agent inside a narrative system.Requiring active engagement with the subject matter through world building and decision-making, gamesu2014both analog (or tabletop) games and digital (or video) gamesu2014can provide a tool for modeling and experiencing events in fantastic, modern, or historical settings.Thebes is only one game among many that purport to give some version of an experience of archaeology. Focusing on video games, Andrew Reinhard has explored the archaeologist as character in some detail.2 The typical game archaeologistu2014whether in a video game, board game, game book, or RPGu2014is an adventurer in the mold of Indiana Jones, with little interest in provenience or stratigraphy.This character type appears in a wide range of games, including the Tomb Raider series (1996-2018), Legoland (2000), Lost Temple (2011), and Fireball Island (1986). In the setting of a game, Reinhard explains, these tropes are a necessity in order to create via uncomplicated, visual language the simplest idea of what archaeology is.3 But that idea is itself distilled through decades of pop-cultural mediation of the definition and meaning of archaeology.In many games, archaeology and ancient locations and artifacts are used to communicate a sense of mystery or strangeness. Very often, archaeology becomes a nexus for the paranormal, as in games that incorporate Atlantis like Atlantis Rising (2012), the gamebook Time Machine 8 Mystery of Atlantis (1985), and Indiana Jones and the Fate of Atlantis (1992), to name just a few.Others, like the excavation-based game Scarabya (2018), casually blend landscapes comparable to Egypt and Mesoamerica with both Atlantis and an arctic site suggestive of the works of Lovecraft. (Despite this, Scarabyas puzzle mechanic resembles trench excavation, thus making it, in one respect, a rather clever gamification of actual archaeological practice.) This sort of imaginary antiquity is also present in games like Legend of Zelda Breath of the Wild (2017), in which elfin adventurer Link is a sort of archaeologist as well, exploring ancient shrines and collecting pieces of forgotten technology.Anthropologist Jeb Card places this trend of blending the ancient and the mystical in the center of the landscape of what he calls spooky archaeology. Card notes that the supernatural air surrounding the past is not merely the result of outside influence or misinterpretationu2014both the history and current practice of archaeology also continue to give archaeology a mysterious and supernatural profile.4 These ideas repeatedly resurface in the form of alternative and conspiracist archaeologies that have an enormous, and often troubling, cultural cachet. As Card puts it, alternative archaeology, sometimes called pseudoarchaeology, has successfully competed for control of the symbols of archaeology, of the past, and of the charter myths that archaeologists once presented to the public.5In this context, a game like Thebes seems to occupy a much more grounded place on the spectrum of representation of the past, recreating, as it does, a point in time in the real history of archaeology. But the troublesome colonialist aspects of that depiction are unavoidable, and the game presents us with some uncomfortable questions.At the end of the game, the winning player is still the one who has best exploited the games mechanics to abscond with the cultural heritage of the Eastern Mediterranean.In reducing the historical moment of turn-of-the-century archaeology into something playable, do we risk trivializing it? Or is it enough for a game to merely plant a seed of interest in the ancient past in a players mind?Whats at stake in playing a game like Thebes?Whats at stake in enjoying it?In game studies, there is a debateu2014though digital game scholar Gonzalo Frasca refers to it as a debate that never took placeu2014over the relative importance of theme and play mechanics, narrative and ludology.6 For many analog game designers, the play mechanic is of primary importance a game is innovative and exciting because it comes up with a new way to manage the flow of cards, meeples, and tokens, and the theme is essentially window dressing. Prolific Eurogame designer Bruno Faidutti argues that the thematic setting of a game is just a tool used to make the rules clearer.7 There are certainly cases where this is trueu2014for instance, the Rome table in the game Zen Pinball 2 (2010) does not contain much meaningful information about the Roman Empire; the centurions and galleys on display are truly window dressing, present primarily to jazz up a play experience that is mechanical by design. Nevertheless, while the ludological approach makes a certain amount of sense from the standpoint of game design, it is the contention and assumption of the organizers of this conference that theme matters.In devising games based on ancient history and archaeology, some elements will always need to be simplified, essentialized, or left out.These retellings and reimaginings can come at a cost, as certain narratives and storylines can be perpetuated by games, detrimentally reinforcing past and present stereotypes. According to Edward Said, the West has viewed the cultures of the East as framed by the classroom, the criminal court, the prison, the illustrated manual.Orientalism, then, is knowledge of the Orient that places things Oriental in class, court, prison, or manual for scrutiny, study, judgment, discipline, or governing.8 To Saids list of frames of reference, we can add both analog and digital games; to his list of activities, we can add play. And players are starting to demand more from their games, using online platforms to challenge cases of cultural appropriation, gender and racial stereotypes, and historical and archaeological inaccuracies.These calls for change are accompanied by an increase in the number of academic studies that take games and gaming culture as their subject, particularly within the humanities and social sciences. We have a responsibility to ensure that, in representing cultures of both the past and present, we are not modeling colonization and control.Faidutti is aware of this problem, if a bit glibly dismissive of it.He notes that there is something if not reactionary, at least romantic or backward looking in board game themes.9 Moreover, he grants that the graphic design of many board games, including his own, reflects a plain orientalist exoticism, of a kind that has disappeared from literature, movies and even comics.10 Faidutti seems to be thoroughly on the ludological side of the debate, arguing that games are not scholarly works. Though he conducts a certain amount of research into his game settings, he trie[s] to be true to the clichu00e9, not to the reality, deliberately presenting an ironic exoticism in his games, which include Isla Dorada (2010), Attila (2015), and Incan Gold (2006, originally published as Diamant, 2005).11 It is worth noting that Faidutti is also the co-creator of the game Silk Road (2006), which explores ancient transcontinental trade networks without resorting to caricature and with a minimum of exoticization.David Parlett, author of the Oxford History of Board Games, draws a sharp distinction between games with a theme and simulation games that intend to provide a representation of real-world events, like war games practiced by the military.12 We propose that this distinction be questioned. Themed and historical games can indeed be simulationsu2014albeit with a greater degree of abstraction.Indeed, some degree of abstraction is necessary in any simulation, and so if there is a difference between simulation and theme it is only one of degree.There exists a spectrum, from, for example, military wargames at the Naval Academy at one end to chess on the other.In the middle, we have games like the highly abstract Risk (1959), TSRs much more detailed Julius Caesar (1985), the similarly detailed but fantastical wargame War of the Ring (2004), and the heavily rendered digital simulation Rome II Total War (2013). All of these games represent combat, with greater and lesser degrees of precision and granularity.Some of them represent historical battles, and some imaginary conflicts, and some the barest idea of battleu2014but all are abstractions of real-life combat.Moreover, there has been historical interplay between these levels of abstractionu2014author Jon Petersons book Playing at the World explores in great detail the history of wargaming, and in particular the development of fantasy role-playing games out of a culture of miniature wargaming. Tabletop wargaming, in turn, had its roots in games like Tactics (1954) and Diplomacy (1959) that were played by military strategists in the period following the Second World War.13 Its worth mentioning that Dungeons & Dragons (1974-present), and thus the entire realm of roleplaying games, had its origins in part in the tension that Gary Gygax, Dave Arneson, and others in the miniature wargaming community of the 1960s felt over playing at war in the Vietnam era.14 Clearly, taking a critical approach to both designing and enjoying games can bear enormous creative benefits for game designers and players.Figure 1. A continuum of simulation in games.Images Javier Chagoya, NPS wargame 2018. Wikimedia Commons.Public domain.Games Workshop Limited.Rome II Total War. totalwar.com.@Desaix, Julius Caesar Game of the Gallic Wars.Boardgamegeek.com.Eric Martin, War of the Ring (second edition).Boardgamegeek.com.Hexahedron, Risk 1975 box front.Boardgamegeek.com.Marcobeltrametti, Ancient Chess.Wikimedia Commons.Creative Commons Attribution-Share Alike 4.0 International.But its also important to remember that historical accuracy, an undoubtedly fraught phrase, is not everything. Theme matters, but play matters too.In his recent book Digital Games as History, Adam Chapman cautions against an overemphasis on games providing the right version of history We cannot simply expect digital historical games to always function in alignment with narratives constructed in other forms, because they operate differently and therefore represent the past and offer engagements with history according to their own rules of engagement.15 He urges instead for an exploration of a games u2018historioludicity u2013 the representation of history and our thought about itu2026 through rules and opportunities for action and thus, ludic discourse.16 Or, as Andrew Elliott and Matthew Kapell put it, it is less interesting to note where and whether a given product deviates from the historical record, but rather for what reason it does so and what effect this might have.17 Of course, this assumes that game designers have approached the question of history with care and attention, and that they have reasons for deviating from what we know about the past. Its just as possible thatu2014since theme and setting are secondary to many game designersu2014that they instead settle for what is assumed rather than what is known, filling in the theme blank with clichu00e9s and misconceptions about the past.Even here, though, we cannot simply dismiss such games as a form of history.As Jeremiah McCall notes, historical video games (and boardgames too for that matter) are history, even when not designed by academic historians. They do the work of history, the curated representation of the past to those in the present.They will continue to do so even without being colonized by academic historians.18 McCall proposes a means of charting a course through the evaluation of games as history that he calls the Historical Problem Space Framework, a holistic approach to evaluating historical games that emphasizes the experience of agent-based exploration of a gameworld. This framework goes beyond a simple evaluation of a games presentation of factual information, taking into account the complex interplay of the player, the gameworld, interactive elements, and strategy that produce a virtual experience of a games historical context.McCalls approach is particularly geared toward evaluating games used in an educational setting, and he notes that to effectively analyze a historical game, students will need to go beyond information they read or hear and construct knowledge, evidence organized into a framework about agents and their actions.19 This knowledge production is a key pedagogical outcome, showing the powerful potential games have as a teaching tool.Games have been used to teach history for decadesu2014the first incarnation of Oregon Trail (1971-2011) dates to 1971, but an even lesser-known gameu2014the code of which no longer survivesu2014predates it. One of the earliest computer games ever developed, created in the mid-1960s by a team under Richard Wing at the Board of Cooperative Educational Services and written by Mabel Addis, was The Sumerian Game (1964), which modeled the economic administration of the city of Lagash.20 The pedagogical value of play has been embraced by instructors and organizations like the Barnard College-based Reacting to the Past consortium, which has developed immersive, historically-set role-playing games that have been adopted by many colleges and universities first-year programming for undergraduate students.21 Weve only begun to explore the educational possibilities of games, and the study of ancient history is an excellent laboratory for that exploration.Over the last decade, the academy has begun to take games seriously as a subject of study. A surge in conferences, academic journals, and book series on games; commercial games that seek the input of scholars for greater veracity; instructors who use games as pedagogical tools; and researchers who design games as an alternative avenue for presenting research all demonstrate the increasing cross-pollination between the academic community and the gaming industry.Of particular scholarly interest is the newly coined field of archaeogaming, which explores the representation and practical application of archaeology inof video games. These topics are being discussed and debated through journals like Analog Game Studies, Game Studies, and Rethinking History, and books such as Archaeogaming An Introduction to Archaeology in and of Video Games (Reinhard 2018) and Classical Antiquity in Video Games Playing with the Ancient World (Rollinger, ed., 2020).The intersection of games and the ancient past have been the subject of a wealth of recent academic meetings, including Playing the Past Archaeology and Video Games Play Well Together (Brown University, 2019), Interactive Pasts Exploring the Intersections of Archaeology and Video Games (Leiden University, 2016, 2018, and 2020), and Archaeology of the Near East and Video Games (session at ASORs Annual Meeting, 2019).The contributions to this volume of ISAW Papers explore a range of aspects of the interplay between gameplay and the ancient past. Where much of the past scholarship on games and history has focused on one particular format of games, here we take a holistic approach, incorporating both analog and digital games as based on similar principles and embodying the experience of play.Our contributors include ancient historians, archaeologists, and game designers (some of whom are also ancient historians and archaeologists).Some of our contributors look at the ways that archaeological and historical methodologies can teach us about games both ancient and modern. Others focus on the pedagogical applications of play, from teaching using in-class games to using digital game engines to present information about cultural heritage.Others explore the methodology of game design, taking both critical and ludological views of representing the past as play.It is our hope that this publication can serve as a springboard to further discussion and collaboration between the realms of archaeologyancient history and game design."
}